{
    "items": [
        {
            "tags": [
                "coordinate-system",
                "leaflet",
                "openstreetmap",
                "google-maps",
                "web-mapping"
            ],
            "question_score": 250,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 48949,
            "item_type": "question",
            "score": 250,
            "last_activity_date": 1680647894,
            "creation_date": 1359011218,
            "body": "The discussion at What is the difference between WGS84 and EPSG4326? shows that 4326 is just the EPSG identifier of WGS84..\n\nWikipedia entries for Google Maps and OpenStreetMap shows that they both use  WGS 84.\n\nhttp://wiki.openstreetmap.org/wiki/EPSG:3857 states that \n\nEPSG:3857 is a Spherical Mercator projection coordinate system popularized by web services such as Google and later OpenStreetMap. \n\nLeaflet&#39;s help states:\n\nEPSG3857 The most common CRS for online maps, used by almost all free and commercial tile providers. Uses Spherical Mercator projection. Set in by default in Map&#39;s crs option.|\n\nEPSG4326 A common CRS among GIS enthusiasts. Uses simple Equirectangular projection.\n\nThis is confusing - it seems that Google Maps and OpenStreetMap use EPSG3857 but they use WGS84 which &#39;is&#39; EPSG4326. Something can&#39;t be right here, most likely my understanding. \n\nCould someone help me understand?\n",
            "excerpt": ".|\n\nEPSG4326 A common CRS among <span class=\"highlight\">GIS</span> enthusiasts. Uses simple Equirectangular projection. &hellip; ",
            "title": "EPSG 3857 or 4326 for Web Mapping"
        },
        {
            "tags": [
                "qgis",
                "installation",
                "file-geodatabase",
                "osgeo4w"
            ],
            "question_score": 184,
            "is_accepted": true,
            "answer_id": 26301,
            "is_answered": false,
            "question_id": 26285,
            "item_type": "answer",
            "score": 213,
            "last_activity_date": 1512529830,
            "creation_date": 1338194071,
            "body": "Update December 2017\n\nNow you can simply drag&amp;drop .gdb file (directory) into QGIS. This is read access to File Geodatabases only. If you require write access please read further.\n\nUpdate July 2015 \n\nIt is time to bring this answer a bit more current as some elements of FileGDB support in QGIS have changed.  I am now running QGIS 2.10.0 - Pisa.  It was installed using the OSGeo4W installer.  \n\nWhat has changed is that upon the basic install of QGIS, File GDB read-only access is enabled by default, using the Open FileGDB driver.  Credit for first noting this must be given to @SaultDon.\nRead/Write access may be enabled using the FileGDB driver install through the OGR_FileGDB library.  The library needs to be enabled using the process below, either when you install QGIS, or individually.  More detail about the drivers is below:  \n\n\nFileGDB driver:  Uses the FileDB API SDK from ESRI - Read/Write to FGDB&#39;s of ArcGIS 10 and above  \nOpenFleGDB driver:  Available in GDAL &gt;= 1.11 - Read Only access to FGDB&#39;s of ArcGIS 9 and above\n\n\nWhen you add a Vector Layer, you simply choose the  based on the driver you want to use.\nESRI FileGDB Driver\n\n\nOpen FileGDB Driver\n\n\nThe process below shows in more detail the steps to install QGIS from the OSGeo4W installer, ensure the OGR_FileGDB library is installed, then load layers from a File Geodatabase.\n\n\nDownload and run  for 32bit or  for 64bit from OSGeo4W.\nChoose Advanced Install, then Install from Internet.  Choose your root and local package directories, and then your connection type, in my case, &quot;Direct Connection&quot;.  Once you click next, it will bring up a screen with a number of collapsed menus.\n\nExpand the &quot;Desktop&quot; menu.  Find the entry for &quot;qgis: Quantum GIS (desktop)&quot;.  In the &quot;New&quot; column, change entry from &quot;Skip&quot;, to show version 2.10.0-1.\n\nExpand the &quot;Libs&quot; menu.  Find the entry for &quot;gdal-filegdb: OGR FileGDB Driver&quot;.  In the &quot;New&quot; column, change the entry from &quot;Skip&quot;, to show version 1.11.2-1.\n\nOnce you click Next, it will install QGIS and all of the associated libraries.  Once this is completed, open Quantum GIS, and Choose &quot;Add Vector Data&quot;.  Change the option to &quot;Directory&quot;.  This is where you choose the driver as shown above.\n\nBrowse to the File Geodatabase and select the directory.  Click &quot;Open&quot;\n\nSelect a Vector Layer and press &quot;Ok&quot;.  Please note that the FileGDB API Does not support Raster Images.\n\nAs you can see, the selected layer loads in.  Using the Esri driver, editing is possible.  If you use the Open FileGDB driver, the data is read only.\n\nFor your reference, here is the &quot;About&quot; window from my install of QGIS, showing the versions of the software, and the GDAL/OGR library being used.\n\n\n\nThis install was performed on a Windows 7 64bit computer.  With previous installers, there were some inconsistent results.  This may have changed with the switch to the 32 or 64bit installers.  This thread at OSGeo discusses some old issues people were experiencing: Thread\n",
            "excerpt": "Find the entry for &quot;qgis: Quantum <span class=\"highlight\">GIS</span> (desktop)&quot;.  In the &quot;New&quot; column, change entry from &quot;Skip&quot;, to show version 2.10.0-1.\n\nExpand the &quot;Libs&quot; menu. &hellip; Once this is completed, open Quantum <span class=\"highlight\">GIS</span>, and Choose &quot;Add Vector Data&quot;.  Change the option to &quot;Directory&quot;.  This is where you choose the driver as shown above. &hellip; ",
            "title": "Installing File Geodatabase (*.gdb) support in QGIS"
        },
        {
            "tags": [
                "cartography"
            ],
            "question_score": 184,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 47,
            "is_answered": true,
            "question_id": 3083,
            "item_type": "question",
            "score": 184,
            "last_activity_date": 1608716591,
            "creation_date": 1288479363,
            "body": "Oftentimes when we make maps it is based on our subjective interpretation of what is aesthetically pleasing. I would like it if people posted examples of beautiful maps, displaying any phenomena in any manner.\n\nBelow I have posted one of my favorite maps. This is an example of a value-by-alpha map recently asked about as How to implement value-by-alpha map in GIS?, and the picture is taken from the GeoVista website.\n\n\n\nCitation for the map&#39;s makers:\n\n\n  Geovisual analytics to enhance spatial scan statistic interpretation:\n  an analysis of U.S. cervical cancer mortality Jin Chen , Robert E Roth\n  , Adam T Naito , Eugene J Lengerich and Alan M MacEachren\n  International Journal of Health Geographics 2008, 7:57\n\n\nIt would be best for the cultivation of knowledge if people would elaborate on why the particular maps they cite are beautiful. \n\nThe reason I believe I think the cited value-by-alpha map is beautiful is that it creates a very simple, but obvious and striking visual hierarchy with which to interpret the standardized mortality ratio&#39;s. This is in particular useful combined with the very &quot;noisy&quot; standardized mortality ratio&#39;s, and the typically very noisy clusters of abnormally high rates produced by the SatScan clustering technique. One can even clearly see very small clusters around Chicago and Philadelphia. \n\nThere are other supplemental elements of the map that make it easy on the eyes. For example, the black background, the heavier white outline for around the states and the white outline for the states (that is blended the same as the attribute values). Maps with many polygons can particularly be distracting if one does not take care when plotting the polygon outlines. \n\nAlso the legend is particularly well created, and effectively demonstrates the concept (although it certainly isn&#39;t a typical legend, so took some original creative thought).\n",
            "excerpt": "This is an example of a value-by-alpha map recently asked about as How to implement value-by-alpha map in <span class=\"highlight\">GIS</span>?, and the picture is taken from the GeoVista website. &hellip; ",
            "title": "Seeking examples of beautiful maps?"
        },
        {
            "tags": [
                "open-source-gis",
                "software-recommendations",
                "free-software"
            ],
            "question_score": 142,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 42,
            "is_answered": true,
            "question_id": 12105,
            "item_type": "question",
            "score": 142,
            "last_activity_date": 1675916948,
            "creation_date": 1310503656,
            "body": "Note: This question is specifically about installed, desktop software. There is another question specifically about free cloud-based software and services.\n\nWhat free programs should every GIS user have installed?\n\nI&#39;m not necessarily referring to ESRI extensions or open-source products, but others that increase your productivity and ability to handle GIS tasks.\n\nFor example:\n\n\nNotepad++ for writing code snippets or editing XMLs. Paint.NET or GIMP for quick graphic editing.\nI use Google Tasks daily and I think it&#39;s worth mentioning. It&#39;s not GIS-specific, but it&#39;s a great tool, especially if used independently and on multiple projects where purchasing time-management software isn&#39;t reasonable.\nWhile it&#39;s not focused on GIS development, Rainmeter has proven to be very useful in terms of increasing productivity and monitoring system resources. I have created a GIS &quot;sidebar&quot; on my desktop that holds all of my development tools, as well as links to the online resources I used the most. It&#39;s nice to be able to use one location, rather than many (e.g. taskbar, bookmarks in browser, search engine).\n\n",
            "excerpt": "What free programs should every <span class=\"highlight\">GIS</span> user have installed? &hellip; I have created a <span class=\"highlight\">GIS</span> &quot;sidebar&quot; on my desktop that holds all of my development tools, as well as links to the online resources I used the most. &hellip; ",
            "title": "What free programs should every GIS user have installed?"
        },
        {
            "tags": [
                "education"
            ],
            "question_score": 77,
            "is_accepted": true,
            "answer_id": 6549,
            "is_answered": false,
            "question_id": 6535,
            "item_type": "answer",
            "score": 132,
            "last_activity_date": 1471341320,
            "creation_date": 1298658455,
            "body": "I make my living applying mathematics and statistics to solving the kinds of problems a GIS is designed to address.  One can learn to use a GIS effectively without knowing much math at all: millions of people have done it.  But over the years I have read (and responded to) many thousands of questions about GIS and in many of these situations some basic mathematical knowledge, beyond what&#39;s usually taught (and remembered) in high school, would have been a distinct advantage.\n\nThe material that keeps coming up includes the following:\n\n\nTrigonometry and spherical trigonometry.  Let me surprise you: this stuff is overused.  In many cases trig can be avoided altogether by using simpler, but slightly more advanced, techniques, especially basic vector arithmetic.\nElementary differential geometry.  This is the investigation of smooth curves and surfaces.  It was invented by C. F. Gauss in the early 1800&#39;s specifically to support wide-area land surveys, so its applicability to GIS is obvious.  Studying the basics of this field prepares the mind well to understand geodesy, curvature, topographic shapes, and so on.\nTopology.  No, this does not mean what you think it means: the word is consistently abused in GIS.  This field emerged in the early 1900&#39;s as a way to unify otherwise difficult concepts with which people had been grappling for centuries.  These include concepts of infinity, of space, of nearness, of connectedness.  Among the accomplishments of 20th century topology was the ability to describe spaces and calculate with them.  These techniques have trickled down into GIS in the form of vector representations of lines, curves, and polygons, but that merely scratches the surface of what can be done and of the beautiful ideas lurking there.  (For an accessible account of part of this history, read Imre Lakatos&#39; Proofs and Refutations.  This book is a series of dialogs within a hypothetical classroom that is pondering questions that we would recognize as characterizing the elements of a 3D GIS.  It requires no math beyond grade school but eventually introduces the reader to homology theory.)\n\nDifferential geometry and topology also deal with &quot;fields&quot; of geometric objects, including the vector and tensor fields Waldo Tobler has been talking about for the latter part of his career.  These describe extensive phenomena within space, such as temperatures, winds, and crustal movements.\nCalculus. Many people in GIS are asked to optimize something: find the best route, find the best corridor, the best view, the best configuration of service areas, etc.  Calculus underlies all thinking about optimizing functions that depend smoothly on their parameters.  It also offers ways to think about and calculate lengths, areas, and volumes.  You don&#39;t need to know much Calculus, but a little will go a long way.\nNumerical analysis. We often have difficulties solving problems with the computer because we run into limits of precision and accuracy.  This can cause our procedures to take a long time to execute (or be impossible to run) and can result in wrong answers.  It helps to know the basic principles of this field so that you can understand where the pitfalls are and work around them.\nComputer science. Specifically, some discrete mathematics and methods of optimization contained therein.  This includes some basic graph theory, design of data structures, algorithms, and recursion, as well as a study of complexity theory.\nGeometry. Of course.  But not Euclidean geometry: a tiny bit of spherical geometry, naturally; but more important is the modern view (dating to Felix Klein in the late 1800&#39;s) of geometry as the study of groups of transformations of objects.  This is the unifying concept to moving objects around on the earth or on the map, to congruence, to similarity.\nStatistics. Not all GIS professionals need to know statistics, but it is becoming clear that a basic statistical way of thinking is essential.  All our data are ultimately derived from measurements and heavily processed afterwards.  The measurements and the processing introduce errors that can only be treated as random.  We need to understand randomness, how to model it, how to control it when possible, and how to measure it and respond to it in any case.  That does not mean studying t-tests, F-tests, etc; it means studying the foundations of statistics so that we can become effective problem solvers and decision makers in the face of chance.  It also means learning some modern ideas of statistics, including exploratory data analysis and robust estimation as well as principles of constructing statistical models.\n\n\n\n\nPlease note that I am not advocating that all GIS practitioners need to learn all this stuff!  Also, I am not suggesting that the different topics should be learned in isolation by taking separate courses.  This is merely an (incomplete) compendium of some of the most powerful and beautiful ideas that many GIS people would deeply appreciate (and be able to apply) were they to know them.  What I suspect we need is to learn enough about these subjects to know when they might be applicable, to know where to go for help, and to know how to learn more if it should be needed for a project or a job.  From that perspective, taking a lot of courses would be overkill and would likely tax the patience of the most dedicated student.  But for anyone who has an opportunity to learn some mathematics and has a choice of what to learn and how to learn it, this list might provide some guidance.\n",
            "excerpt": "One can learn to use a <span class=\"highlight\">GIS</span> effectively without knowing much math at all: millions of people have done it. &hellip; No, this does not mean what you think it means: the word is consistently abused in <span class=\"highlight\">GIS</span>. &hellip; ",
            "title": "How much math does a GIS Analyst need to know?"
        },
        {
            "tags": [
                "coordinate-system",
                "mapinfo",
                "latitude-longitude"
            ],
            "question_score": 126,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 11626,
            "item_type": "question",
            "score": 126,
            "last_activity_date": 1684956311,
            "creation_date": 1309385764,
            "body": "I am using Mapinfo and it has Y as latitude and X as longitude. Is that the same case for all mapping software? As for any country their respective value is multiple of 1 or -1. So for Nepal can I say it is on positive side +1 for both latitude and longitude? And for USA to be +1 Y and -1 X.\n",
            "excerpt": "I am using Mapinfo and it has Y as latitude and X as longitude. Is that the same case for all mapping software? As for any country their respective value is multiple of 1 or -1. So for Nepal can I say &hellip; ",
            "title": "Does Y mean latitude and X mean longitude in every GIS software?"
        },
        {
            "tags": [
                "openlayers-2",
                "leaflet",
                "software-recommendations",
                "api"
            ],
            "question_score": 119,
            "is_accepted": true,
            "answer_id": 34705,
            "is_answered": false,
            "question_id": 33918,
            "item_type": "answer",
            "score": 104,
            "last_activity_date": 1480637213,
            "creation_date": 1349154726,
            "body": "I have used both OpenLayers and Leaflet in my apps. There has been so much discussion on this topic in this forum and others on planet-internet. They usually fall into 2 camps - features and flexibility of OpenLayers versus simplicity of Leaflet. I would not be surprised if someone spawns an &quot;OpenLeaf&quot; initiative soon marrying the best of both worlds!\n\nI found Leaflet very simple to use, a petite 64K size, compared to over 700K Openlayers, and in very few steps you can create apps that have the freshness and eye-candy of today&#39;s web and mobile GIS apps. Your stack - GeoServer, PostGIS etc., is a standard stack, so OpenLayers or Leaflet could easily be incorporated.\n\nHaving said that, I would still go with OpenLayers for the following reasons\n\n\nThere is just a TON of material around OpenLayers. It is a lot more mature than Leaflet.\nCheck out the comparison on commits and users.\nOpenLayers, GeoServer, PostGIS stack is so proven in the FOSS world that you are going on a path that is solid.\nOpenLayers has tad bit more features on Map Controls.\nWhile its a bit more work to create transitions and visual-effects, it can be done in OpenLayers.\n\n",
            "excerpt": "I found Leaflet very simple to use, a petite 64K size, compared to over 700K Openlayers, and in very few steps you can create apps that have the freshness and eye-candy of today&#39;s web and mobile <span class=\"highlight\">GIS</span> apps &hellip; ",
            "title": "Choosing OpenLayers or Leaflet?"
        },
        {
            "tags": [
                "postgis",
                "postgresql",
                "geography-data-type",
                "indexing",
                "operator"
            ],
            "question_score": 58,
            "is_accepted": true,
            "answer_id": 223490,
            "is_answered": false,
            "question_id": 223487,
            "item_type": "answer",
            "score": 99,
            "last_activity_date": 1483676955,
            "creation_date": 1483662261,
            "body": "If you re-wound the universe to early 2001, and not only let the inventors of PostGIS see the future, but also let the PSC of PgSQL see the future, perhaps PostGIS would be a series of patches on PgSQL. But at a minimum, if we had started as patches to core, the first thing we would have run up against is:\n\n\ncore PgSQL areas don&#39;t support holes, but the GIS model really wants holes, can we change that?\n\n\nAnd core PgSQL would have said: &quot;no, of course not, areas have an existing well-understood semantic and we can&#39;t go making backwards incompatible changes like that&quot;.\n\nAs non-core developers, PostGIS was able to knock out monthly and 6-monthly releases for a number of years while PgSQL core plodded along with annual and longer releases. We were also able to add whatever features we wanted, whenever, since we had commit rights in our project, but gaining commit rights in PgSQL takes a Very Long Time.\n\nBy the time PostGIS was demonstrating enough external value that PgSQL core looked over and said to themselves &quot;huh, that would have been nice to have in core as an extra feature&quot;, there was already so much code of such a different standard and style from PgSQL (not to mention under an incompatible license) that the idea of merging was not really possible. \n\nInstead, PostGIS has become the canonical example of a Really Large Complex Extension that helps PgSQL remain modular and extensible. &quot;How will this effect something like PostGIS&quot; is a question often asked as core PgSQL evaluates some change. This is also a good thing, not perhaps quite as nice as PostGIS being part of core, but good enough.\n\nThere&#39;s other reasons, like the long list of dependencies PgSQL core would have hated to see, the generally lower code consistency and API cleanliness which they would have despaired of improving, and on and on. Even at conception, PostGIS was too big a hairball for PgSQL to swallow in one bite. \n",
            "excerpt": "But at a minimum, if we had started as patches to core, the first thing we would have run up against is:\n\n\ncore PgSQL areas don&#39;t support holes, but the <span class=\"highlight\">GIS</span> model really wants holes, can we change that &hellip; ",
            "title": "What is the purpose of PostGIS on PostgreSQL?"
        },
        {
            "tags": [
                "javascript",
                "web-mapping"
            ],
            "question_score": 138,
            "is_accepted": true,
            "answer_id": 8048,
            "is_answered": false,
            "question_id": 8032,
            "item_type": "answer",
            "score": 98,
            "last_activity_date": 1504333680,
            "creation_date": 1301676701,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\nFor non-GIS background devs creating single-function mapping apps - I&#39;d probably recommend Leaflet (now supported by MapBox). Easy to use and small. More functionality relies on plugins of varying quality and support. \n\nGIS online type application - use OpenLayers3 - has the full suite of data sources, controls etc. in a single library. It can also be used for simple mapping apps, so if you have a mix then I&#39;d use this for everything. \n\nGoogle still has the library/data combination (e.g. StreetView is not available anywhere else). \n\nEsri has GUI web app builders, and as noted below, why complicate things if you already use their stack. \n\nCommercial APIs (Google, Bing, Yahoo)\n\nUsing any commercial API leaves you at the mercy of whatever changes the provider makes to the API or Terms of Service. What happens for example if suddenly your local government portal that uses Google Maps suddenly has adverts popping up all over it? Want to reuse your JavaScript Google Maps code for an Intranet site? You&#39;ll find yourself having to pay the $10,000 licencing fee. \n\nMicrosoft often have more defined and fixed terms for their services (if paying) so there may be less of a risk here. \n\nThe recent backlash against Twitter is a good example of developers having an API that changed beneath them. If you aren&#39;t paying for a service then you (or your system) are the one being sold. \n\nGoogle started charging for use of their maps from October 2011. \n\nEsri\n\nAs others have mentioned if you are using an Esri stack then the ArcGIS API for JavaScript will no doubt work well on top of it. Coming from a GIS background Esri have probably thought more about traditional GIS tasks and features than the &quot;neo-geography&quot; web-giants (though this is just an opinion/feeling). \n\nOpenLayers has built in support for ArcGIS REST layers, and if you are looking to reuse your code for non-ESRI based websites then again an open API serves you best. \n\nUse OpenLayers...\n\nI can&#39;t really think why developers would use an API other than OpenLayers. Open Source projects lead to related Open Source projects so there are a wealth of reusable components out there such as the GeoExt library, MapQuery,  and GeoPrisma. \n\nI&#39;ll just add that just because a project is Open Source does not automatically make it better than commercial equivalents - but the OpenLayers API matches the commercial competition in this case, and the ability to see how the source works, the unit tests, the build scripts etc. mean that you can easily build new features on top of it. \n\nThere has been some recent criticism of OpenLayers, mainly related to complexity, styling, and size. There have been counter-arguments made to these here and here by Christopher Schmidt one of the lead developers of OpenLayers. \n\nIt is worth noting that if you need a simple Open Source mapping API then take a look at Cloudmade&#39;s Leaflet. \n\nThe comment smaller, faster, newer, and more straightforward can also be read as less features and less tested.\n\nScan the API documentation for Leaflet and OpenLayers. The latter includes items such as WFS layers, editing tools, and SLD support. It has also been tested in many different environments, and works in IE6 (allowing government and local authority users). \n\nFor simpler display of spatial data Leaflet looks ideal, and easier to get started. However I&#39;ll be sticking with OpenLayers for more feature-rich GIS applications. \n\nCaveats\n\nOne possible downside is often new innovations are seen first in commercial providers&#39; systems - however these nearly always filter through to OpenLayers in time. \n\nFinally I&#39;m sure there are certain scenarios where other APIs are more suitable - on custom hardware, to fit in with an organisations other IT systems, or if you already know an API inside-out and can get a system developed in half the time. \n\nAll the APIs you mentioned are capable of producing great online mapping systems, but your choice should also fit in with you or your company&#39;s future development needs. \n",
            "excerpt": "Coming from a <span class=\"highlight\">GIS</span> background Esri have probably thought more about traditional <span class=\"highlight\">GIS</span> tasks and features than the &quot;neo-geography&quot; web-giants (though this is just an opinion/feeling). &hellip; However I&#39;ll be sticking with OpenLayers for more feature-rich <span class=\"highlight\">GIS</span> applications. &hellip; ",
            "title": "Comparing various JavaScript mapping libraries?"
        },
        {
            "tags": [
                "raster",
                "gdal",
                "resampling"
            ],
            "question_score": 60,
            "is_accepted": true,
            "answer_id": 14361,
            "is_answered": false,
            "question_id": 10931,
            "item_type": "answer",
            "score": 98,
            "last_activity_date": 1377891447,
            "creation_date": 1315320985,
            "body": "What is Lanczos resampling?\nAlthough the theory is described in an early paper and the Wikipedia article, a &quot;feel&quot; for resampling methods is best obtained by computing them on simple or standard images.  This can be a vast topic, requiring extensive experimentation, but some simplifications are available:\n\nThese operators work separately in each color channel.  Therefore it suffices to study how they work on a monochromatic (&quot;black and white&quot;) image.\n\nMost convolution operators used in image processing work the same way in the x and y directions and independently in both directions.  In effect, they are really one dimensional operators applied first to the rows and then to the columns.  This means we can study them by studying &quot;1D&quot; images, which can be plotted in detail.\n\nEverything we need to know about a linear operator (which includes all convolution operators) can be inferred from how an operator works on the simplest non-constant image of all: this is a sudden jump from one value to another.\n\n\nLet&#39;s look at an illustration of several popular resampling methods.  Actually, we need two illustrations: one to show what happens in &quot;downsampling,&quot; where the new image is coarser than the old, and another to look at &quot;upsampling,&quot; where the new images is  refinement of the old.  Let&#39;s start with the latter, because it shows more detail.\nUpsampling\n\nThe original 7 by 7 image on the left is really one-dimensional because each row is the same.  The resampling occurs across the columns.  The dimension of the other five images is 80 by 80, showing in detail how each method interpolates between the original coarse pixels.  Nearest-neighbor sampling retains the sharp division between dark and light while the other four methods blur the intervening region to some extent.  Notably, the Lanczos resampler creates some regions that are darker than any in the original and others that are lighter than any in the original.  (This can have implications for GIS work, because such an extrapolation of the original values can potentially cause the new values to be invalid.  They can also extend beyond the range of the original color map, sometimes causing the extreme values in the resampling image to be rendered incorrectly.  This is a problem with bicubic convolution resampling in ArcGIS, for example.)\n(NB: The &quot;bicubic&quot; method shown here is a bicubic spline, not the &quot;bicubic convolution&quot; of ArcGIS.)\nUsing lightness to depict image values, although natural, is not very precise.  The next illustration rectifies this by graphing the cell values (vertical axis) by column (horizontal axis).\n\nLower values on the graphs correspond to darker parts of the images.  A thoughtful examination of the original uncovers a hidden assumption: although the original image looks like a sharp jump from dark to light, the jump actually occurs over one-seventh (1/7) of the extent of the columns.  Who is to say what really happens in that interval in the original scene the image is depicting?  We therefore should not be too critical of differences among the resampling methods that occur within this short interval: each one is giving a different but potentially equally valid rendering of what might be occurring in the original scene.  In this sense, it is no longer apparent that nearest neighbor sampling is the most faithful interpolation method.\nOne conclusion we should draw is that the accuracy of any upsampling method depends on the nature of the underlying scene.  If the scene consists of values that should smoothly vary from one point to the next, then the nearest neighbor method is likely to be the least faithful way of resampling among those shown.\nDownsampling\n\nHere we see the result of downsampling a 16 by 16 image to 8 by 8 images (a 2 by 2 aggregation).  Nearest neighbor accurately retains the sharp boundary.  Lanczos differs from the others by enhancing the apparent sharpness.  A close look shows that it darkens the dark area on one side of the boundary and lightens the light area on the other side.  The graphs clarify this:\n\nThe bilinear, bicubic, and Gaussian resamplers show characteristics of convolution operators that have all positive weights (or very small negative weights): they average, or &quot;smear,&quot; neighboring values.  In downsampling this causes sharp features to be blurred.  The extent of the blur depends on the width of the kernel.  Like these others, the Lanczos resampler also blurs the jump, but it &quot;overshoots&quot; it on both sides.  That&#39;s the contrast enhancement seen just above in the images themselves.  Because of this tendency to increase contrast (the local differences between the highs and lows in the image), the Lanczos resampler is often called a &quot;sharpening filter.&quot;  These graphs show that this characterization requires a nuanced understanding, because evidently it does not actually reduce the averaging of values on both sides of the jump.  At pixel 4, its value of 0.56 is comparable to the values computed by the other convolution filters.\nHow does using it affect the output?\nLet&#39;s take a look at what happens in a more complex image.\n\nThe original, which is a 13 by 13 image now includes a pattern with the highest possible spatial frequency (alternating between light and dark with every column at the right).  We cannot hope to reproduce such features when downsampling: the smaller amount of pixels simply cannot hold all this information.  Let&#39;s focus, then, on what happens when such an image is upsampled.  If we care about faithful reproduction of the scene, we will want this high-frequency pattern to be reproduced accurately.\nThe smaller images are resampled to 25 by 25 pixels: almost, but not quite, a 2:1 refinement.  To my eye, the Lanczos and bilinear methods reproduce the stripes most sharply among the four convolution resamplers.  Nearest neighbor is, of course, the most faithful (because it cannot average values at all).\n\nThese graphs of the same results show that the Lanczos resampler was able to maintain the contrast in the stripes (as seen by the size of the vertical swings from lows to highs) at the expense of introducing a variation of intensity within the constant-value light area in the middle of the image (pixels 5, 6, 7 of the original).  This variation shows up as stripe-like artifacts within the light part of the image (the middle).  Of the resamplers shown here, it is alone in introducing such spurious detail.\nWhat is it useful for in a spatial application?\nEvidently, Lanczos resampling is not a panacea or omnibus solution to resampling.  It is superior to many other convolution resamplers in maintaining (or even enhancing) local contrast.  This can be useful when the resampled image is intended for viewing identification of detailed features or boundaries.  When the resampled image will subsequently be analyzed or processed, Lanczos resampling may increase the ability to detect edges and linear features.\nWhen the resampled image will be analyzed in other ways, though, the benefits of Lanczos resampling are doubtful.  It typically will (artificially) increase local measures of spatial variability, such as focal ranges and focal standard deviations.  It will not affect spatial means on the whole--like the other convolution resamplers, it is usually normalized (which means it&#39;s a local weighted average, with no bias introduced)--but it may increase some local averages and decrease others compared to the other resamplers.\nThe (necessarily brief) evaluation here suggests the Lanczos resampler generally should not be used for downsampling: for that application, it appears to offer nothing that simpler (and more commonly available) methods have, which retaining the potential disadvantage of extrapolating beyond the original range of data values.\nAfterword: a general comment\nThe investigation described here is an example of what anybody can do when they have a question about how a GIS operation works.  It uses the GIS itself as the subject of the investigation: to know what some operation or analytical method does, simply apply it under controlled experimental conditions.  In this case that amounts to constructing simple test images, resampling them according to available methods, and examining the results.\nThere are three critical aspects of this approach to learning about how GIS works:\n\nTheory.  The experimentation usually cannot be done &quot;blind&quot;: it helps to know some theory.  We don&#39;t usually need to know much, but we need the basics.  In this case, the theory of convolutions greatly reduced the number and types of images that we need to experiment with.  We didn&#39;t need to know anything about Fourier analysis, etc.  (Make no mistake, such knowledge is beneficial.  But lack of specialized knowledge of this sort shouldn&#39;t stop us.)\nPractice.  By using our GIS itself to perform the experiment, we are able to see what it actually does.  This avoids disconnects between theory (which tells us what the software should do) and practice (which is what it really does).\nQuantification.  Unless the question concerns visual perception, for evaluating the results we should not rely solely on looking at maps (or, in this case, images). To get the best information, we need to quantify the output (done here with graphs) and, often, describe and summarize it with statistical methods.\n\n",
            "excerpt": "(This can have implications for <span class=\"highlight\">GIS</span> work, because such an extrapolation of the original values can potentially cause the new values to be invalid. &hellip; By using our <span class=\"highlight\">GIS</span> itself to perform the experiment, we are able to see what it actually does. &hellip; ",
            "title": "What is Lanczos resampling useful for in a spatial context?"
        },
        {
            "tags": [
                "open-source-gis",
                "software-recommendations",
                "free-software"
            ],
            "question_score": 142,
            "is_accepted": false,
            "answer_id": 12133,
            "is_answered": false,
            "question_id": 12105,
            "item_type": "answer",
            "score": 83,
            "last_activity_date": 1310530447,
            "creation_date": 1310530447,
            "body": "QGIS. Although I do most of my analysis using ESRI based tools, QGIS is extremely fast for quickly examining a shapefile, and zooming/panning/reading the attributes. \n\nI don&#39;t mean this in a derogatory way, as QGIS is also a wonderful open-source desktop GIS; but for quick file opening/closing it&#39;s wonderful and the quickest I&#39;ve found.\n",
            "excerpt": "I don&#39;t mean this in a derogatory way, as QGIS is also a wonderful open-source desktop <span class=\"highlight\">GIS</span>; but for quick file opening/closing it&#39;s wonderful and the quickest I&#39;ve found. &hellip; ",
            "title": "What free programs should every GIS user have installed?"
        },
        {
            "tags": [
                "education"
            ],
            "question_score": 77,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 12,
            "is_answered": true,
            "question_id": 6535,
            "item_type": "question",
            "score": 77,
            "last_activity_date": 1502991420,
            "creation_date": 1298646312,
            "body": "For someone studying to pursue a career as a GIS Analyst, what math courses should he/she take?\n\nHere&#39;s a long list of free Math courses from MIT to serve as a frame of reference.\n\nWhich are essential, useful, useless?\n",
            "excerpt": "For someone studying to pursue a career as a <span class=\"highlight\">GIS</span> Analyst, what math courses should he/she take?\n\nHere&#39;s a long list of free Math courses from MIT to serve as a frame of reference. &hellip; ",
            "title": "How much math does a GIS Analyst need to know?"
        },
        {
            "tags": [
                "references"
            ],
            "question_score": 76,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 17,
            "is_answered": true,
            "question_id": 202,
            "item_type": "question",
            "score": 76,
            "last_activity_date": 1621041178,
            "creation_date": 1279891666,
            "body": "What books, journals, and/or electronic resources have you found most valuable for expanding your knowledge in the GIS field, and why?\n",
            "excerpt": "What books, journals, and/or electronic resources have you found most valuable for expanding your knowledge in the <span class=\"highlight\">GIS</span> field, and why? &hellip; ",
            "title": "What books, journals, and electronic resources are most valuable for expanding knowledge of GIS?"
        },
        {
            "tags": [
                "references"
            ],
            "question_score": 75,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 16,
            "is_answered": true,
            "question_id": 653,
            "item_type": "question",
            "score": 75,
            "last_activity_date": 1506591923,
            "creation_date": 1280788904,
            "body": "Well, since it was one of the highest rated proposed questions, hasn&#39;t been asked yet, and I would love to know the answer, I thought I&#39;d ask it.\n\nHow do I explain what GIS is for the 11 year old kid?\n",
            "excerpt": "How do I explain what <span class=\"highlight\">GIS</span> is for the 11 year old kid? &hellip; ",
            "title": "Explaining what GIS is to 11 year old kid?"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcpy",
                "modelbuilder"
            ],
            "question_score": 74,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 7,
            "is_answered": true,
            "question_id": 57381,
            "item_type": "question",
            "score": 74,
            "last_activity_date": 1592751768,
            "creation_date": 1365352796,
            "body": "I am new to Python scripting in ArcGIS but not new to ModelBuilder. \n\nI would like to know the benefits of Python vs ModelBuilder. \n\nWhen should we write Python script for GIS automation rather than use ModelBuilder? \n\nWhat are the automation capabilities of Python that we cannot find in ModelBuilder? \n",
            "excerpt": "When should we write Python script for <span class=\"highlight\">GIS</span> automation rather than use ModelBuilder? \n\nWhat are the automation capabilities of Python that we cannot find in ModelBuilder? &hellip; ",
            "title": "When to use ModelBuilder over Python scripting and vice versa?"
        },
        {
            "tags": [
                "arcpy",
                "references"
            ],
            "question_score": 37,
            "is_accepted": false,
            "answer_id": 53826,
            "is_answered": false,
            "question_id": 53816,
            "item_type": "answer",
            "score": 73,
            "last_activity_date": 1615502880,
            "creation_date": 1362692022,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\nLook at posts here and on other websites that use Python scripts and try to deconstruct them and see what techniques the authors are using to accomplish their task.  Our self-assembling FAQ on ArcPy is well worth reviewing for this purpose.\nYou will find it educational to try to solve other people&#39;s problems.  We have a self-assembling list of unanswered questions on ArcPy to help you find them.\nDo not forget that you can right-click any geoprocessing result and click &quot;Copy as Python Snippet&quot; if you just want to get the syntax of a function call, which is especially useful for things like field mappings and code blocks.  It is also possible to export ModelBuilder models to Python code, but there is no guarantee that the code exported from a working model will also work in Python, and for all but the simplest models the code that results is often difficult for beginners to debug.\nArcGIS Documentation:\nRead the help files!!  90% of ArcPy is just the same as using the GUI tools, only you are starting them using Python.  The help files all have example Python code at the bottom.\n\nWhat is ArcPy? is the front page to Help on using ArcPy with ArcMap from versions 10.3 - 10.8\n\n\n\nArcGIS Desktop Help (9.3)\nArcGIS Desktop Help (10)\nArcGIS Desktop Help (10.1)\nArcGIS Desktop Help (10.2)\nArcGIS Desktop Help (10.3)\nArcGIS Desktop Help (10.4)\nArcGIS Desktop Help (10.5)\nArcGIS Desktop Help (10.6)\nArcGIS Pro Help\nPython migration from 10.x to ArcGIS Pro\nArcGIS for Python API (not ArcPy)\n\nOnline Books:\n\nHow to Think Like a Computer Scientist\nDive into Python\nA Byte of Python (2.x)\nLearn Python the Hard Way\n\nOnline Courses:\n\nCodecademy Python Track offers free online coding lessons, including Python.  Use this to get the feel of how Python works before working on ArcPy.\nGoogle’s Python Class\nPenn State – GEOG 485 – GIS Programming and Automation\nArcPy for Python Developers using ArcGIS Pro\n\nTutorials:\n\nNon-Programmer’s Tutorial for Python 2.6\nOfficial Python Tutorial (2.5.4)\nOfficial Python Tutorial (2.6.5)\nOfficial Python Tutorial (2.7)\nDoug Hellmann&#39;s Python Module of the Week (PyMOTW) site\nCode Like a Pythonista: Idiomatic Python\nProgression path - using Python for GIS: from apprentice to guru\n\nPython Documentation:\n\nPython.org\nPython 2.5.4 Documentation (for ArcGIS 9.3)\nPython 2.6.5 Documentation (for ArcGIS 10)\nPython 2.7 Documentation (for ArcGIS 10.1-10.6)\nPython 3.6 Documentation (for ArcGIS Pro)\n\nPresentations:\n\nGetting Started with Python in ArcGIS 10 (from 2010)\nArcGIS Geoprocessing: Python Scripting – Advanced Techniques (from 2009)\nPython Scripting for Map Automation in ArcGIS 10 (from 2010)\n\nPaper Books:\n\nPython in a Nutshell, 2nd Ed\nLearning Python, 3rd Ed\nProgramming Python, 3rd Ed\nPython Cookbook, 2nd Ed\nA Python Primer for ArcGIS\nPython Scripting for ArcGIS\nGIS Tutorial for Python Scripting (coming June 2014)\n\nUser Communities:\n\nStack Overflow\nGIS Stack Exchange\nESRI Python Forum\nESRI Geoprocessing Forum\n\nBlogs:\n\nESRI Geoprocessing Blog\nESRI ArcGIS Desktop Blog\nArcGIS Team Python blog\n\nSample Code:\n\nArcScripts\nGeoprocessing Model and Script Tool Gallery\n\nTools/Integrated Development Environments (IDEs) - Non-commercial:\n\nPythonWin\nPyScripter\nPyDev (plug-in for the Eclipse software development environment)\nPython Tools for Visual Studio\nWinpdb (debugger)\n\nModules/Frameworks:\n\nDjango (web application framework)\ncomtypes (for using ArcObjects in Python)\nscipy/numpy\nPyPI - the Python Package Index\nSeeking Python tools/modules/add-ins for GIS?\n\nAlso see these general tips for new Python programmers in this answer to Exporting mxds into pdfs using ArcPy?.\n",
            "excerpt": "Google’s Python Class\nPenn State – GEOG 485 – <span class=\"highlight\">GIS</span> Programming and Automation\nArcPy for Python Developers using ArcGIS Pro\n\nTutorials:\n\nNon-Programmer’s Tutorial for Python 2.6\nOfficial Python Tutorial &hellip; in ArcGIS 10 (from 2010)\n\nPaper Books:\n\nPython in a Nutshell, 2nd Ed\nLearning Python, 3rd Ed\nProgramming Python, 3rd Ed\nPython Cookbook, 2nd Ed\nA Python Primer for ArcGIS\nPython Scripting for ArcGIS\n<span class=\"highlight\">GIS</span> &hellip; ",
            "title": "Learning ArcPy?"
        },
        {
            "tags": [
                "postgis",
                "coordinate-system",
                "srid",
                "geography-data-type",
                "geometry-data-type"
            ],
            "question_score": 73,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 131363,
            "item_type": "question",
            "score": 73,
            "last_activity_date": 1527143507,
            "creation_date": 1421944385,
            "body": "I&#39;m new to GIS, in PostGIS, and I&#39;m struggling with the SRID concept.\n\nHow do you choose a SRID for a database column? This is making me crazy. Why do I need to choose a SRID? What&#39;s its meaning?\n\nPicking a SRID is it the same for  and ? Setting a SRID for a  field seems senseless, because it should be just on a 2D plane.\n\nWhen I find lat/lon on the internet or geocoding services, which is the SRID?\n\nDoesn&#39;t a lat/lon coordinate make sense without a SRID?\n",
            "excerpt": "I&#39;m new to <span class=\"highlight\">GIS</span>, in PostGIS, and I&#39;m struggling with the SRID concept.\n\nHow do you choose a SRID for a database column? This is making me crazy. Why do I need to choose a SRID? What&#39;s its meaning? &hellip; ",
            "title": "Choosing SRID and what is its meaning?"
        },
        {
            "tags": [
                "cartography"
            ],
            "question_score": 72,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 11,
            "is_answered": true,
            "question_id": 3087,
            "item_type": "question",
            "score": 72,
            "last_activity_date": 1504783415,
            "creation_date": 1288498094,
            "body": "A poorly designed map can not only look visually unappealing, but can convey the wrong message, which could lead to bad decisions being made.\n\nI would like to ask people to post examples (that are in the public realm) of poorly designed maps, WITH justification on why it is bad design.   \n\nAlthough this &#39;question&#39; does not have a clear answer, I think it will prove a useful resource to see what merits bad design, so others can learn what NOT to do.  I will let the votes choose the &#39;right&#39; answer.\n\nI would also like to see examples of bad design around web-mapping.\n\nI would argue that although GIS Professionals generally know how to create a good looking map, I would say that they also have a tendency to over-complicate web-maps, by trying to re-create a GIS desktop application on the web:\n\nAlso slow to use, and hard to even get to the map.\n\nI think now that normal people are more used to Google Maps style/simplicity, web-maps should follow a similar approach.\n\nWith the explosion of &#39;NeoGeography&#39; particularly in the web realm, we now have a lot of non-GIS professionals creating maps for the web.  A lot of these developers are often very good at user-interface design, but not trained in cartographic principles.\n\nI think, with web maps, its all about combining the skills of both cartography and user interface design.\n",
            "excerpt": "I would argue that although <span class=\"highlight\">GIS</span> Professionals generally know how to create a good looking map, I would say that they also have a tendency to over-complicate web-maps, by trying to re-create a <span class=\"highlight\">GIS</span> desktop &hellip; With the explosion of &#39;NeoGeography&#39; particularly in the web realm, we now have a lot of non-<span class=\"highlight\">GIS</span> professionals creating maps for the web. &hellip; ",
            "title": "What Makes a Map be classed as Badly Designed?"
        },
        {
            "tags": [
                "shapefile",
                "vector"
            ],
            "question_score": 70,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 7,
            "is_answered": true,
            "question_id": 20613,
            "item_type": "question",
            "score": 70,
            "last_activity_date": 1490943498,
            "creation_date": 1329768155,
            "body": "Recently I&#39;ve been spending a lot of time converting perfectly good field names like &quot;Percent of citizens age 25 and over with a bachelor&#39;s degree or higher&quot; into things like &quot;edbchogtr&quot; to meet the DBF&#39;s 10 character field name limit.\n\nIn another thread (“Oddities” in the Shapefile technical specification), geospatialpython commented that &quot;Despite the shapefile format&#39;s flaws, oddities, and limitations it persists stubbornly in and around the field of GIS. Every other attempt to replace it has been too bloated for simple vector storage or too proprietary.&quot;\n\nThis activity coupled with Mr. Lawhead&#39;s comment has me wondering: \n\n\nhave any explicit attempts ever been made to replace the shapefile as GIS&#39;s ubiquitous data storage and interchange format? \nAre there any contenders? \nIf there have been competing formats, why have they failed? \nHas Esri refused to support them, or is the story simply one of technological inertia? \nIf there haven&#39;t been attempts... why not?  \n\n\nIt seems like we could do a little better for ourselves, both as GIS developers and users.\n",
            "excerpt": "Oddities” in the Shapefile technical specification), geospatialpython commented that &quot;Despite the shapefile format&#39;s flaws, oddities, and limitations it persists stubbornly in and around the field of <span class=\"highlight\">GIS</span> &hellip; It seems like we could do a little better for ourselves, both as <span class=\"highlight\">GIS</span> developers and users. &hellip; ",
            "title": "Are there any attempts to replace the shapefile?"
        },
        {
            "tags": [
                "gdal",
                "geotiff-tiff",
                "compression"
            ],
            "question_score": 69,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 8,
            "is_answered": true,
            "question_id": 1104,
            "item_type": "question",
            "score": 69,
            "last_activity_date": 1624544799,
            "creation_date": 1281601263,
            "body": "I have a folder of GIS data that consists mainly of GeoTIFF files.  The whole set weighs in at about . I noticed that if I pack the contents into a tarball, it smashes down to about .  I would like to check the set into a revision control system sot it can be worked on by other people and it looks like there is some space that can be squeezed out.\n\nThe GDAL GeoTIFF driver page lists plenty of options that may be used to create compressed GeoTIFF files.  There are also plenty of options that affect the way each algorithm works.\n\nThe help page does a good job at describing the options but doesn&#39;t elaborate on how to select an algorithm or the tradeoffs that are associated with the varying level of compression.  This leads to the following questions:\n\n\nThe pros of using compression are a dramatic savings in space.  What are the cons?  Is information lost when the image is compressed?\nHow should one go about choosing an algorithm and compression level.  Do some types of images lend themselves to a certain algorithm?\n\n",
            "excerpt": "I have a folder of <span class=\"highlight\">GIS</span> data that consists mainly of GeoTIFF files.  The whole set weighs in at about 1.2 GB. I noticed that if I pack the contents into a tarball, it smashes down to about 82 MB. &hellip; ",
            "title": "Should GDAL be set to produce GeoTIFF files with compression? Which algorithm should be used?"
        },
        {
            "tags": [
                "postgis",
                "coordinate-system",
                "srid",
                "geography-data-type",
                "geometry-data-type"
            ],
            "question_score": 73,
            "is_accepted": false,
            "answer_id": 131372,
            "is_answered": false,
            "question_id": 131363,
            "item_type": "answer",
            "score": 68,
            "last_activity_date": 1463718643,
            "creation_date": 1421947433,
            "body": "An SRID is a coordinate system. We&#39;re taught in (traditional / Arc) &quot;GIS&quot; to always store your data in a projected coordinate system, because we&#39;re going to eventually use some calculation like &#39;area&#39;, so we&#39;d better store our data in a coordinate system that gives us that measurement.\n\nHowever, PostGIS throws that concept out the window.\n\nHere&#39;s a good Q&amp;A started by @tmcw: Why are Data Projections relevant?\n\nBasically, PostGIS opens up the ability to store your data in a single coordinate system such as WGS84 (SRID 4326), and when you need something like Area, Distance, or Length, you use a function to create that column from your data in a projected coordinate system that will give you a local interpretation of your data in units that you want. \n\nSo for example, I could store students and schools in PostGIS both in WGS84/SRID:4326.  When I want to calculate the distance between students and the schools they attend, I call a distance function on my geometry column, but also wrap a ST_Transform function around the geometry column first to &#39;project&#39; the data into State Plane CO Central (SRID: 2877). This gives me a column for the distance of each student to their closest school in feet because SRID:2877 is a projected coordinate system that stores data in Feet.\n\nSo my recommendation for you would be to store your data in a Geometry (data type) column in SRID 4326 (as oppose to a geography data type which does not support projections / transformations).\n",
            "excerpt": "We&#39;re taught in (traditional / Arc) &quot;<span class=\"highlight\">GIS</span>&quot; to always store your data in a projected coordinate system, because we&#39;re going to eventually use some calculation like &#39;area&#39;, so we&#39;d better store our data in &hellip; ",
            "title": "Choosing SRID and what is its meaning?"
        },
        {
            "tags": [
                "python",
                "shapefile",
                "shapely"
            ],
            "question_score": 39,
            "is_accepted": true,
            "answer_id": 52708,
            "is_answered": false,
            "question_id": 52705,
            "item_type": "answer",
            "score": 65,
            "last_activity_date": 1662970476,
            "creation_date": 1361601341,
            "body": "Well-known binary is a good binary exchange format that can be exchanged with plenty of GIS software, including Shapely and  GDAL/OGR.\nThis is a tiny example of the workflow with :\n\n\nAlthough the poster has accepted the GDAL/OGR answer, here is a Fiona equivalent:\n\n",
            "excerpt": "Well-known binary is a good binary exchange format that can be exchanged with plenty of <span class=\"highlight\">GIS</span> software, including Shapely and  GDAL/OGR. &hellip; ",
            "title": "Writing Shapely geometries to shapefiles"
        },
        {
            "tags": [
                "python",
                "shapefile",
                "visualisation",
                "matplotlib"
            ],
            "question_score": 38,
            "is_accepted": true,
            "answer_id": 61868,
            "is_answered": false,
            "question_id": 61862,
            "item_type": "answer",
            "score": 65,
            "last_activity_date": 1369560206,
            "creation_date": 1369499385,
            "body": "I do not know ArcPy, but I work with shapefiles and raster in Python for years\n\n\nFor processing shapefiles in Python, there are many modules like osgeo/ogr, Fiona, Pysal or Pyshp (shpUtils is one of them and\nnot the most used), and others, see Pypi: GIS and examples on gis.stackexchange and many examples on the Web (not only in English). Most of them are much older than ArcPy (or arcgisscripting)...\nfor processing raster you can use osgeo/gdal, the standard\nFor processing geospatial geometries, there is shapely\nFor plotting the geometries you can use matplotlib and possibly descartes, &quot;extension&quot; of matplotlib for areas, but also many, many other modules, see  Pypi: Plotting and modules like mayavi for 3D representation (matplotlib also)\nThere are also modules like  mapnik which give you directly the possibilities of 1) read a shapefile and 4) plotting with the module Pycairo.\n\n\nAfter that, it&#39;s like a GIS:\n\n\nyou use the modules 1) to open, save the shapefiles and carry out the treatments with other modules like numpy or scipy, if you want.\nyou can use shapely for manipulation and analysis of the geometric objects (buffer, etc.).\nyou can use matplotlib to plot the geometries, but matplotlib do not know what you want to plot. It is your work with modules 1) or 3) to specify what to plot (attributes, etc,.) and how.\n\n\n\n  If I want to visualise one certain column of my shapefile, how can I implement this in the code?\n\n\nSo, you must learn matplotib and the other modules. You have to learn ArcPy, it&#39;s the same...(there are lots of excellent tutorials on the web, especially for matplolib, and it&#39;s easier that ArcPy because it is pure Python).\n\nSome examples with Python only\n\n\n\nGeological map (polygon shapefile) with colors based on an attribute\n\n\n\n3D Points (PointZ shapefile) with color based on an attribute \n\n\n\n3D points (Point shapefile with z as attribute) and 3D line (PolyLineZ shapefile) on a DEM, and on a raster draped onto the DEM surface.\n\n\n\nTopographic profile  with z values and colors based on attributes (geological formations = Cross section) of the original shapefile (Polyline shapefile)\n\n\n\nDEM (GeoTIFF) with the module Mayavi2\n\n\n\nDEM (ESRI ascii grid, .asc) and Point shapefiles (with z as attribute) with the module visvis\n\n\n\nBoreholes (3D buffer of a polylineZ with colors based on an attribute (geological formations), with a grid surface calculated with the modules numpy and matplotlib from a points shapefile (with z as an attribute), visualized with the module visvis\n",
            "excerpt": "and raster in Python for years\n\n\nFor processing shapefiles in Python, there are many modules like osgeo/ogr, Fiona, Pysal or Pyshp (shpUtils is one of them and\nnot the most used), and others, see Pypi: <span class=\"highlight\">GIS</span> &hellip; After that, it&#39;s like a <span class=\"highlight\">GIS</span>:\n\n\nyou use the modules 1) to open, save the shapefiles and carry out the treatments with other modules like numpy or scipy, if you want.\nyou can use shapely for manipulation &hellip; ",
            "title": "Simple thematic mapping of shapefile using Python?"
        },
        {
            "tags": [
                "coordinate-system",
                "datum",
                "gis-principle"
            ],
            "question_score": 64,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 7,
            "is_answered": true,
            "question_id": 2769,
            "item_type": "question",
            "score": 64,
            "last_activity_date": 1665647313,
            "creation_date": 1287608990,
            "body": "What strategies, criteria, or rules do you use for selecting coordinate systems for \n\n\n(a) storing, \n(b) analyzing, and \n(c) displaying GIS data?  \n\n\n(I humbly offer my reply to a related question about watershed analysis as an example of the considerations involved in (b).)\n\nWhat are the pitfalls to watch out for?\n\nLinks to Web sites you find particularly helpful in this regard are welcome.\n",
            "excerpt": "What strategies, criteria, or rules do you use for selecting coordinate systems for \n\n\n(a) storing, \n(b) analyzing, and \n(c) displaying <span class=\"highlight\">GIS</span> data? &hellip; ",
            "title": "What strategies, criteria, or rules to use for selecting coordinate systems?"
        },
        {
            "tags": [
                "software-recommendations",
                "android",
                "mobile-gis"
            ],
            "question_score": 64,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 12452,
            "item_type": "question",
            "score": 64,
            "last_activity_date": 1629445287,
            "creation_date": 1311206528,
            "body": "I know that ArcGIS is available for Android, but does anyone know of any other GIS apps that are available for Android tablets?\n",
            "excerpt": "I know that ArcGIS is available for Android, but does anyone know of any other <span class=\"highlight\">GIS</span> apps that are available for Android tablets? &hellip; ",
            "title": "Seeking Mobile GIS applications for Android Tablets?"
        },
        {
            "tags": [
                "qgis",
                "qgis-3",
                "references"
            ],
            "question_score": 53,
            "is_accepted": false,
            "answer_id": 3659,
            "is_answered": false,
            "question_id": 3651,
            "item_type": "answer",
            "score": 61,
            "last_activity_date": 1543917013,
            "creation_date": 1290153797,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\nFor QGIS 3.x users:\n\n\nQGIS User Manual - includes both 2.x and 3.x documentation and links to many of the resources listed here\nGIS SE&#39;s self-assembling FAQ on QGIS 3.0\nQGIS Planet blog for more technical and development stuff.\n\n\nFor QGIS 3.x developers:\n\n\nGIS SE&#39;s self-assembling FAQ on PyQGIS in QGIS 3.0\n\n\n\n\nFor QGIS 2.x users:\n\n\nQGIS Training Manual ... covers a wide range of topics\nQGIS User Manual\nQGIS Tutorials and Tips\nLearning QGIS ... if you already know GIS concepts and you are looking for a resource to quickly get started using QGIS\nQGIS Map Design ... for tutorials on making maps\nA Gentle Introduction to GIS Brought to you with Quantum GIS, a Free and Open Source Software GIS Application for everyone; by T. Sutton, O. Dassau, M. Sutton - 115 page manual for beginners with video lectures [here][49]\nDesktop GIS: Mapping the Planet with Open Source Tools by Gary E. Sherman\nQGIS Workshop from Harvard University\nTutorial: QGIS basics for Journalists from UC Berkeley\nIntroducing GIS worksheets\n\n\nFor QGIS 2.x developers:\n\n\nGeneral API documentation\nPyQGIS Cookbook ... on developing python plugins\nMy own notes on developing Python plugins\n\n",
            "excerpt": "QGIS ... if you already know <span class=\"highlight\">GIS</span> concepts and you are looking for a resource to quickly get started using QGIS\nQGIS Map Design ... for tutorials on making maps\nA Gentle Introduction to <span class=\"highlight\">GIS</span> Brought to &hellip; you with Quantum <span class=\"highlight\">GIS</span>, a Free and Open Source Software <span class=\"highlight\">GIS</span> Application for everyone; by T. &hellip; ",
            "title": "Seeking QGIS user interface tutorials and web resources"
        },
        {
            "tags": [
                "software-recommendations",
                "open-source-gis",
                "desktop-gis"
            ],
            "question_score": 58,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 11,
            "is_answered": true,
            "question_id": 24,
            "item_type": "question",
            "score": 58,
            "last_activity_date": 1522809003,
            "creation_date": 1279826844,
            "body": "Can someone give me a list of free and open source GIS desktop packages?\n",
            "excerpt": "Can someone give me a list of free and open source <span class=\"highlight\">GIS</span> desktop packages? &hellip; ",
            "title": "Seeking Free and Open Source GIS Desktop packages?"
        },
        {
            "tags": [
                "qgis",
                "fields-attributes",
                "spatial-join",
                "documentation",
                "spatial-predicates"
            ],
            "question_score": 32,
            "is_accepted": false,
            "answer_id": 305193,
            "is_answered": false,
            "question_id": 217444,
            "item_type": "answer",
            "score": 56,
            "last_activity_date": 1669130406,
            "creation_date": 1544096173,
            "body": " concatenates the following set of methods to compare geometries:\n\nintersects if the intersection of both geometries is not empty\n\n\ncontains if the second geometry is completely contained into the first one\n\n\ndisjoint if the intersection of both geometries is the empty set\n\n\nequals if they are spatially identical\n\n\ntouches if the only points in common between both geometries lie in the union of their boundaries\n\n\noverlaps if the intersection of both geometries results in a value of the same dimension of both geometries and is different from both the first and the second geometry\n\n\nwithin if the first geometry is completely contained into the second one\n\n\ncrosses if the intersection of both geometries results in a value whose dimension is less than the maximum dimension of both geometries and the intersection value includes points interior to both geometries, and the intersection value is not equal to either the first or the second geometry\n\n\n\n\nReferences:\n\nA quick tutorial to SpatiaLite | 4.2 Evaluating relationships between geometries\nboundlessgeo/workshops/postgis/source/en/spatial_relationships\nGIS Geography | How Spatial Join Works in GIS\n\n",
            "excerpt": "either the first or the second geometry\n\n\n\n\nReferences:\n\nA quick tutorial to SpatiaLite | 4.2 Evaluating relationships between geometries\nboundlessgeo/workshops/postgis/source/en/spatial_relationships\n<span class=\"highlight\">GIS</span> &hellip; Geography | How Spatial Join Works in <span class=\"highlight\">GIS</span> &hellip; ",
            "title": "Understanding &quot;Join Attributes by Location&quot; in QGIS"
        },
        {
            "tags": [
                "python",
                "geoprocessing"
            ],
            "question_score": 34,
            "is_accepted": false,
            "answer_id": 64158,
            "is_answered": false,
            "question_id": 64146,
            "item_type": "answer",
            "score": 56,
            "last_activity_date": 1608717805,
            "creation_date": 1371836455,
            "body": "That&#39;s strange, as if people suddenly discovered the power of Python (without ArcPy which is just one Python module among others), see for example the question Visualize shapefile in Python:\n\ngeospatial processing in Python  has a very long history, much older than Arcpy (or arcgisscripting) -&gt; no &quot;mimic&quot; the capabilities of ArcPy here, as Paul says, most were already there  before ArcPy.\nthe reference for the Python modules is the Python Package Index (Pypi) and there is a dedicated section: Topic :: Scientific/Engineering :: GIS\nyou can do anything with these modules and it is often easier and faster than ArcPy because it is pure Python (no cursors...).\nShapely is one of these modules for processing geospatial geometries -&gt;  calculate areas of a polygon and convert polygons to points..\nif you want to process vector layers, there is osgeo/ogr, Fiona or Pyshp (and others, less used) -&gt;  query a shapefile by attributes, create new layer from selection, calculate areas of a polygon, convert polygons to points\nfor processing rasters, the standard is osgeo/gdal\nfor spatial analysis, there is Pysal\nfor 3D, you can use other Scientific modules like numpy or scipy (3D algorithms, grids, but also statistics, geostatistics, 2D or 3D)\nAnd I don&#39;t talk about mapnik, matplotlib/basemap,Geodjango and ...\n\nYou can combine all (Pysal with shapely, ...) and mix them with the other Scientific modules.\nThus for Python Script examples, search for Pyshp Fiona, ogr, gdal or shapely in gis.stackexchange or the internet (many examples, not only in English).)\nOne of them in French (the scripts and the figures are universal !):\n\nPython: Using vector and raster layers in a geological perspective, without GIS software\nan other in English:\nGIS with Python, Shapely, and Fiona\nand in Spanish\nDetermination of areas of irregular polygons using the coordinates of the vertices \nin gis.stackexchange\nElevation profile 10 km each side of a line\nUpdating Attributes using Pyshp\nHow to create a 3D shapefile from a raster?\nPython Script for getting elevation difference between two points\netc\n\nThe script presented by Aaron can be written more simply with Fiona that uses only Python dictionaries:\n\nand if you use shapely in addition:\n\nThere are also two books:\nPython Geospatial Development of Eric Westra.\n\nLearning Geospatial Analysis with Python of Joel Lawhead\n\n(source: cloudfront.net)\nPython is also used as a scripting language in other GIS applications like QGIS (Quantum GIS), GRASS GIS, gvSIG or OpenJump or 3D modelers like Paraview (and Blender also !). And you can use the majority of the geospatial modules in all these application (see Visualising QGIS data with Blender)\n",
            "excerpt": ":\n\nPython: Using vector and raster layers in a geological perspective, without <span class=\"highlight\">GIS</span> software\nan other in English:\n<span class=\"highlight\">GIS</span> with Python, Shapely, and Fiona\nand in Spanish\nDetermination of areas of irregular polygons &hellip; Learning Geospatial Analysis with Python of Joel Lawhead\n\n(source: cloudfront.net)\nPython is also used as a scripting language in other <span class=\"highlight\">GIS</span> applications like QGIS (Quantum <span class=\"highlight\">GIS</span>), GRASS <span class=\"highlight\">GIS</span>, gvSIG or OpenJump &hellip; ",
            "title": "Python Script examples for geoprocessing shapefiles without using arcpy"
        },
        {
            "tags": [
                "data",
                "global"
            ],
            "question_score": 52,
            "is_accepted": true,
            "answer_id": 504,
            "is_answered": false,
            "question_id": 495,
            "item_type": "answer",
            "score": 56,
            "last_activity_date": 1593963719,
            "creation_date": 1280454575,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\nGlobal\n\nFor non-commercial use, try GADM.\nFor small scale global dataset try Natural Earth: Natural Earth is a public domain map dataset available at 1:10m, 1:50m, and 1:110 million scales\nDIVA-GIS is free data. Just click on &#39;Global level&#39; and a zip file will download of all country boundaries.  Under &#39;Country level&#39; you&#39;ll find administrative areas and a few other things that may interest you but you have to pick the country you want so it could take a little time if you want every country\nOpenStreetMap has a lot of data. It isn&#39;t necessarily authoritative, but if you are just trying to get data it may be suitable.\nhttp://wiki.openstreetmap.org/wiki/Potential_Datasources: This wiki has the most comprehensive (reviewed by data quality) list of freely available data sources\nhttp://wiki.openstreetmap.org/wiki/Shapefiles\nhttp://osmdata.thinkgeo.com/openstreetmap-data/\nThe UN has a dataset for many (but not all) countries, known as the Second Administrative Level Boundaries data set project (SALB).   The dataset is standardized in terms of the international border, metadata profile, spelling, coding scheme, editing protocols used and can be downloaded at no cost. However, as it is licensed under the creative commons by-nc-nd license it cannot be used for commercial purposes.\nyou can find world boundaries shapefile on http://thematicmapping.org/downloads/world_borders.php\n\nAustralia\nThe Bureau of Statistics provides most of the information:\n\nCountry boundaries should be produced by merging all the state boundaries (below) into a single polygon feature.\nState level boundaries are available.\nThe states can be geographically disaggregated in a number of ways - perhaps the most similar to county boundaries are Local Government Areas (LGAs).\nTo find the area of cities, the standard dataset to use is the urban centres and localities digital boundaries.\nZipcodes (or postcodes as they are known here) are more difficult to model.  Because they are based on the rules by which Australia Post deliver the post, they are rather fuzzily defined.  The free option approximates postcodes as the census collection district level, and is available for 2006 from the ABS.\nthe updated 2011 datasets and census results are available via the Data Packs section of the ABS site, which requires free registration.\n\nNew Zealand\n\nKoordinates - This site has free and pay data for New Zealand and various international areas (like Florida!). A range of free layers, boundaries, urban areas, land use, digital elevation, coastline, rivers etc... and topo maps, contours, aerials for some areas - pay for these. Excellent interface and system for ordering downloads.\n\nhttp://www.stats.govt.nz/browse_for_stats/people_and_communities/Geographic-areas/digital-boundary-files.aspx is the Statistics Department&#39;s set of administrative boundaries. They&#39;ve got regions and territorial authorities (the rough equivalent of counties), urban areas (roughly city boundaries) and much more, including meshblocks, which most statistical data is tied to.\n\n\nCanada\n\nAdministrative Boundaries are available at GeoBase.  Note that these boundaries are actually Administrative Boundaries and not coastlines (particularly relevant for the north coast).\nThe Political Boundaries layer in the GeoGratis North American Atlas has nice physical boundaries for North America and surroundings, as well as U.S. States and Canadian Provinces.\n\nGreat Britain\nFor a wide range of free data for Great Britain, visit the Ordnance Survey website:\nhttps://www.ordnancesurvey.co.uk/opendatadownload/products.html\nThere&#39;s a product description page too (but I can&#39;t provide another hyperlink sigh)\nThe Boundary-Line dataset has a number of administrative boundary layers (though why they couldn&#39;t provide a simple, continuous, GB county boundary dataset in it is beyond me). However, there&#39;s a lot of good stuff on this site, including a GB post code gazetteer.\nEuropean Union\nEurostat provides several geo-datasets for EU and a few more countries for free for non-commercial use: Countries, NUTS, Communes, LAUs (municipalities) and coastlines: https://ec.europa.eu/eurostat/web/gisco/geodata/reference-data/administrative-units-statistical-units\n",
            "excerpt": "For small scale global dataset try Natural Earth: Natural Earth is a public domain map dataset available at 1:10m, 1:50m, and 1:110 million scales\nDIVA-<span class=\"highlight\">GIS</span> is free data. &hellip; ",
            "title": "Seeking administrative boundaries for various countries?"
        },
        {
            "tags": [
                "web-mapping",
                "software-recommendations"
            ],
            "question_score": 47,
            "is_accepted": true,
            "answer_id": 55264,
            "is_answered": false,
            "question_id": 55119,
            "item_type": "answer",
            "score": 56,
            "last_activity_date": 1618917501,
            "creation_date": 1363992585,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\nThere are quite a few alternatives and I&#39;ve actually written a short book on the subject entitled &quot;Online GIS - Meet the Cloud Publication Platforms that Will Revolutionize our Industry&quot; but that&#39;s a little outdated now.\nHere&#39;s an updated summary:\nMangoMap: Very easy to use, no coding required. Lots of tools and functionality available to make really polished map applications. Much more competitive pricing than ArcGIS Online organisational accounts.\nGISCloud: Online alternative to traditional client/server GIS setup. Many features but hampered by a frustrating user interface.\nMapBox: Making maps sexy again. Programmer focused. Great for maps that need to fit a brand and be able to scale for high traffic. Good fit for consumer internet sites.\nCartoDB: Attractive UX and scales very well. Also lets you preserve the Google Maps experience for end users. Postgres + postgis database on the cloud with a set of API&#39;s on top of it to fetch/save and render data.\nDisclosure: Original answer posted by Founder of MangoMaps and includes  an edit by the CTO of CartoDB - these two products are described in this answer.\n\nI&#39;ve had good luck using GeoCommons for more lightweight mapping.\nThe upside is that the service is free within a certain limit, and includes some fairly powerful analysis tools. I believe any mapping is free if using or creating open data, and while my organization did not end up paying for the service, the prices seemed reasonable.\nI didn&#39;t realize until I visited today, though, that this service is now a part of esri, so their terms may have changed.\n",
            "excerpt": "There are quite a few alternatives and I&#39;ve actually written a short book on the subject entitled &quot;Online <span class=\"highlight\">GIS</span> - Meet the Cloud Publication Platforms that Will Revolutionize our Industry&quot; but that&#39;s a little &hellip; GISCloud: Online alternative to traditional client/server <span class=\"highlight\">GIS</span> setup. Many features but hampered by a frustrating user interface.\nMapBox: Making maps sexy again. Programmer focused. &hellip; ",
            "title": "Alternatives to ArcGIS Online?"
        },
        {
            "tags": [
                "distance",
                "android",
                "coordinates",
                "geolocation"
            ],
            "question_score": 43,
            "is_accepted": true,
            "answer_id": 25883,
            "is_answered": false,
            "question_id": 25877,
            "item_type": "answer",
            "score": 55,
            "last_activity_date": 1337618361,
            "creation_date": 1337618361,
            "body": "This is tricky for two reasons: first, limiting the points to a circle instead of a square; second, accounting for distortions in the distance calculations.\n\nMany GISes include capabilities that automatically and transparently handle both complications.  However, the tags here suggest that a GIS-independent description of an algorithm may be desirable.\n\n\nTo generate points uniformly, randomly, and independently within a circle of radius r around a location (x0, y0), start by generating two independent uniform random values u and v in the interval [0, 1).  (This is what almost every random number generator provides you.)  Compute\n\n\n\nThe desired random point is at location (x+x0, y+y0).\nWhen using geographic (lat,lon) coordinates, then x0 (longitude) and y0 (latitude) will be in degrees but r will most likely be in meters (or feet or miles or some other linear measurement).  First, convert the radius r into degrees as if you were located near the equator.  Here, there are about 111,300 meters in a degree.\n\nSecond, after generating x and y as in step (1), adjust the x-coordinate for the shrinking of the east-west distances:\n\n\n\nThe desired random point is at location (x&#39;+x0, y+y0).  This is an approximate procedure.  For small radii (less than a few hundred kilometers) that do not extend over either pole of the earth, it will usually be so accurate you cannot detect any error even when generating tens of thousands of random points around each center (x0,y0).\n\n",
            "excerpt": "However, the tags here suggest that a <span class=\"highlight\">GIS</span>-independent description of an algorithm may be desirable. &hellip; ",
            "title": "Generating random locations nearby?"
        },
        {
            "tags": [
                "data"
            ],
            "question_score": 55,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 14,
            "is_answered": true,
            "question_id": 7758,
            "item_type": "question",
            "score": 55,
            "last_activity_date": 1454910996,
            "creation_date": 1301092195,
            "body": "I was idly speculating on the many sorts of things people are keeping track of these days with GIS - natural/human catastrophes, demographic and economic patterns, climate change, etc. In that vein, I started to look around for GIS&#39; applications in war and international conflicts.  There are many obvious uses for it in the military, but is there any database or publicly accessible application that organizes war-related information in a spatial and/or cartographic context? Time would undoubtedly play an integral role in any robust methodology. The most I was able to find was an in-progress database for tracking war crimes. What else is out there for public consumption, if anything?\n",
            "excerpt": "I was idly speculating on the many sorts of things people are keeping track of these days with <span class=\"highlight\">GIS</span> - natural/human catastrophes, demographic and economic patterns, climate change, etc. &hellip; In that vein, I started to look around for <span class=\"highlight\">GIS</span>&#39; applications in war and international conflicts. &hellip; ",
            "title": "The GIS of War - Tracking Conflicts and Their Effects"
        },
        {
            "tags": [
                "postgis",
                "distance",
                "nearest-neighbor"
            ],
            "question_score": 35,
            "is_accepted": true,
            "answer_id": 136416,
            "is_answered": false,
            "question_id": 136403,
            "item_type": "answer",
            "score": 55,
            "last_activity_date": 1643846024,
            "creation_date": 1424700118,
            "body": "You are nearly there. There is a little trick which is to use PostgreSQL&#39;s distinct operator, which will return the first match of each combination -- as you are ordering by ST_Distance, effectively it will return the closest point from each senal to each port.\n\nIf you know that the minimum distance in each case is no more than some amount x, (and you have a spatial index on your tables), you can speed this up by putting a , eg, if all the minumum distances are known to be no more than 10km, then:\n\nObviously, this needs to be used with caution, as if the minimum distance is greater, you will simply get no row for that combination of senal and port.\nThe order by order must match the distinct on order, which makes sense, as distinct is taking the first distinct group based on some ordering.\nIt is assumed that you have a spatial index on both tables.\nThere is another option, which is to use PostgreSQL&#39;s &lt;-&gt; and &lt;#&gt; operators, (center point and bounding box distance calculations, respectively) which make more efficient use of the spatial index and don&#39;t require the ST_DWithin hack to avoid n^2 comparisons. There is a good blog article explaining how they work. The general thing to note is that these two operators work in the ORDER BY clause.\n\n\nAs this question has received a lot of attention and k-nearest neighbours (kNN) is generally a hard problem (in terms of algorithmic run-time) in GIS, it seems worthwhile to expand somewhat on the original scope of this question.\nThe standard way for find the x nearest neighbours of one object is to use a LATERAL JOIN (conceptually similar to a for each loop). Borrowing shamelessly from @dbaston&#39;s answer, you would do something like:\n\nSo, if you want to find the nearest 10 ports, ordered by distance, you simply have to change the LIMIT clause in the lateral sub-query. This is much harder to do without LATERAL JOINS and involves using ARRAY type logic.\nWhile this approach works well, it can be sped up enormously if you know you only have to search out to a given distance. In this instance, you can use ST_DWithin(signs.geom, ports.geom, 1000) in the subquery, which because of the way indexing works with the &lt;-&gt; operator -- one of the geometries should be a constant, rather than a column reference -- may be much faster. So, for example, to get the 3 nearest ports, within 10km, you could write something like the following.\n\nAs always, usage will vary depending on your data distribution and queries, so EXPLAIN is your best friend.\nFinally, there is a minor gotcha, if using LEFT instead of CROSS JOIN LATERAL in that you have to add ON TRUE after the lateral queries alias, eg,\n\n",
            "excerpt": "#&gt; port.geom LIMIT 1)\nFROM  traffic_signs as senal;\n\n\nAs this question has received a lot of attention and k-nearest neighbours (kNN) is generally a hard problem (in terms of algorithmic run-time) in <span class=\"highlight\">GIS</span> &hellip; ",
            "title": "PostGIS nearest points with ST_Distance, kNN"
        },
        {
            "tags": [
                "open-source-gis",
                "software-recommendations",
                "free-software"
            ],
            "question_score": 142,
            "is_accepted": false,
            "answer_id": 23236,
            "is_answered": false,
            "question_id": 12105,
            "item_type": "answer",
            "score": 54,
            "last_activity_date": 1334145388,
            "creation_date": 1334145388,
            "body": "Benjamin already mentioned SAGA GIS, but just the name so I would like to add more info about this excellent SW:\n\nSAGA (System for Automated Geoscientific Analyses)\n\n\n\nSAGA is also free and opensource like QGIS, but it is focused on raster data analysis and processing.\n\nThe standard modules are:\n\n\nFile access: interfaces to various table, vector, image and grid file formats, including shapefiles, Esri grids (ASCII and binary), and numerous grid file formats that are supported by the GDAL library, in addition to the native SGRD format of SAGA GIS.\nFilter for grids: Gaussian, Laplacian, multi-directional Lee filter.\nGridding: interpolation from vector data using triangulation, nearest neighbour, inverse distance. (my favourite is Multilevel B-Spline interpolation)\nGeostatistics: residual analysis, ordinary and universal kriging, single and multiple regression analysis, variance analysis.\nGrid calculator: combine grids through user defined functions.\nGrid discretisation: skeletonisation, segmentation.\nGrid tools: merging, resampling, gap filling.\nImage classification: cluster analysis, box classification, maximum likelihood, pattern recognition, region growing.\nProjections: various coordinate transformations for vector and grid data (using Proj4 and GeoTrans libraries), georeferencing of grids.\nSimulation of dynamic processes: TOPMODEL, nitrogen distributions, erosion, landscape development.\nTerrain analysis: geomorphometrical calculations such as slope, aspect, curvatures, curvature classification, analytical hillshading, sink eliminition, flow path analysis, catchment delineation, solar radiation, channel lines, relative altitudes.\nVector tools: polygon intersection, contour lines from grid.\n\n\nAccording to the users it can partially replace commercial tools like Spatial analyst in ArcGIS and some people say, that the hydrological tools are even better than ArcHydroTools.\n\nIn my opinion it is good choice for people who are not familiar with GRASS and who need user friendly and free solution which can share data with other GIS tools.\n\nI use it together with QGIS and it works really nice - SAGA for raster data, QGIS for vectors and final map finishing and for quick mapping.\n",
            "excerpt": "Benjamin already mentioned SAGA <span class=\"highlight\">GIS</span>, but just the name so I would like to add more info about this excellent SW:\n\nSAGA (System for Automated Geoscientific Analyses)\n\n\n\nSAGA is also free and opensource &hellip; In my opinion it is good choice for people who are not familiar with GRASS and who need user friendly and free solution which can share data with other <span class=\"highlight\">GIS</span> tools. &hellip; ",
            "title": "What free programs should every GIS user have installed?"
        },
        {
            "tags": [
                "postgis",
                "geometry-data-type",
                "geography-data-type"
            ],
            "question_score": 108,
            "is_accepted": false,
            "answer_id": 33577,
            "is_answered": false,
            "question_id": 6681,
            "item_type": "answer",
            "score": 54,
            "last_activity_date": 1612817675,
            "creation_date": 1347808957,
            "body": "I use my intuitive &quot;rules of thumb&quot;... It is useful for a rapid decision,\n\nAbout your DATABASE: if features and/or spatial analysis are of continental-scale, and need precision (serious applications) use geography. Else use geometry: when all database is about same (city-scale) region, or you not need precision, etc. you need only geometry. See similar rule at the suggest lecture of  @underdark.\n\nAbout your needs in terms of PERFORMANCE/PRECISION  BALANCE: geometry is faster; if you need performance and think to use geography, do your benchmarks first.\n\n\n\nKey-concepts\nOn this page, we see some key-words and the focus on some concepts: precision, performance, and something like flexibility/commodity of use.\nAs remembered by others, the difference, for store and calculations, is the use of sphere in geography and plane in geometry:\n\nthe sphere (geography) is better, more precise. See the Los Angeles/Paris example.\nevolution of geography: as @DavidF say, &quot;geography type was more recently added, so fewer functions are supported/implemented&quot;.\n\nPerhaps on the year 2020 all GIS databases will be set to the same standard SRID/EPSG (equivalent to the nowadays 4326 code, for WGS84).\nToday geography is not a default choice because of performance and functional limitations.\nDiscussion\nIn my opinion it is a question of &quot;best practices&quot;, not a deep technical/theoretical problem.\nPrecision\nAfter estimate the error on your data, do your tests and compare results: the precision gains with geography are higher than error of data? The ST_Distance function (with MAX and AVG aggregators) is the main reference in this kind of experiment.\nPerformance\nExamples of benchmarks in an urban area of ~100km2 (diameter ~11km), all stored as geometry, in a planar UTM coordinate system. NOTE: starting with the frequently used geometry/geography conversion — frequently because some functions not exist and some others, like ST_Buffer and ST_Intersection, do conversion internally.\nBench#1: a table with ~87000 polygons representing urban lots, each with poly with (avg) ~13 points,\n\nso, geography_time=6*geometry_time.\nBench#2: a table with ~3500 polygons representing urban blocks, each with poly with (avg) ~50 points:  0.6s vs 2.7s, geography_time=4.5*geometry_time.\nBench#3: ~10000 lines representing urban streets, each with ~5 points. ~0.87s vs ~0.36s, geography_time=2.4*geometry_time.\nBack to Bench#2, creating the tables and doing queries,\n\nConclusion: for little tasks and good hardaware, the times converge to the &quot;acceptable-same time&quot;, but for big tasks, there are performance ratings to consider.\nFlexibility/Commodity\nOn the benchmarks I do a day-by-day task, checking the number of points (by )... It is an example of operation that not exists for geography, needs cast. The &quot;geography/geometry cast&quot; is an annoying task for programmers, masters, etc.\nWhen reusing libraries of SQL and PL/pgSQL functions, geography need adaptations. And, if you want to optimize code, or avoid precision problems with a lot of intermediary conversions, the absence of a complete set of build-in functions, with geography, is another problem. Program for geography, is not a easy task.\nProcess-only, data interchange, etc.\nFor non-usual demand, with no intensive user like Mapserver, when your only (PostGIS) work is to process input data and return at any time (like hours or days) the processed data, the rule of thumb is &quot;use geography if you are comfortable!&quot; (see &quot;Flexibility/Commodity&quot; above).  If not, check usual rules.\nNOTE: of course, if your (non-usual) task is only  show data from PostGIS to Mapserver, with no process need,  to preserve the same (geometry or geography) of your input data, is better decision.\nI believe the data centralization is another task where geography is better: in context where the diversity of input formats and reference systems are usual, the use of a standard, such as that enforced by the geography, is beneficial... Convention over configuration is a good principle when centralization and data interchange are the business focus (see Google Maps!).\n",
            "excerpt": "Perhaps on the year 2020 all <span class=\"highlight\">GIS</span> databases will be set to the same standard SRID/EPSG (equivalent to the nowadays 4326 code, for WGS84). &hellip; ",
            "title": "What are the pros and cons of PostGIS geography and geometry types?"
        },
        {
            "tags": [
                "geometry",
                "3d",
                "algorithm",
                "extents",
                "convex-hull"
            ],
            "question_score": 97,
            "is_accepted": false,
            "answer_id": 22934,
            "is_answered": false,
            "question_id": 22895,
            "item_type": "answer",
            "score": 54,
            "last_activity_date": 1590664842,
            "creation_date": 1333646104,
            "body": "To supplement @julien&#39;s great solution, here is a working implementation in , which could serve as pseudocode to guide any GIS-specific implementation (or be applied directly in , of course).  Input is an array of point coordinates.  Output (the value of ) is an array of the vertices of the minimum bounding rectangle (with the first one repeated to close it).  Note the complete absence of any trigonometric calculations.\n\n\n\nHere is an example of its use:\n\n\n\n\n\nTiming is limited by the speed of the convex hull algorithm, because the number of vertices in the hull is almost always much less than the total.  Most convex hull algorithms are asymptotically O(n*log(n)) for n points: you can compute almost as fast as you can read the coordinates.\n",
            "excerpt": "To supplement @julien&#39;s great solution, here is a working implementation in R, which could serve as pseudocode to guide any <span class=\"highlight\">GIS</span>-specific implementation (or be applied directly in R, of course). &hellip; ",
            "title": "Finding minimum-area-rectangle for given points?"
        },
        {
            "tags": [
                "data",
                "united-states",
                "zip-codes"
            ],
            "question_score": 64,
            "is_accepted": true,
            "answer_id": 2693,
            "is_answered": false,
            "question_id": 2682,
            "item_type": "answer",
            "score": 53,
            "last_activity_date": 1628724120,
            "creation_date": 1287488684,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\nZip Codes are not polygons, and therefore do not have boundaries. Zip Codes are lines (delivery routes) or points (Post Offices). See the FAQ on the old Census Bureau website and the paper Zip Codes are Not Polygons for details.\nThat being said, when I need to use Zip Codes the first place I look is at the ESRI data that used to come on CDs with ArcView/GIS, but is now available online at Esri Data &amp; Maps.\n",
            "excerpt": "That being said, when I need to use Zip Codes the first place I look is at the ESRI data that used to come on CDs with ArcView/<span class=\"highlight\">GIS</span>, but is now available online at Esri Data &amp; Maps. &hellip; ",
            "title": "Seeking sources for US Zip Code Boundaries"
        },
        {
            "tags": [
                "geojson",
                "well-known-text",
                "validation",
                "viewer"
            ],
            "question_score": 53,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 14,
            "is_answered": true,
            "question_id": 115433,
            "item_type": "question",
            "score": 53,
            "last_activity_date": 1700550714,
            "creation_date": 1411922741,
            "body": "I once found a great but simple webpage that has a drop-down with several text-based GIS formats such as GeoJSON and WKT, and a text box to copy/paste your data. The feature is then drawn on a world map. You can continue to add shapes on the same map.\nDoes anyone know the page, or any page where I can paste WKT and GeoJSON to see them displayed on a map?\n",
            "excerpt": "I once found a great but simple webpage that has a drop-down with several text-based <span class=\"highlight\">GIS</span> formats such as GeoJSON and WKT, and a text box to copy/paste your data. &hellip; ",
            "title": "Online WKT and GeoJSON viewer"
        },
        {
            "tags": [
                "open-source-gis",
                "routing"
            ],
            "question_score": 52,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 44641,
            "item_type": "question",
            "score": 52,
            "last_activity_date": 1480994396,
            "creation_date": 1356280434,
            "body": "I&#39;m new to GIS.\n\nI need some help in determining the best or most efficient route, using a flying sleigh, through all the houses in the world. One of my coworkers told me that this site would be the best place to ask, because I would find lots of helpful GIS experts. \n\nI will need some guidance about what software to use, where to get the data, and how to process it. Since I had some extra expenses this month, I would prefer some Open Source solutions.\n\nThank you all!\n\nPS: I&#39;m in a bit of a hurry, as I need this for tomorrow!\n",
            "excerpt": "I&#39;m new to <span class=\"highlight\">GIS</span>.\n\nI need some help in determining the best or most efficient route, using a flying sleigh, through all the houses in the world. &hellip; One of my coworkers told me that this site would be the best place to ask, because I would find lots of helpful <span class=\"highlight\">GIS</span> experts. &hellip; ",
            "title": "How to calculate most efficient route passing through all the houses in the world?"
        },
        {
            "tags": [
                "qgis",
                "grass-gis"
            ],
            "question_score": 52,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 59964,
            "item_type": "question",
            "score": 52,
            "last_activity_date": 1584642030,
            "creation_date": 1367827806,
            "body": "I was working with GIS and remote sensing in a university and professional environment some ten years ago (ArcInfo etc), so I have some experience even though somewhat outdated. \n\nNow I am looking for an GIS application for a small farming project and I found GRASS and QGIS projects which both sound very interesting.\nHowever, I do not really get the difference between the two programs. \n\nWhich one do I use best for simple thematic maps with different layers?\n",
            "excerpt": "I was working with <span class=\"highlight\">GIS</span> and remote sensing in a university and professional environment some ten years ago (ArcInfo etc), so I have some experience even though somewhat outdated. &hellip; Now I am looking for an <span class=\"highlight\">GIS</span> application for a small farming project and I found GRASS and QGIS projects which both sound very interesting. &hellip; ",
            "title": "Choosing between QGIS and GRASS for simple thematic maps with different layers"
        },
        {
            "tags": [
                "shapefile",
                "vector"
            ],
            "question_score": 70,
            "is_accepted": true,
            "answer_id": 20624,
            "is_answered": false,
            "question_id": 20613,
            "item_type": "answer",
            "score": 52,
            "last_activity_date": 1462121627,
            "creation_date": 1329788791,
            "body": "This is a topic that always comes up. I may not have the right answer, but I can give you my personal opinion.\n\nThe reason that they are supported, can be attributed to several characteristics about them, so let me mention a few.\n\n\nFirst, there is a spec. I mean, I am in my early thirties and this thing existed since I was a teenager. So it is safe to say that this spec has been around for some time. Of course, there are several other formats that are also published, but the difference about this one is that...\nIt is relatively simple! It is built on top of the DBF Format, which at the time already existed and was widely supported in several platforms/OSs. There were already parsers that could read half of this format (the DBF part), so it made supporting the extra addition easier. You have a geometry? Sure just serialize it and write it. You are done. Contrast this with a coverage! Try to explain to somebody in simple terms what a topology clean does. It is not trivial to write a topologically clean coverage.\nMost importantly, I think the #1 reason for shapefiles to still be popular is that they are supported in both Open Source and Proprietary systems alike. What GIS do you know that doesn&#39;t support shapefiles?!? Unheard of. \n\n\nAs a replacement, we hear of File GeoDatabases and Spatialite. Both formats, are vastly superior in terms of functionality, flexibility, speed, etc. when compared to Shapefiles. In their own way, they have certain things that make them better than each other in different areas, but a comparison of spatialite and FileGDB is certainly out of the scope of this question. \n\nDo I think that either of this formats will replace Shapefiles? Not in their current incarnations. \n\nWhy?\n\nNot because of a technological argument (I did say they were superior in that aspect after all), but because of something else: licensing.\n\nSo what are their problems?\n\nFileGDB:\n\nFileGDB provides interoperability through the new FileGDB API. Nevertheless, this API is provided in binary format by ESRI. This is not a specification. Having worked in the GeoDatabase team in the past, I can tell you, contrary to all the tin-foil-hat-wearing conspiracy theorists, this is not malicious at all. It is because the internals of the GeoDatabase change on every release. Publishing a full spec would entail basically giving all the details of how everything is supposed to be maintained and then carefully documenting the changes to the format with every yearly release. It doesn&#39;t make sense. So the FileGDB API, even though it is not a spec, it abstracts out all those little changes. And now it can be used cross-platform! Mind you, this is a huge step forward! Considering the conservative nature of ESRI, this is definitely a reaction in the right direction.\n\nAnd yet, binary-only support doesn&#39;t make anybody in the Open Source world too happy. How do you then take advantage of porting some code to say to some other flavor of Linux if ESRI doesn&#39;t support it. You can&#39;t. This is what makes Open Source powerful, and now, you cannot take advantage of this. If ESRI decides to stop supporting Debian, that&#39;s it. You are done. And there is nothing you can do to change it. \n\nSpatialite:\n\nSpatialite is awesome because it gets all the free functionality from SQLite. SQLite is used everywhere. It is on your Android Phone, on your iPhone/iPad, on Firefox, on Google Chrome, on several commercial embedded devices - can go on forever. To truly make it into a Geoformat (and not just do dumb bounding box operations), it needs to leverage the same geometry library that PostGIS uses: GEOS. Sadly, GEOS is based on another even more awesome geometry library known as JTS. All the algorithms in JTS are extremely powerful, so what is the problem?\n\nWell, JTS is licensed as Open Source LGPL, and LGPL is a viral license. JTS is LGPL, means GEOS is LGPL, means spatialite linked statically with GEOS is LGPL. This sucks. Why? Without explaining open source licenses too much, I can tell you that, for example, I cannot use spatialite on, say, an iPhone app because that would make my entire app automatically open source (iOS only allows static linking). Any type of GPL license (reasonably) scares the crap out of ESRI, and so they will not touch it with a 10 foot pole. Hence, ArcGIS, the most popular GIS system in the world does not (and will probably never) support spatialite natively. This automatically kills it as a viable format.\n\nAnd thus we go back to crappy shapefiles that are supported everywhere.\n\nUpdate: \n\nApparently my answer was controversial enough that someone decided it was OK to freely edit and change the entire meaning of my answer to put their point of view. Please don&#39;t do that. If you disagree with me, that is completely fine, just post your opinion in a different answer and let the community decide. I rolled backed the edits to my answer to show the original meaning. I am adding this update in case you read the edited answer that claimed that sqlite was a viable format.\n",
            "excerpt": "What <span class=\"highlight\">GIS</span> do you know that doesn&#39;t support shapefiles?!? Unheard of. \n\n\nAs a replacement, we hear of File GeoDatabases and Spatialite. &hellip; Hence, ArcGIS, the most popular <span class=\"highlight\">GIS</span> system in the world does not (and will probably never) support spatialite natively. This automatically kills it as a viable format. &hellip; ",
            "title": "Are there any attempts to replace the shapefile?"
        },
        {
            "tags": [
                "career",
                "freelancing"
            ],
            "question_score": 52,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 103990,
            "item_type": "question",
            "score": 52,
            "last_activity_date": 1493211551,
            "creation_date": 1404329001,
            "body": "There appears to be very little information available about competitive hourly rates for GIS freelancers.  Additionally, GIS freelancers never post rates on their websites.  Upwork has some information on what people are asking, although I believe the rates are well below  the industry standard due to the structure of their bidding system (example).  The US Bureau of Labor Statistics states the median pay for Cartographers and Photogrammetrists is $27.62 USD, although this is presumably low because it does not taking into account fringe benefits. What is the going rate for GIS freelancers in the USA?  I am interested in hearing from both freelancers and businesses who contract out work. \n",
            "excerpt": "There appears to be very little information available about competitive hourly rates for <span class=\"highlight\">GIS</span> freelancers.  Additionally, <span class=\"highlight\">GIS</span> freelancers never post rates on their websites. &hellip; What is the going rate for <span class=\"highlight\">GIS</span> freelancers in the USA?  I am interested in hearing from both freelancers and businesses who contract out work. &hellip; ",
            "title": "What is the going rate for GIS freelancers?"
        },
        {
            "tags": [
                "postgis",
                "sql",
                "dissolve"
            ],
            "question_score": 51,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 31895,
            "item_type": "question",
            "score": 51,
            "last_activity_date": 1517379539,
            "creation_date": 1345579418,
            "body": "I have the following layer using SRID 27700 in postgis:\n\n\n\nIt&#39;s every administrative region in the UK, and (as you can see from the colour grouping) each of them has a text field specifying the county they lie in.\n\nWhat I&#39;d like to do is to make larger county polygons from the smaller ones in a given county, so EG in the picture above all the teal colour polygons would form one large polygon from the single outer ring that contains all the polys in that colour, like wise all purple, brown, pink, grey etc should all form one polygon.\n\nI&#39;ve already tried the following:\n\n\n\nBut it keeps generating broken geometries which I then have big problems processing further.\n\nI&#39;m trying to make a simpler county level map with the major output areas in.\n\nAny solutions don&#39;t have to be in Postgis either, I have the full OS4Geo stack installed, the latest version of QGis and more utils than I can shake a stick at.\n\nThe only things I don&#39;t have are the big boys like ArcGis (Although I may have an Old Mapinfo lying around somewhere)\n\n\n\nFor the record, the dataset I&#39;m trying to create is to accompany a GIS book I&#39;m on writing aimed at .NET programmers wishing to write GIS applications using .NET\n\n\n\nAfter trying the suggestions below, the one that worked the best was &#39;Paul Ramseys&#39; solution.  \n\nI now have a nice simplified counties &amp; boroughs file that&#39;s just simple enough for my book, but complex enough to allow me to demonstrate some interesting geo-spatial SQL.\n\nEven though Paul&#39;s solution ultimately was the one that worked for me, I also drew on the other answers for things like simplifying the polygon map and reducing the complexity further.\n\nOn thing I did observe while doing this however, while ST_Collect is indeed faster than ST_Union, run for run it was also the one mostly responsible for broken geometries.  My guess is the speed increase is obtained at the expense of less accuracy in the core function.\n",
            "excerpt": "The only things I don&#39;t have are the big boys like ArcGis (Although I may have an Old Mapinfo lying around somewhere)\n\n\n\nFor the record, the dataset I&#39;m trying to create is to accompany a <span class=\"highlight\">GIS</span> book I&#39;m &hellip; on writing aimed at .NET programmers wishing to write <span class=\"highlight\">GIS</span> applications using .NET\n\n\n\nAfter trying the suggestions below, the one that worked the best was &#39;Paul Ramseys&#39; solution. &hellip; ",
            "title": "Joining lots of small polygons to form larger polygon using PostGIS?"
        },
        {
            "tags": [
                "software-recommendations",
                "open-source-gis",
                "desktop-gis"
            ],
            "question_score": 58,
            "is_accepted": true,
            "answer_id": 28,
            "is_answered": false,
            "question_id": 24,
            "item_type": "answer",
            "score": 50,
            "last_activity_date": 1522809003,
            "creation_date": 1279827032,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\nhttp://freegis.org/ - the oldest and perhaps most comprehensive directory of free GIS software and projects.\n\nWikipedia has most of them listed\n\n\n\n\nQGIS\nuDig\nOpenJump\ngvSIG\nTerraView\nKosmos\nWhiteBox\nMapWindow\nGeoDa\nIf you consider Google Earth as a GIS application, Nasa&#39;s WorldWind is an open source alternative.\nEpi-map, part of CDC&#39;s Epi-info epidemiology package, may be worth a look if you&#39;re in that line of work.\nOpenMap&#39;s free too. UI&#39;s pretty old school though. I prefer qGIS or uDig. \nQGIS supports native SAGA grid format so it is very easy to work with these two programs together and use advantages of both\n\n",
            "excerpt": "http://freegis.org/ - the oldest and perhaps most comprehensive directory of free <span class=\"highlight\">GIS</span> software and projects. &hellip; Wikipedia has most of them listed\n\n\n\n\nQGIS\nuDig\nOpenJump\ngvSIG\nTerraView\nKosmos\nWhiteBox\nMapWindow\nGeoDa\nIf you consider Google Earth as a <span class=\"highlight\">GIS</span> application, Nasa&#39;s WorldWind is an open source alternative &hellip; ",
            "title": "Seeking Free and Open Source GIS Desktop packages?"
        },
        {
            "tags": [
                "arcgis-pro"
            ],
            "question_score": 59,
            "is_accepted": true,
            "answer_id": 68142,
            "is_answered": false,
            "question_id": 66438,
            "item_type": "answer",
            "score": 49,
            "last_activity_date": 1473128695,
            "creation_date": 1375922033,
            "body": "This Q&amp;A was pointed out to me and I thought I could assist by providing a little transparency about ArcGIS Professional.   I look after the teams responsible for ArcMap, ArcGlobe, ArcScene, ArcGIS Engine,  and the new ArcGIS Professional application.   Firstly,  it’s an active development project and many important decisions both technical and business related are yet to be made.   And,  you can help make them,  our team spoke with many folks at the Esri 2013 User Conference who got hands on with ArcGIS Pro,  and gave us great feedback – if you were one of them,  thanks!   But providing your ideas, thoughts / feedback through ideas.arcgis.com,  your Esri account reps,  by participating in our Early Adaptor or beta programs and forums like this all are good ways to give us guidance as we progress.\n\nIs ArcGIS Professional a replacement for ArcMap, ArcGlobe and ArcScene?  No.    ArcGIS Pro is a brand new application,  with brand new opportunity to help users solve real problems, that can benefit from multiple 2D and 3D views allowing visualization and editing in both environments, for example.   Apparently my choice of words in my demo of the software during the plenary was unclear about it “running with Desktop,” sorry for that confusion,  I should have been more clear about the side by side capability of existing Desktop applications and ArcGIS Pro.    They simply can run side by side on the same machine,  not sharing registry keys...etc.\n\nOur vision was to take the most commonly used functionality from these three separate Desktop applications (ArcMap/Globe/Scene) and merge it into one application – support for both 2D and 3D views is the obvious benefit and example here.    But ArcMap/Globe/Scene will stay current and maintained, with new functionality to be delivered through these applications for the long term.  I think ArcGIS 10.2 was a good example of this,  read the what’s new document carefully,  a lot of great new capability went into 10.2.   When ArcGIS Professional is released,  the current Desktop applications will be updated and ship too.   Will there be a day when someone will only use ArcGIS Professional,  and not ArcMap – maybe – but it’s up to that person, and their workflows to make that decision based on the capability of ArcGIS Professional.   It won’t be because our team stops shipping ArcMap/ArcGlobe/ArcScene in the foreseeable future.    We are hard at work with the 10.2.1 release now for these applications.\n\nArcGIS Pro is a completely new WPF based application, it’s not java anything,  it’s not based on ArcGIS Runtime either.    The important thing is has great performance, and the application remains responsive all the time, it does not block the UI as can happen in single threaded applications.  This of course is achieved through a multi-threaded (64 bit) application framework that can take advance of large memory address space and GPU’s for display performance.    The 2D parts of the graphics engine have been shipping in several releases of ArcGIS,  the 3D capability has not been released previously, and is new and very fast.  Our Graphics team has many years invested in this engine,  and we’re excited to be getting close to shipping it soon.  This 3D graphics engine is not based on CityEngine,  but the CityEngine runtime is utilized in the application for 3D representations, for example, and will continue to be used for 3D innovation going forward,  a good example of this is our Solution for 3D Cities and Campuses. \nLicensing levels is another topic that questions are being asked about.   \n\nAs I said in the road ahead sessions at the 2013 UC,  we have not made all final (business) decisions here.   But our goal is to simplify licensing where we can,  and make sure it’s in alignment with ArcGIS.com and new simpler subscription models we are releasing now for the ArcGIS Platform.   Also simplifying the access and update of software, through web downloads is what we are working on.   We will provide status as we make progress on these important decisions. \nI hope this helps you understand not just some higher level motivation and vision, but also a bit of the technical architecture of ArcGIS Professional we have implemented so far.\n\nArcGIS Professional Extensibility.   Here are our current thoughts about extensibility for ArcGIS Pro.  You can write and run Python scripts in ArcGIS that call geoprocessing tools and use an exhaustive suite of scripting functions available in the ArcGIS Python API, ArcPy, to automate your GIS tasks. Your scripts can also use a diverse array of functions provided through Python’s standard and 3rd party libraries.\n\nYou can leverage the considerable capabilities of the .NET framework and WPF to extend the application with functionality involving interactive scenarios and rich user interface aspects.  Both of these types of customizations are accomplished using the well-known Add-In model.\n\n.NET Developers can code against a simplified object model that’s easier to understand and use than the COM based interfaces in the ArcObjects API.  The .NET API is modern, language specific.\n\nArcGIS Professional will run “stand alone” like current Desktop applications and ArcGIS Runtime Apps.   But we are also really trying to invite the Desktop users to leverage the ArcGIS Platform as a whole if it makes sense for them.   We created this Professional GIS site with this in mind http://pro.arcgis.com/\n\nWe see this site as a consolidated wealth of information for GIS Professionals,  but also an opportunity to be exposed to brand new capability in the ArcGIS Platform in an integrated way, with the goal of helping you leverage the Platform better to solve the real problems. \n",
            "excerpt": "You can write and run Python scripts in ArcGIS that call geoprocessing tools and use an exhaustive suite of scripting functions available in the ArcGIS Python API, ArcPy, to automate your <span class=\"highlight\">GIS</span> tasks. &hellip; We created this Professional <span class=\"highlight\">GIS</span> site with this in mind http://pro.arcgis.com/\n\nWe see this site as a consolidated wealth of information for <span class=\"highlight\">GIS</span> Professionals,  but also an opportunity to be exposed to &hellip; ",
            "title": "What are Esri&#39;s new ArcGIS for Professionals and ArcGIS Pro?"
        },
        {
            "tags": [
                "python",
                "references"
            ],
            "question_score": 49,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 17,
            "is_answered": true,
            "question_id": 3001,
            "item_type": "question",
            "score": 49,
            "last_activity_date": 1528410061,
            "creation_date": 1288205358,
            "body": "In your opinion, what is the best book/site to learn Python with GIS goals in mind?\n\nBy &quot;best&quot;, I mean:\n\n\nnot very long (book)\neasy to understand (book/site)\ngood practical examples (book/site)\n\n\nFor answers specific to learning how to use the ArcPy site-package for Python to customize ArcGIS for Desktop there is a separate Q&amp;A: What are some resources for learning ArcPy?\n",
            "excerpt": "In your opinion, what is the best book/site to learn Python with <span class=\"highlight\">GIS</span> goals in mind? &hellip; ",
            "title": "Learning Python programming with generic GIS goals in mind?"
        },
        {
            "tags": [
                "open-source-gis",
                "osgeo4w",
                "osgeo",
                "shell"
            ],
            "question_score": 29,
            "is_accepted": true,
            "answer_id": 165104,
            "is_answered": false,
            "question_id": 164976,
            "item_type": "answer",
            "score": 49,
            "last_activity_date": 1443796149,
            "creation_date": 1443796149,
            "body": "OSGeo:\n\nOSGeo is an umbrella organisation (Foundation) that supports many Open Source GIS Projects. Some of the more well known ones are: QGIS, GeoServer, and OpenLayers.\n\nBeing part of OSGeo gives a project some support, through assistance with governance, and potentially funding. But it also gives a project some legitimacy and assurance. Being part of OSGeo means the project has a team of core developers, a roadmap on where the project is going, and some form of governance.\n\nYou can be confident using Open Source GIS software because it has this support network through OSGeo.\n\nOSGeo4W:\n\nOSGeo4W is a windows installer for Open Source GIS projects. The nature of Open Source means that many project/programs rely on eachother for features. A great example of this is GDAL. GDAL is used to some extent by practically all Open Source GIS projects to read and write data. But because Windows, being a closed platform, it has not developed a package manager like Unix based operating systems. So if you install GRASS and QGIS using their stand-alone installers, you end up with 2 installs of GDAL. Add 3 or 4 more Open Source installs and you can end up with a dozen installs of GDAL, in addition an install just for GDAL.\n\nThis is where OSGeo4W comes in. It can keep track of the shared requirements of Open Source GIS packages, so QGIS and GRASS can share a single install of GDAL. It also keeps track of versions so you can simply upgrade programs.\n",
            "excerpt": "You can be confident using Open Source <span class=\"highlight\">GIS</span> software because it has this support network through OSGeo.\n\nOSGeo4W:\n\nOSGeo4W is a windows installer for Open Source <span class=\"highlight\">GIS</span> projects. &hellip; GDAL is used to some extent by practically all Open Source <span class=\"highlight\">GIS</span> projects to read and write data. &hellip; ",
            "title": "What is OSGeo4W?"
        },
        {
            "tags": [
                "qgis",
                "gvsig"
            ],
            "question_score": 48,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 8,
            "is_answered": true,
            "question_id": 13509,
            "item_type": "question",
            "score": 48,
            "last_activity_date": 1554667608,
            "creation_date": 1313157763,
            "body": "Many debutant GIS users are asking me which one is better QGIS or gvSIG. Since I use Qgis and I don&#39;t have any experience in gvSIG, I aways say that both are very nice softwares and the chose is a matter of liking vanilla or chocolate.\nBut I want to have a better answer for that question, so I would like to hear from people with experience on both of them, what drove you to choose one or the other as your favorite opensource desktop GIS.\n",
            "excerpt": "Many debutant <span class=\"highlight\">GIS</span> users are asking me which one is better QGIS or gvSIG. &hellip; But I want to have a better answer for that question, so I would like to hear from people with experience on both of them, what drove you to choose one or the other as your favorite opensource desktop <span class=\"highlight\">GIS</span> &hellip; ",
            "title": "Comparing QGIS and gvSIG?"
        },
        {
            "tags": [
                "python",
                "references"
            ],
            "question_score": 49,
            "is_accepted": true,
            "answer_id": 3004,
            "is_answered": false,
            "question_id": 3001,
            "item_type": "answer",
            "score": 48,
            "last_activity_date": 1528410061,
            "creation_date": 1288206317,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\n\nGIS Lounge&#39;s GIS + Python page\nPython Geo-Spatial Development\n\n\nFor straight python, his has been discussed thoroughly on Stack Overflow:\n\n\nHow to learn Python?\nNewbie teaching self python, what else should I be learning?\nFastest way to learn Python?\nHow should I go about learning Python?\n\n\nThe second link has a link to the latest edition of a book I loved when learning python How to Think Like A Computer Scientist: Learning With Python\n\n\nZed Shaw&#39;s learn python book:  Learn Python the Hard Way.\nGeoprocessing with Python using Open Source GIS.\n\n",
            "excerpt": "<span class=\"highlight\">GIS</span> Lounge&#39;s <span class=\"highlight\">GIS</span> + Python page\nPython Geo-Spatial Development\n\n\nFor straight python, his has been discussed thoroughly on Stack Overflow:\n\n\nHow to learn Python? &hellip; Geoprocessing with Python using Open Source <span class=\"highlight\">GIS</span>. &hellip; ",
            "title": "Learning Python programming with generic GIS goals in mind?"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcpy",
                "arcgis-10.1",
                "performance"
            ],
            "question_score": 38,
            "is_accepted": false,
            "answer_id": 30141,
            "is_answered": false,
            "question_id": 30140,
            "item_type": "answer",
            "score": 48,
            "last_activity_date": 1343069569,
            "creation_date": 1343069569,
            "body": "I am using an example with 1 million randomly generated points inside of a filegeodatabase. Attached here.\n\nHere is some code to get us started:\n\n\n\nAnd some initial results:\n\n\n\nImagine larger, more complex datasets. The SearchCursor will indefinitely crawl. \n\nI am not at all dissatisfied with the results, however, the DataAccess module is being used extensively in our GIS development circle. I am looking to rebuild some of our function definitions with this module as it is more flexible than a MakeTableView + GetCount methodology.\n",
            "excerpt": "I am not at all dissatisfied with the results, however, the DataAccess module is being used extensively in our <span class=\"highlight\">GIS</span> development circle. &hellip; ",
            "title": "Fastest way to count the number of features in a feature class?"
        },
        {
            "tags": [
                "raster",
                "convert",
                "r"
            ],
            "question_score": 46,
            "is_accepted": true,
            "answer_id": 20052,
            "is_answered": false,
            "question_id": 20018,
            "item_type": "answer",
            "score": 48,
            "last_activity_date": 1332788073,
            "creation_date": 1328794537,
            "body": "Several steps required:\n\n\nYou say it&#39;s a regular 1km grid, but that means the lat-long aren&#39;t regular. First you need to transform it to a regular grid coordinate system so the X and Y values are regularly spaced.\n\na. Read it into R as a data frame, with columns x, y, yield.\n\n\n\nb. Convert the data frame to a SpatialPointsDataFrame using the sp package and something like:\n\n\n\nc. Convert to your regular km system by first telling it what CRS it is, and then spTransform to the destination.\n\n\n\nd. Tell R that this is gridded:\n\n\n\nAt this point you&#39;ll get an error if your coordinates don&#39;t lie on a nice regular grid.\nNow use the raster package to convert to a raster and set its CRS:\n\n\nNow have a look:\n\n\nNow write it as a geoTIFF file using the raster package:\n\n\n\n\nThis geoTIFF should be readable in all major GIS packages. The obvious missing piece here is the proj4 string to convert to: this will probably be some kind of UTM reference system. Hard to tell without some more data...\n",
            "excerpt": ") = CRS(&quot;insert your proj4 string here&quot;)\n\nNow have a look:\n\nplot(r)\n\nNow write it as a geoTIFF file using the raster package:\n\nwriteRaster(r,&quot;pts.tif&quot;)\n\n\n\nThis geoTIFF should be readable in all major <span class=\"highlight\">GIS</span> &hellip; ",
            "title": "How can I convert data in the form of lat, lon, value into a raster file using R?"
        },
        {
            "tags": [
                "arcgis-platform"
            ],
            "question_score": 35,
            "is_accepted": true,
            "answer_id": 81488,
            "is_answered": false,
            "question_id": 81483,
            "item_type": "answer",
            "score": 48,
            "last_activity_date": 1719963578,
            "creation_date": 1388176667,
            "body": "In the beginning, there was INFO (a standalone relational file manager,\navailable on minicomputers like Prime, VAX, and DG) made by Henco.\nThen ESRI (now Esri) added geometry processing from its initial PIOS (Polygon Information Overlay  System) product , paired with attributes\nwithin INFO, and called the result ARC/INFO (&quot;arc&quot; files supported line\ntypes, both linear features and the edges of polygons).  The name mutated\nto Arc/Info sometime after ArcView was released, and eventually became\nthe legacy ArcInfo Workstation product.\nThe &quot;Arc&quot; part has been retained across time, and the current Esri product\nline ups the ante to &quot;ArcGIS&quot; in most of the core products.\nThere had been a more complete timeline on the Esri web site, but it&#39;s now 404.  This is as close as I can get to what was present when originally answered. There&#39;s also a history of GIS that mentions ArcInfo&#39;s origin on the esri.com site currently.\n",
            "excerpt": "There&#39;s also a history of <span class=\"highlight\">GIS</span> that mentions ArcInfo&#39;s origin on the esri.com site currently. &hellip; ",
            "title": "Why is ArcGIS called that?"
        },
        {
            "tags": [
                "raster",
                "vector"
            ],
            "question_score": 47,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 7,
            "is_answered": true,
            "question_id": 7077,
            "item_type": "question",
            "score": 47,
            "last_activity_date": 1501648214,
            "creation_date": 1299798799,
            "body": "What are raster and vector data in the GIS context? \n\nIn general terms what applications, processes, or analysis are each suited for? (and not suited for!)\n\nDoes anyone have some small, concise, effective pictures which convey and contrast these two fundamental data representations?\n",
            "excerpt": "What are raster and vector data in the <span class=\"highlight\">GIS</span> context? \n\nIn general terms what applications, processes, or analysis are each suited for? (and not suited for!) &hellip; ",
            "title": "What are Raster and Vector data in GIS and when to use?"
        },
        {
            "tags": [
                "references",
                "education"
            ],
            "question_score": 47,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 17227,
            "item_type": "question",
            "score": 47,
            "last_activity_date": 1511762659,
            "creation_date": 1322139500,
            "body": "This Q&amp;A lists free as in $0 workshops in GIS and related fields that have their material available to view or download online. The list is not limited to FOSS GIS, as GISers usually use a combination of open and closed source tools to accomplish their tasks. Some of these tools are easier than others and some are better documented. This list will be a great benefit to the community especially for new comers to the field.\nGeneral GIS\n\nGIS Project Video Tutorial on Acquiring, Analyzing, and Mapping US Census Data in QGIS from @A.S\nGIS Tutor: Beginner / Intermediate Level GIS from @radek\nBostonGIS from @simo\nLectures on GIS for the Social Sciences from @ubernatural\n\nOpen-source GIS\n\nOpenGEO Education Center from @radek\nQGIS Videos (faunitalia) from @simo\nGIS SE Question: Geoserver Tutorials from @com\nGIS SE Question: Open Source Training Materials from @MarkIreland\nQGIS for Newbies from @IanAllan\n\nESRI Products\n\nGIS SE Question: Best place for (structured) ArcGIS tutorials from @robintw\nArcGIS Automation and Programming from @Bethany\n\nTransportation\nThese links include either theoretical or applied transportation knowledge in transportation planning\n\nGIS primer for Transportation\nTransit Capacity and Quality of Service Manual\nUrbanSim: FOSS Urban development, socio economic, and land use planning package\nMOVES(Motor Vehicle Emission Simulator) Workshop and technical background\nTransit GIS tutorials\nRemote sensing in transportation workshop\nFlorida&#39;s CBT planning model explained\n\nDisaster Management\n\nGeo-information Technology for Crisis Management \n\nDatabases\n\nSpatial Database Course Material from @radek\n\nGeo Statistics\n\nLearn R Lectures and Classes\nGeodatabase Mining Course from @radek\nA Practical Guide to Geostatistical Mapping\n\n",
            "excerpt": "General <span class=\"highlight\">GIS</span>\n\n<span class=\"highlight\">GIS</span> Project Video Tutorial on Acquiring, Analyzing, and Mapping US Census Data in QGIS from @A.S\n<span class=\"highlight\">GIS</span> Tutor: Beginner / Intermediate Level <span class=\"highlight\">GIS</span> from @radek\nBostonGIS from @simo\nLectures on <span class=\"highlight\">GIS</span> &hellip; for the Social Sciences from @ubernatural\n\nOpen-source <span class=\"highlight\">GIS</span>\n\nOpenGEO Education Center from @radek\nQGIS Videos (faunitalia) from @simo\n<span class=\"highlight\">GIS</span> SE Question: Geoserver Tutorials from @com\n<span class=\"highlight\">GIS</span> SE Question: Open &hellip; ",
            "title": "Free GIS workshops, tutorials, and applied learning material"
        },
        {
            "tags": [
                "algorithm",
                "routing",
                "spatial-database",
                "optimization"
            ],
            "question_score": 46,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 10543,
            "item_type": "question",
            "score": 46,
            "last_activity_date": 1602890616,
            "creation_date": 1307011930,
            "body": "There are works like Reach for A* from Microsoft researchers and Highway Hierarchies by Sanders and Schtolz (if I spell the name correctly) from Karlsruhe Uni. Both of them reduce the calculations order a lot, and speed up thousand times on large graphs (see the results in the linked documents). The latter work led to Open Source Routing Machine, which unfortunatly isn&#39;t popular enough and not adapted (I couldn&#39;t compile it although tried hard).\n\nAt the same time, the dbs that I tried, Spatialite and PgRouting, according to their docs, offer just Dijkstra and A* algorithms. I&#39;ve not even seen bi-directional search mentioned, which saves calculation time twice in my experience.\n\nAre there better algorithms for databases or other applications?\n",
            "excerpt": "There are works like Reach for A* from Microsoft researchers and Highway Hierarchies by Sanders and Schtolz (if I spell the name correctly) from Karlsruhe Uni. Both of them reduce the calculations ord &hellip; ",
            "title": "Are there newer routing algorithms (than Dijkstra, A*) in GIS databases?"
        },
        {
            "tags": [
                "raster",
                "convert",
                "r"
            ],
            "question_score": 46,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 20018,
            "item_type": "question",
            "score": 46,
            "last_activity_date": 1678081995,
            "creation_date": 1328734586,
            "body": "I have a data set of values over a km grid in the continental U.S. The columns are &quot;latitude&quot;, &quot;longitude&quot;, and &quot;observation&quot;, e.g.:\n\n\n\nor, as an R data frame:\n\n\n\n(the full data set can be downloaded as csv here)\n\nThe data are output from a crop model (intended to be on) a 30km x 30km grid (from Miguez et al 2012). \n\n\n\nHow can I convert these to a raster file with GIS - related metadata such as map projection?\n\nIdeally the file would be a text (ASCII?) file because I would like for it to be platform and software independent.\n",
            "excerpt": "How can I convert these to a raster file with <span class=\"highlight\">GIS</span> - related metadata such as map projection?\n\nIdeally the file would be a text (ASCII?) &hellip; ",
            "title": "How can I convert data in the form of lat, lon, value into a raster file using R?"
        },
        {
            "tags": [
                "geometry",
                "3d",
                "algorithm",
                "centroids"
            ],
            "question_score": 43,
            "is_accepted": true,
            "answer_id": 22744,
            "is_answered": false,
            "question_id": 22739,
            "item_type": "answer",
            "score": 46,
            "last_activity_date": 1345582287,
            "creation_date": 1333432032,
            "body": "Every polygon has, at a minimum, four distinct &quot;centers&quot;:\n\n\nThe barycenter of its vertices.\nThe barycenter of its edges.\nIts barycenter as a polygon.\nA GIS-specific &quot;center&quot; useful for labeling (usually calculated with undocumented proprietary methods).\n\n\n(They may accidentally coincide in special cases, but for &quot;generic&quot; polygons they are distinct points.)\n\nA &quot;barycenter&quot; in general is a &quot;center of mass.&quot;  The three types differ on where the mass is presumed located: it either is entirely on the vertices, spread uniformly on the edges, or spread uniformly throughout the polygon itself.\n\nSimple methods exist to compute all three barycenters.  One approach relies on the basic fact that the barycenter of the disjoint union of two masses is the total-mass-weighted average of the barycenters.  From this we easily obtain the following:\n\n\nThe barycenter of two (equally weighted) vertices is their average.  This is obtained by averaging their coordinates separately.  Geometrically, it is the midpoint of the line segment joining the two vertices.\nInductively, the barycenter of n (equally weighted) vertices is obtained by averaging their coordinates separately.\nThe barycenter of a line segment is its midpoint.  (This is clear by symmetry.)\nThe barycenter of a polyline is obtained by finding the midpoints of each line segment and then forming their weighted average using the segment lengths as weights.\n\nFor example, consider the &quot;L&quot; shape delineated by the points (0,0), (6,0), (6,12).  There are two segments: one of length 6 with midpoint at ( (0+0)/2, (0+6)/2 ) = (3,0) and another of length 12 with midpoint at ( (6+6)/2, (0+12)/2 ) = (6,6).  Their length-weighted average coordinates are therefore (x,y) with\n\n\n\nThis differs from the barycenter of the three vertices, which is ( (0+6+6)/3, (0+0+12)/3 ) = (4,4).\n\n(Edit As another example, consider the figure in the question, which although square in shape, is represented as a pentagon determined by the sequence of points (0,0), (1/2,0), (1,0), (1,1), (0,1).  The five sides have lengths 1/2, 1/2, 1, 1, 1 and midpoints (1/4,0), (3/4,0), (1,1/2), (1/2,1), and (0,1/2), respectively.  Their weighted average therefore equals\n\n\n\nas one would hope, even though the barycenter of the vertices alone (computed as in #2 above) is (0.5, 0.4).)\nThe barycenter of a polygon can be obtained by triangulation to decompose it into triangles.  The barycenter of a triangle-qua-polygon coincides with the barycenter of its vertices.  The area-weighted average of these barycenters is the polygon&#39;s barycenter.  Triangle areas are readily computed in terms of their vertex coordinates (e.g., in terms of the wedge product of two of the sides).  For an illustration of such area calculations, including how to exploit signed (positive or negative) areas, see the section on &quot;Area&quot; at my (old) course notes page.\n\n(Edit Consider the polygon depicted in the question for example.  We could triangulate it with triangles ((0,0), (1/2,0), (0,1)) on the left, ((0,1), (1/2,0), (1,1)) in the middle, and ((1,1), (1,0), (1/2,0)) on the right.  Their areas are 1/4, 1/2, 1/4 respectively and their barycenters--obtained by averaging their vertices--are (1/6,1/3), (1/2,2/3), and (5/6,1/3), respectively.  The area-weighted average of these barycenters equals\n\n\n\nas it should, despite the presence of that fifth vertex along the bottom edge.)\n\n\nIt is evident that each of these methods is efficient: it requires just a single pass over the &quot;spaghetti&quot; representation of the polygon, using (fairly little) constant time at each step.  Note that in all cases except the first (of pure vertices), more information than just a list of vertex coordinates is needed: you need to know the topology of the figure as well.  In the &quot;L&quot; example, we needed to know that (0,0) was connected to (6,0) and not to (6,12), for instance.\n\nThese are all Euclidean concepts.  They can be extended to the sphere (or ellipsoid) in several ways.  A straightforward one views the features as a simplicial complex in three (Euclidean) dimensions, computes the appropriate barycenter, and then projects it outward from the center of the ellipsoid back to the surface.  This requires no new concepts or formulas; you only have to work with a third (z) coordinate in addition to the first two coordinates.  (Areas are still found using lengths of wedge products.)\n\nAnother generalization recognizes that the Euclidean metric--the square root of a sum of squares, according to Pythagoras--can be changed to other Lp metrics for p &gt;= 1: you take the pth root of the sum of pth powers.  Finding appropriate &quot;barycenters&quot; is no longer so simple, because the beautiful additive properties exploited above (barycenters are weighted averages of barycenters of simpler parts of a figure) no longer hold in general.  Often, iterative approximate numerical solutions have to be obtained.  They might not even be unique.\n\nAdditional centers can be defined for various purposes.  Triangles have many different centers that can generalize (somewhat) to polygons: the center of the circumcircle, the center of (some) maximal incircle, the center of a minimum-area bounding ellipse, and others.  Any set can be enclosed in various &quot;hulls,&quot; such as the convex hull, and the centers of those hulls obtained.\n\nNote that many of these &quot;centers&quot; are not necessarily located within the interior of a polygon.  (Any reasonable center of a convex polygon will lie within its interior, though.)\n\nThis variety of approaches and solutions indicates one should be wary of a generic term like &quot;center of geometry&quot; or merely &quot;center&quot;: it could be just about anything.\n",
            "excerpt": "A <span class=\"highlight\">GIS</span>-specific &quot;center&quot; useful for labeling (usually calculated with undocumented proprietary methods). &hellip; ",
            "title": "Finding center of geometry of object?"
        },
        {
            "tags": [
                "web-mapping",
                "development",
                "career"
            ],
            "question_score": 33,
            "is_accepted": false,
            "answer_id": 5089,
            "is_answered": false,
            "question_id": 5083,
            "item_type": "answer",
            "score": 44,
            "last_activity_date": 1554720453,
            "creation_date": 1294902769,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\n\nPick a programming language (or maybe 2) and write a lot of code. I would recommend Python and JavaScript given your current skills\nStop using the ESRI examples to learn how to program Python and look at pure python for a while. Do some spatial operations using PostGIS/SpatiaLite and Shapely\nStart thinking of yourself as a programmer who does spatial work and not a GIS analyst who does some programming\nBite the bullet and write code for things that might be quicker through the GUI - without writing code you will never get better\nFollow and start to work on an open source project\nVolunteer to write code for somebody - without a deadline and a concrete project it is hard to get going\nMaybe take some programming classes - not a complete requirement but it might help\nRead programming blogs and the normal stackoverflow to learn and see how programmers think\nGet the book &quot;Coders at work&quot; and &quot;Pragmatic Programmer, from apprentice to Craftsman&quot; [That title is pretty close to the actual title]\nWrite and read a lot of code\nRemember that it takes about 10,000 hours to become and expert at something - so start writing code and reading code\nBe prepared to suck for a while - it is part of moving up the learning curve\nStop using desktop GUIs - Especially for some of your more basic GIS tasks like intersections and such\n\n",
            "excerpt": "Do some spatial operations using PostGIS/SpatiaLite and Shapely\nStart thinking of yourself as a programmer who does spatial work and not a <span class=\"highlight\">GIS</span> analyst who does some programming\nBite the bullet and write &hellip; expert at something - so start writing code and reading code\nBe prepared to suck for a while - it is part of moving up the learning curve\nStop using desktop GUIs - Especially for some of your more basic <span class=\"highlight\">GIS</span> &hellip; ",
            "title": "Switching career from GIS Technician/Analyst to GIS Web Map Developer/Programmer?"
        },
        {
            "tags": [
                "raster",
                "interpolation",
                "gis-principle",
                "resampling"
            ],
            "question_score": 45,
            "is_accepted": false,
            "answer_id": 2598,
            "is_answered": false,
            "question_id": 2587,
            "item_type": "answer",
            "score": 44,
            "last_activity_date": 1313803431,
            "creation_date": 1287159788,
            "body": "A clarification to the question indicates that methods of resampling a raster are sought.  Many are in use in imaging and photographic communities.  For GIS work, though, several straightforward methods are in common use:\n\n\nNearest-neighbor resampling.  Each cell in the new raster is assigned the value of the nearest cell (center to center) in the original raster.  Use this for categorical data like land use and other classifications.\nBilinear interpolation.  Each cell in the new raster is assigned an average based on the four nearest original cells.  The averaging is linear in the horizontal and vertical directions.  (The resulting formula, though, is not linear; it&#39;s actually quadratic.)  This is good for general-purpose smoothing but the averaging that goes on typically clips local peaks and valleys a bit.\nCubic convolution.  This is similar in spirit to bilinear interpolation but can slightly extrapolate values from nearby cells.  It does so in a way intended to reproduce local averages and variability in the new grid; in particular, the clipping of local extrema should not be as severe.  (One untoward consequence, evident as a bug in ESRI&#39;s ArcGIS, is that the values in the new grid may extend beyond the range of the old one, causing some of the new extremes not to be rendered correctly.  But this is a matter of data display only.)  The tradeoff is that cubic convolution takes a little more time to compute than bilinear interpolation.\n\n\nI discuss the latter two methods in some detail at http://www.quantdec.com/SYSEN597/GTKAV/section9/map_algebra.htm\n\nFor quick one-off calculations I am usually content to perform bilinear interpolation (for continuous data) or nearest-neighbor interpolation (for categorical data).  For all others, especially when preparing master datasets or when anticipating extensive manipulations, I recommend using cubic convolution (as well as giving some thought to ordering the operations to minimize propagation of floating point error).\n",
            "excerpt": "For <span class=\"highlight\">GIS</span> work, though, several straightforward methods are in common use:\n\n\nNearest-neighbor resampling. &hellip; ",
            "title": "Deciding what interpolation method to use for resampling raster data?"
        },
        {
            "tags": [
                "research"
            ],
            "question_score": 44,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 12,
            "is_answered": true,
            "question_id": 64791,
            "item_type": "question",
            "score": 44,
            "last_activity_date": 1517331067,
            "creation_date": 1372510592,
            "body": "In many fields, such as computer sciences, it seems to be quite clear which conferences are top tier and how a paper accepted to those conferences compares to journal publications in the same field.\n\nIs there a general agreement in GIScience about which conferences are considered top tier? And how do publications at those conferences compare to papers in, e.g. Transactions in GIS or the International Journal of Geographical Information Science?\n",
            "excerpt": "Transactions in <span class=\"highlight\">GIS</span> or the International Journal of Geographical Information Science? &hellip; ",
            "title": "Seeking top tier conference in GIScience?"
        },
        {
            "tags": [
                "career"
            ],
            "question_score": 44,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 16,
            "is_answered": true,
            "question_id": 6099,
            "item_type": "question",
            "score": 44,
            "last_activity_date": 1452225771,
            "creation_date": 1297568533,
            "body": "What are some suitable interview questions to ask candidates for a GIS Analyst position?\n\nI am looking for techniques for interviewing analysts at varied experience levels (we are currently looking at hiring for entry and senior-level positions).  \n\nIn the past, I&#39;ve asked questions about their most recent projects and what sites/newsletters they use to keep up with the industry.\n",
            "excerpt": "What are some suitable interview questions to ask candidates for a <span class=\"highlight\">GIS</span> Analyst position? &hellip; ",
            "title": "Interview questions for hiring GIS Analyst?"
        },
        {
            "tags": [
                "open-source-gis",
                "software-recommendations",
                "free-software"
            ],
            "question_score": 142,
            "is_accepted": false,
            "answer_id": 12161,
            "is_answered": false,
            "question_id": 12105,
            "item_type": "answer",
            "score": 44,
            "last_activity_date": 1382701852,
            "creation_date": 1310585660,
            "body": "ColorBrewer is a great freebie for anyone who is publishing maps. Even though it&#39;s not an installed program, it&#39;s a powerful tool for picking effective color schemes, and downloads are available for various GIS software (see links below). There is even a new JavaScript version for those who can&#39;t or don&#39;t want to use Flash.\n\nColorBrewer allows you to pick effective, attractive color schemes based on number of classes, data types (e.g. sequential or qualitative), and many optional parameters. It also allows you to preview the color scheme with common features such as roads and city names, and export the scheme for (relatively) easy use in your software or code.\n\nColorBrewer&#39;s ramps can be installed to QGIS and ArcMap through symbol packages and add-ins.\n",
            "excerpt": "Even though it&#39;s not an installed program, it&#39;s a powerful tool for picking effective color schemes, and downloads are available for various <span class=\"highlight\">GIS</span> software (see links below). &hellip; ",
            "title": "What free programs should every GIS user have installed?"
        },
        {
            "tags": [
                "references"
            ],
            "question_score": 76,
            "is_accepted": true,
            "answer_id": 585,
            "is_answered": false,
            "question_id": 202,
            "item_type": "answer",
            "score": 43,
            "last_activity_date": 1600938535,
            "creation_date": 1280543204,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\nNot entirely a GIS Book but very helpful in many map design problems is Tufte&#39;s The Visual Display of Quantitative Information\n\n\nPostGIS In Action by Regina Obe and Leo Hsu   http://www.manning.com/obe/\n\nAn excellent tutorial and resource on spatial databases in general and PostGIS in particular.  The book is currently available through Manning&#39;s Early Access Program in .pdf format, the paper version will be out relatively soon.\n\nGeospatial Analysis: A Comprehensive Guide to Principles, Techniques, and Software Tools\nSmith, Goodchild, Longley 2007\nEntire text is online: http://www.spatialanalysisonline.com/\n\nA solid guide to how geospatial analysis work, particularly with respect to GIS. The book emphasizes conceptual workflows, but still provides the basic math. I found the math quite helpful for creating my own code and also getting an understanding of what&#39;s happening under the hood in contemporary GIS.\n\nComputational Geometry: Algorithms and Applications\n\nThe best computational geometry book. Very good at explaining (with illustrations) the various algorithms and concepts often used in GIS, such as triangulation, indexing, calculating intersection, shortest paths etc.\n\nMap Projections: A Working Manual\n(PDF, 380pages) by John P. Snyder\n\n",
            "excerpt": "I found the math quite helpful for creating my own code and also getting an understanding of what&#39;s happening under the hood in contemporary <span class=\"highlight\">GIS</span>. &hellip; Very good at explaining (with illustrations) the various algorithms and concepts often used in <span class=\"highlight\">GIS</span>, such as triangulation, indexing, calculating intersection, shortest paths etc. &hellip; ",
            "title": "What books, journals, and electronic resources are most valuable for expanding knowledge of GIS?"
        },
        {
            "tags": [
                "arcgis-desktop"
            ],
            "question_score": 42,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 18,
            "is_answered": true,
            "question_id": 6671,
            "item_type": "question",
            "score": 42,
            "last_activity_date": 1403617035,
            "creation_date": 1299058270,
            "body": "I&#39;m new to GIS, having only dabbled with ArcGIS for Desktop for about 4 weeks in 2007. The business I am at wants to target writing complete solutions that involve GIS as it would benefit their hardware sales. They do not know which market they want to target but want me to pick the GIS software to use, yet I am very green to GIS markets. All i know if target platforms are windows, windows mobile, android and web applications. The idea of mobile applications means data connection is not 100% so internet based services may need to be ruled out, i.e. GoogleMaps.\n\nI was struggling to work out how to phrase this as a question, given the huge range of GIS products available, Esri&#39;s ArcGIS for Desktop, CadCorp, MapInfo, GoogleMap/Earth, qGIS, Manifold, openJump, openstreetmap etc.\n\nTo avoid the what do I buy question, I instead ask the question why do you use Esri ArcGIS. From my experience its slow to navigate around maps and quite verbose to program in causing quite a lead time in development. Esri is also the most expensive product on the market, and i believe also the most popular. But why do people continue to use it, when other systems like CadCorp have the same functionality if not more, seem to be more responsive, can import Esri data and cost less.\n\nI feel that I must be overlooking something here. I know client demands in some industries like defense, want Esri but why is it still so popular, given I often hear how other products are betters (Is this a Windows vs. Mac example on market share vs. quality)\n\nP.s. This question has been spawned from this one on StackOverflow. \n",
            "excerpt": "I&#39;m new to <span class=\"highlight\">GIS</span>, having only dabbled with ArcGIS for Desktop for about 4 weeks in 2007. &hellip; They do not know which market they want to target but want me to pick the <span class=\"highlight\">GIS</span> software to use, yet I am very green to <span class=\"highlight\">GIS</span> markets. &hellip; ",
            "title": "Why do you use ArcGIS for Desktop?"
        },
        {
            "tags": [
                "polygon",
                "analysis",
                "sampling"
            ],
            "question_score": 57,
            "is_accepted": true,
            "answer_id": 82370,
            "is_answered": false,
            "question_id": 82362,
            "item_type": "answer",
            "score": 42,
            "last_activity_date": 1459977736,
            "creation_date": 1389217071,
            "body": "The idea with hexagons is to reduce sampling bias from edge effects of the grid shape, which is related to high perimeter:area ratios.  A circle is the lowest ratio, but cannot form a continuous grid, and hexagons are the closest shape to a circle that can still form a grid.\nAlso, if you are working over a larger area, a square grid will suffer more from distortion due to curvature than shapes like hexagons.\n\nThere are a number of tools and extensions for creating and using hex grids for ecological/landscape analysis, Patch analyst (Rempel et al., 2003) being a good example, that also provides a large volume of landscape metric measurement capacity. The former Hawth&#39;s Tools, now redesigned as the Geospatial Modeling Environment has a wide array of tools that were developed to fill in gaps in arcgis functionality, including repeating grids.\nA number of third-party extensions have been made for this sort of thing, usually by the researchers who need them, so they frequently don&#39;t have the resources to rebuild their products after every new GIS version is released, so it often seems like there is nothing available\n\nThis paper (Birch, 2007) also presents a thorough comparison of rectangular and hexagonal grids for ecological applications, showing how hexagonal grids are preferable when issues of connectivity, nearest neighbourhood or movement paths are crucial aspects to be considered in the analysis.\n",
            "excerpt": "number of third-party extensions have been made for this sort of thing, usually by the researchers who need them, so they frequently don&#39;t have the resources to rebuild their products after every new <span class=\"highlight\">GIS</span> &hellip; ",
            "title": "What are the benefits of hexagonal sampling polygons?"
        },
        {
            "tags": [
                "python",
                "raster",
                "gdal",
                "numpy"
            ],
            "question_score": 42,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 37238,
            "item_type": "question",
            "score": 42,
            "last_activity_date": 1695066205,
            "creation_date": 1350875256,
            "body": "I&#39;m new to GIS.\n\nI have some code that converts infrared images of Mars into thermal inertia maps, which are then stored as 2D numpy arrays. I&#39;ve been saving these maps as hdf5 files but I&#39;d really like to save them as raster images so that I can process them in QGIS. I&#39;ve gone through multiple searches to find how to do this but with no luck. I&#39;ve tried following the instructions in the tutorial at http://www.gis.usu.edu/~chrisg/python/ but the files I produce using his example code open as plain grey boxes when I import them to QGIS. I feel like if someone could suggest the simplest possible procedure to a simplified example of what I&#39;d like to do then I might be able to make some progress. I have QGIS and GDAL, I&#39;d be very happy to install other frameworks that anyone could recommend. I use Mac OS 10.7.\n\nSo if for example I have a numpy array of thermal inertia that looks like:\n\n\n\nAnd for each pixel I have the latitude and longitude:\n\n\n\nWhich procedure would people recommend to convert this data into a raster file that I can open in QGIS?\n",
            "excerpt": "I&#39;m new to <span class=\"highlight\">GIS</span>.\n\nI have some code that converts infrared images of Mars into thermal inertia maps, which are then stored as 2D numpy arrays. &hellip; ",
            "title": "Writing numpy array to raster file"
        },
        {
            "tags": [
                "career"
            ],
            "question_score": 44,
            "is_accepted": true,
            "answer_id": 6124,
            "is_answered": false,
            "question_id": 6099,
            "item_type": "answer",
            "score": 41,
            "last_activity_date": 1297702523,
            "creation_date": 1297675586,
            "body": "How do you handle boring repetitive tasks?\n\nIf the answer doesn&#39;t mention scripting or automating then you should be wary. Candidates should have come across a scripting language or macros at some point in a GIS course. \n\nWhat database experience do you have?\n\nMany GIS analysts become responsible for geodatabases - whether or not they wish to or are suitable. Any experience with creating databases, primary keys, SQL, foreign keys etc. is going to be a big plus point. \n\nWhat are the differences between raster and vector data?\n\nI&#39;d consider this the fizzbuzz test of GIS. \n",
            "excerpt": "Many <span class=\"highlight\">GIS</span> analysts become responsible for geodatabases - whether or not they wish to or are suitable. &hellip; I&#39;d consider this the fizzbuzz test of <span class=\"highlight\">GIS</span>. &hellip; ",
            "title": "Interview questions for hiring GIS Analyst?"
        },
        {
            "tags": [
                "cartography",
                "visualisation"
            ],
            "question_score": 41,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 15,
            "is_answered": true,
            "question_id": 9986,
            "item_type": "question",
            "score": 41,
            "last_activity_date": 1667138604,
            "creation_date": 1305832760,
            "body": "Besides being a GIS user I&#39;m a big computer game fan.  \n\nGames like Civilization, Minecraft, World at War and many others have a very powerful engine to display huge maps in a beautiful way. \n\nIs it possible to use a game engine to display GIS data for a better comprehension or visualization of the environment? \n",
            "excerpt": "Besides being a <span class=\"highlight\">GIS</span> user I&#39;m a big computer game fan.  \n\nGames like Civilization, Minecraft, World at War and many others have a very powerful engine to display huge maps in a beautiful way. &hellip; Is it possible to use a game engine to display <span class=\"highlight\">GIS</span> data for a better comprehension or visualization of the environment? &hellip; ",
            "title": "Using Computer Games to display GIS data?"
        },
        {
            "tags": [
                "web-mapping",
                "references"
            ],
            "question_score": 83,
            "is_accepted": false,
            "answer_id": 55439,
            "is_answered": false,
            "question_id": 8113,
            "item_type": "answer",
            "score": 41,
            "last_activity_date": 1364271556,
            "creation_date": 1364270560,
            "body": "There are so many options out there and many great answers already. Two of my favorite choices that haven&#39;t already been listed here are CartoDB and MapBox. Both of these provide web based hosting and visualization of data and some very fancy tools with prices starting at FREE. \n\nYou&#39;ll benefit from having desktop software to get your data setup. ArcMap and Quantum GIS are both great choices for the desktop part. \n\nI&#39;d say the strength of MapBox is making beautiful web maps with really great, easy to use templates and ready to go user interface elements. MapBox requires a desktop program called TileMill (also free) which makes use of a styling interface very similar to CSS. \n\nThe strength of CartoDB is that it exposes its PostGIS roots through an SQL API. \n\nBoth of these can be used on their own or in combination with other javascript mapping libraries (e.g. Leaflet, Google Maps, OpenLayers).\n\nNo matter which platforms you decide to start using to get into web mapping, you will most certainly benefit from learning some javascript.  Codecademy is a great place to start (also FREE!!).\n",
            "excerpt": "ArcMap and Quantum <span class=\"highlight\">GIS</span> are both great choices for the desktop part. &hellip; ",
            "title": "How to Start Web Mapping?"
        },
        {
            "tags": [
                "gdal",
                "geotiff-tiff",
                "compression"
            ],
            "question_score": 69,
            "is_accepted": false,
            "answer_id": 14196,
            "is_answered": false,
            "question_id": 1104,
            "item_type": "answer",
            "score": 41,
            "last_activity_date": 1429553234,
            "creation_date": 1314835652,
            "body": "With  and  compression using  can help with imagery that is smoothly varying as it compresses the differences from pixel to pixel instead of the absolute values, and these will tend to be small and have more patterns (ref). Predictor is only useful with  and  compression, the option has no effect with other methods. \n\n\n\nThe predictor savings can be dramatic. I just re-compressed a directory of 16bit geotiff elevation models using up 17GB with the default LZW settings into just 5GB with predictor=2.\n\nThere is conflicting info on the differences between predictors 2 &amp; 3 and when each is best applied (ref1, ref2). Perhaps fuel for another question. \n\nAnother easy option for savings is . There are some software which can&#39;t read tiled images, but those are becoming rarer and mostly outside of GIS (I don&#39;t know of any main stream GIS software now that doesn&#39;t read them).\n\nTo build on @alfonx&#39;s answer of using compressed overviews: This allows the base image to be stored lossless, for data integrity, and the pyramids to be lossy, for speed and some space savings. It&#39;s almost the best of both worlds. For the smallest possible overviews with  on RGB images: use jpeg compression, averaged or gaussian resampling instead of the default nearest neighbour (makes the overviews smoother), and YCBCR photometric overview. See the gdaladdo reference page for more info on these options (though it doesn&#39;t say much about what photometric is all about).\n\nThis is part of a windows batch file I use to apply external jpeg overviews to all tiffs in a directory:\n\n\n\nNotes \n\nGDAL 1.6.0 introduced  resampling which can lead to better results  in case of sharp edges with high contrast or noisy patterns. Powers of 2 levels (2 4 8 ...) should be used so a 3x3 resampling Gaussian kernel is selected.\n\n - if not specified the default of 75% is used, which does yield smaller file, but I find 85% a better compromise in the size vs quality trade off.\n\nUpdate, 2015: GDAL 1.8 and 2.0 have introduced a lot of new options not covered here and which I haven&#39;t had time to digest. Read the official gtiff format page, I&#39;m sure there are additional useful settings detailed.\n",
            "excerpt": "There are some software which can&#39;t read tiled images, but those are becoming rarer and mostly outside of <span class=\"highlight\">GIS</span> (I don&#39;t know of any main stream <span class=\"highlight\">GIS</span> software now that doesn&#39;t read them). &hellip; ",
            "title": "Should GDAL be set to produce GeoTIFF files with compression? Which algorithm should be used?"
        },
        {
            "tags": [
                "openstreetmap",
                "visualisation",
                "rendering",
                "map-drawing"
            ],
            "question_score": 41,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 12,
            "is_answered": true,
            "question_id": 452,
            "item_type": "question",
            "score": 41,
            "last_activity_date": 1715524364,
            "creation_date": 1280437545,
            "body": "I would like to be able to use openstreetmap data for a specific region as a source and &quot;draw&quot; from that the map of infrastructure improvements - mostly roads. \n\nI want it to be self-hosted (not spoiling any data on the real OSM servers), want to have quite big flexibility and detail level in the editing process and it would be nice to render it in a pretty way.\n\nI&#39;m not familiar with lots of GIS software. Actually it&#39;s not that important to have OSM data as the source, it could be a satellite image as well. The important things - flexible drawing bound to real coordinates and visualization of the map. \n\nWhere could I start?\n\nHope this question makes sense here :)\n",
            "excerpt": "I&#39;m not familiar with lots of <span class=\"highlight\">GIS</span> software. Actually it&#39;s not that important to have OSM data as the source, it could be a satellite image as well. &hellip; ",
            "title": "How would I draw and visualize custom maps based on OSM data?"
        },
        {
            "tags": [
                "python",
                "software-recommendations"
            ],
            "question_score": 31,
            "is_accepted": true,
            "answer_id": 23581,
            "is_answered": false,
            "question_id": 23575,
            "item_type": "answer",
            "score": 40,
            "last_activity_date": 1670612429,
            "creation_date": 1334613394,
            "body": "\nNumPy: NumPy is the fundamental package for scientific computing with Python. It contains among other things:\n\na powerful N-dimensional array object\nsophisticated (broadcasting) functions\ntools for integrating C/C++ and Fortran code\nuseful linear algebra, Fourier transform, and random number capabilities\n\nBesides its obvious scientific uses, NumPy can also be used as an efficient multi-dimensional container of generic data. Arbitrary data-types can be defined. This allows NumPy to seamlessly and speedily integrate with a wide variety of databases.\n\nSciPy: SciPy (pronounced &quot;Sigh Pie&quot;) is open-source software for mathematics, science, and engineering. It is also the name of a very popular conference on scientific programming with Python. The SciPy library depends on NumPy, which provides convenient and fast N-dimensional array manipulation. The SciPy library is built to work with NumPy arrays, and provides many user-friendly and efficient numerical routines such as routines for numerical integration and optimization. Together, they run on all popular operating systems, are quick to install, and are free of charge. NumPy and SciPy are easy to use, but powerful enough to be depended upon by some of the world&#39;s leading scientists and engineers. If you need to manipulate numbers on a computer and display or publish the results, give SciPy a try!\n\nShapely: Shapely is a BSD-licensed Python package for manipulation and analysis of planar geometric objects. It is based on the widely deployed GEOS (the engine of PostGIS) and JTS (from which GEOS is ported) libraries. This C dependency is traded for the ability to execute with blazing speed. Shapely is not concerned with data formats or coordinate systems, but can be readily integrated with packages that are.\n\nGDAL Python bindings: This Python package and extensions are a number of tools for programming and manipulating the GDAL Geospatial Data Abstraction Library.\n\nGeoDjango: GeoDjango intends to be a world-class geographic Web framework. Its goal is to make it as easy as possible to build GIS Web applications and harness the power of spatially enabled data.\n\nPyProj\n\nSpatialPython: Nicely documented github repository.\n\n\n",
            "excerpt": "Its goal is to make it as easy as possible to build <span class=\"highlight\">GIS</span> Web applications and harness the power of spatially enabled data.\n\nPyProj\n\nSpatialPython: Nicely documented github repository. &hellip; ",
            "title": "Seeking Python tools/modules/add-ins for GIS?"
        },
        {
            "tags": [
                "topology",
                "gis-principle",
                "multipart",
                "datastructure",
                "data-storage"
            ],
            "question_score": 31,
            "is_accepted": true,
            "answer_id": 3707,
            "is_answered": false,
            "question_id": 3705,
            "item_type": "answer",
            "score": 39,
            "last_activity_date": 1290375823,
            "creation_date": 1290375823,
            "body": "If your software doesn&#39;t support multi-part features you may have to go to extraordinary and complicated lengths to execute spatial operations.  For example, the intersection of two polygons can, in general, have more than one connected component.  It is convenient, both algorithmically and conceptually, to suppose that such an intersection returns a single object (a multipart polygon) rather than an arbitrary number of polygons.  (For the same reasons it is helpful to support various forms of null and degenerate features--for example, polygons having an extent but zero area or even polygons with locations but neither extent nor area.  These things can arise from geometric operations; supporting them eliminates a lot of fussy case-by-case post-processing and can prevent useful information from disappearing.)\n\nFrom a relational database point of view, multipart features make normalization possible: when an attribute is inseparable from a collection of polygons, you want to represent that collection as a single object.  A good example would be a feature representing almost any country in the world having a coastline, because the country probably includes some islands.  Do you really want to force your RDBMS to make one copy of the country&#39;s attributes for every little island?  Most likely not.  You don&#39;t even want (or need) to maintain multiple copies of a pointer to the attributes, either.\n\nHow would you represent a network or a branching tree if not as a coordinated multi-polyline?\n\nFrom the point of view of mathematics or algorithmic data structures, allowing a multipart feature is a simplification, not a complication.  In order to support multiply connected polygons (rings and polygons with &quot;holes&quot;) you already need the apparatus for representing multi-part polygons.\n\nFinally, &quot;vector&quot; objects and their typical &quot;spaghetti representation&quot; have their origin in the theory of simplicial complexes.  (It is only through this somewhat tenuous connection to the theory of topology that the term &quot;topology&quot; made it into GIS, which otherwise uses essentially nothing from that theory.)  That theory requires, and benefits from, multi-part features.  In fact, having just a single component is not part of the definition of a simplicial complex, but rather turns out to be a special property enjoyed by some of them (as detected by the rank of their zeroth homology group).  As such, &quot;single part&quot; is not a defining property, but is just a topological quality in the same sense that having a ring or a &quot;hole&quot; in a polygon is a topological quality (related to the rank of the first homology group).\n",
            "excerpt": "(It is only through this somewhat tenuous connection to the theory of topology that the term &quot;topology&quot; made it into <span class=\"highlight\">GIS</span>, which otherwise uses essentially nothing from that theory.) &hellip; ",
            "title": "Benefits of Multipart Features?"
        },
        {
            "tags": [
                "career",
                "freelancing"
            ],
            "question_score": 52,
            "is_accepted": true,
            "answer_id": 103995,
            "is_answered": false,
            "question_id": 103990,
            "item_type": "answer",
            "score": 39,
            "last_activity_date": 1404368813,
            "creation_date": 1404330858,
            "body": "Firstly - this is an excellent question (+1).  As a freelancer, I wish I had had this information when I started out!\n\nSecondly - YIKES! Translating that rate into sterling is frightening.  GIS professionals must be ten a penny in the US is all I can say if that it the limit of your earning expectations.\n\nThird (and a more serious commentary expanding on Conor&#39;s answer) - The answer to your question depends a lot on the sector in which you are applying your GIS skills.  This is first and foremost the deciding factor.  If I was working in the oil industry I would be charging double what I am at the moment (but GIS for the oil industry is a little bit specialized and some of the skills very niche e.g. bespoke geological software skills required rather than just ArcGIS or what have you).  \n\nI set my rate initially by taking my (then) annual salary (gross of tax to allow for some corporate tax and sundries as very roughly equivalent to my income tax and UK National Insurnce) and divided by 200 to give me a day rate.  I used 200 because I used to work in a commercial GIS group where there was a concept of &#39;200 chargeable days&#39; - the remaining 165 days being taken up by weekends, sick leave, holidays, personal development, business development (including website maintenance), computer maintenance etc.  This was a formula which worked well in my experience.  For an hourly rate I divided the day rate by 7 because:\n\n\nI am a highly qualified and experienced professional and well worth it\nDuring a normal working day you take time out for lunch, making coffee, going to the toilet, answering the phone and so on - as a freelancer you must allow for this.\n\n\nUsing this simple calculation you can work out what you personally must charge to maintain your current standard of living.  Anything less would represent an unacceptable drop in salary and mean it is not worth going freelance.\n\nThe aim of going freelance is to get flexibility, self determination, personal satisfaction and because you have noticed how your current employer is benefiting from your skills and you would like a cut of that money.  The above calculation is just a baseline and to improve on it, you can put your prices up and you work harder once you get a feel for the market.  However, this method of calculating your hourly rate will reflect the market you personally work in and the level at which you are working (as Conor says, it depends on whether you are a junior technician or doing advanced spatial analysis for instance).\n\nADDITIONAL COMMENT:\nI should add that, after all the talk about a minimum acceptable rate, it isn&#39;t just about the money.  As a freelancer I personally have gained a lot more job satisfaction and can meet my clients&#39; needs without all the bureaucracy of a large organisation getting in the way.  I am also a lot more hands-on, which I enjoy and which I was losing with increasing seniority in a traditional employed role.  This sense of satisfaction and achievement are worth a lot and can&#39;t be expressed in a simple monetary rate.  This is the hidden bonus (though I grant you, you can&#39;t eat it and it doesn&#39;t pay the mortgage).\n",
            "excerpt": "<span class=\"highlight\">GIS</span> professionals must be ten a penny in the US is all I can say if that it the limit of your earning expectations. &hellip; Third (and a more serious commentary expanding on Conor&#39;s answer) - The answer to your question depends a lot on the sector in which you are applying your <span class=\"highlight\">GIS</span> skills. &hellip; ",
            "title": "What is the going rate for GIS freelancers?"
        },
        {
            "tags": [
                "gdal",
                "dem",
                "gdal-translate",
                "hillshade",
                "gdal-calc"
            ],
            "question_score": 39,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 144535,
            "item_type": "question",
            "score": 39,
            "last_activity_date": 1721957632,
            "creation_date": 1430330807,
            "body": "I get elegant transparent hillshades via a combination  and . Compare to grey-based hillshade commonly used, such transparent hillshades are very cool because they can be placed between the map background and other upper layers (roads, buiding) to provide a 3D feels whatever the background&#39;s type and color. \n\n\nHow it works\n\nThe trick: Starting with a grey scale hillshade produced by , the trick is to take the grey channel&#39;s values, invert each value, and flow this result into a new opacity channel. Black pixel [0,0,0] become [0,0,0,255] (opacity=255), grey pixel [120,120,120] get lower becoming  [120,120,120,135] (opacity=135, aka 255-120), white pixel [255,255,255] become transparent [255,255,255,0] (opacity=0, aka 255-255) and so on. Hills&#39; shades are opaque and black, plains progressively become (white) transparent. Conceptually, the pixel&#39;s band equation is something such :\n\n\n\nFor a laid back video on this approach, explained by a Photoshop designer, see Adding Shaded Relief in Photoshop (16mins).\n\nQuestion\n\nTaking an ETOPO or SRTM derived grey-based hillshade (, file available to download here) as input...\n\n...How to do the trick cited upper via gdal or an other non GIS-destructive way on such .tif files ?\n\nNote that I wish to keep GIS properties (geolocalisation).\n\n\n\n",
            "excerpt": "hillshade crop_xl.tmp.tif shadedrelief.tmp.tif -s 111120 -z 5 -az 315 -alt 60 -compute_edges, file available to download here) as input...\n\n...How to do the trick cited upper via gdal or an other non <span class=\"highlight\">GIS</span>-destructive &hellip; Note that I wish to keep <span class=\"highlight\">GIS</span> properties (geolocalisation). &hellip; ",
            "title": "Creating transparent hillshade?"
        },
        {
            "tags": [
                "r",
                "vector-grid",
                "point-in-polygon"
            ],
            "question_score": 38,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 88830,
            "item_type": "question",
            "score": 38,
            "last_activity_date": 1573474018,
            "creation_date": 1394143368,
            "body": "How can one use R to \n\n\nsplit a shapefile in 200 meter squares/sub-polygons, \nplot this grid (incl. ID numbers for each square) over the original map below, and \nevaluate in which square specific geographic coordinates are located.\n\n\nI am a beginner in GIS and this is perhaps a basic question, but I haven&#39;t found a tutorial on how to do this in R. \n\nWhat I have done so far is loading a shapefile of NYC and plotting some exemplary geographic coordinates.\n\nI am looking for an example (R code) how to this with the data below. \n\n\n\n\n",
            "excerpt": "I am a beginner in <span class=\"highlight\">GIS</span> and this is perhaps a basic question, but I haven&#39;t found a tutorial on how to do this in R. &hellip; ",
            "title": "Overlaying spatial polygon with grid and checking in which grid element specific coordinates are located using R"
        },
        {
            "tags": [
                "web-mapping",
                "references"
            ],
            "question_score": 83,
            "is_accepted": false,
            "answer_id": 8116,
            "is_answered": false,
            "question_id": 8113,
            "item_type": "answer",
            "score": 38,
            "last_activity_date": 1499268132,
            "creation_date": 1301951381,
            "body": "I also just attended a conference where they presented the OpenGeo Suite, which is a stack of OpenLayers, GeoServer, GeoExt &amp; PostGIS.  They offer both the &quot;Enterprise Edition&quot; (paid for version with support) or the &quot;Community Edition&quot; (free) versions.\n(Update) OpenGeo Suite is now Boundless Suite.\n\nAnother package that was demonstrated at the conference was GeoMoose, which is a stack of MapServer and OpenLayers.\n\nYou might consider downloading the OSGEO Live DVD, which you can run in a virtual machine environment in case you don&#39;t want to install a bunch of stuff on your machine while testing it out.  It comes pre-packaged with a bunch of different open source GIS software packages, including web mapping tools.\n",
            "excerpt": "It comes pre-packaged with a bunch of different open source <span class=\"highlight\">GIS</span> software packages, including web mapping tools. &hellip; ",
            "title": "How to Start Web Mapping?"
        },
        {
            "tags": [
                "openstreetmap",
                "google-maps",
                "crowdsourcing"
            ],
            "question_score": 31,
            "is_accepted": false,
            "answer_id": 24828,
            "is_answered": false,
            "question_id": 24820,
            "item_type": "answer",
            "score": 37,
            "last_activity_date": 1573304731,
            "creation_date": 1336193580,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\nOf course it is ultimately up to you, but i would hesitate to call working with OpenStreetMap a waste of time.\n\nWhile it is true that the OSM user base is small right now, there are factors that affect both Google and OSM. The primary issue is that now that Google has started to charge for levels of use of their API, a number of companies and organizations are switching to OSM. The list includes Apple, Foursquare, and Wikipedia mobile apps. It looks like more may switch as well, which could increase the user base significantly.\nThis is one aspect.\n\nThe other, and that which seems more important to me is the idea of open access to data. As a Geographer and GIS professional, having access to high quality datasets is critical for me to do my job. Having access that can not be compromised is even more important. The OSM dataset is licensed as Open Data Commons Open Database License, so anyone may use it. Google data is privately owned and while this likely won&#39;t happen, they could close it off tomorrow and charge everyone for access, whether you helped improve the dataset or not.\n\nI know that here in the United States access to data is a big issue.  A lot of time and money is spent collecting and building the datasets, and a big question is who should pick up this cost.  There are arguments either way.  I am sure this is an issue in other parts of the world as well, especially in places where there are not as many sources of data like streets available for people to use.\n\nThis is a pretty hot topic you picked here, with strong, valid feelings on both sides.  Google has every right to charge for their data, and make a profit.  People have the same right to build their own dataset and make it available to everyone. There is nothing to say you can&#39;t support both, just don&#39;t sell one short over the other without researching on your own, and drawing your own conclusions.\n",
            "excerpt": "As a Geographer and <span class=\"highlight\">GIS</span> professional, having access to high quality datasets is critical for me to do my job. Having access that can not be compromised is even more important. &hellip; ",
            "title": "Donating and volunteering geographical knowledge?"
        },
        {
            "tags": [
                "qgis",
                "qgis-plugins"
            ],
            "question_score": 25,
            "is_accepted": true,
            "answer_id": 209131,
            "is_answered": false,
            "question_id": 209129,
            "item_type": "answer",
            "score": 37,
            "last_activity_date": 1575550764,
            "creation_date": 1472700464,
            "body": "Hidden feature that I never made a UI for\n\n\n\nRun it in the Python console\n\nAlso see the plugin called Plugin Load Times: (https://gitlab.com/GIS-projects/Plugin-Load-Times)\n",
            "excerpt": "Hidden feature that I never made a UI for\n\nimport pprint\npprint.pprint(qgis.utils.plugin_times)\n\n\nRun it in the Python console\n\nAlso see the plugin called Plugin Load Times: (https://gitlab.com/<span class=\"highlight\">GIS</span>-projects &hellip; ",
            "title": "How to tell which QGIS plugins are slow to load?"
        },
        {
            "tags": [
                "postgis",
                "coordinate-system",
                "spatial-database"
            ],
            "question_score": 37,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 2459,
            "item_type": "question",
            "score": 37,
            "last_activity_date": 1604187875,
            "creation_date": 1286604111,
            "body": "I am doing an astronomy project. I want to have the information about our images stored in a spatially enabled database. This, I would think, should be a very easy special case for GIS functions because the sky can be treated as perfectly spherical, and does not require an elliptical treatment like the surface of the earth. Unfortunately, I have not found a way to do this yet and I have been dodging mines with spatial functions that use an elliptical earth. (Pretty much any function that returns meters instead of degrees may be using an elliptical calculation. Luckily, many of the PostGIS functions I&#39;ve needed appear to have incomplete implementations where the documentation explicitly states that the returned results are for a sphere and not for the ellipsoid. But that may change with future versions, which is a cause for concern.)\nBackground: I am presently using PostgreSQL with PostGIS and WGS 84 coordinates (SRID=4326). This works fairly well. I am creating a closed POLYGON from the right ascension and declination of the four corners of the image. I have a lot of images (10k or more), covering a large area of the sky. Each images is about 1 degree square. From the set of these images, I am making mosaics from small subsets of 15 to 30 images. Each mosaic is about 1.5 degree square.\nPresently, I am storing the geography of the mosaics as a MULTIPOLYGON that consists of all the POLYGONS corresponding to each image that went into the mosaic. [A better solution would be to create a single POLYGON that describes the perimeter of the union of all the individual polygons. I don&#39;t know if this can be done in spherical coordinates (i.e., that the geography type). This would also be an interesting answer for me too.] The date line and celestial poles may be included in an image in the dataset so I have been avoiding projecting to planar coordinates to the extent possible.\nWhat coordinate system ought I use for celestial coordinates with PostGIS functions?\nI have looked at  http://spatialreference.org/ but have not found anything so far. Google has turned up little. I am stumped. Basically, I want to ensure that if a function returns meters as a distance, it is meters along a great circle on a sphere.\n\nI am using PostGIS 1.5.2. I have not yet tried PostGIS 2.0. I am curious if the ST_CoveredBy function works with a POLYGON and a MULTIPOLYGON of type geography. If anybody is running 2.0, could you tell me if you get the same error as this:\n\n\nI have tried PostGIS 2.0. This function still only works on points and polygons, not more general shapes.\n",
            "excerpt": "This, I would think, should be a very easy special case for <span class=\"highlight\">GIS</span> functions because the sky can be treated as perfectly spherical, and does not require an elliptical treatment like the surface of the earth &hellip; ",
            "title": "Choosing coordinate system to store geography data for celestial coordinates"
        },
        {
            "tags": [
                "qgis",
                "shapefile",
                "convert",
                "gpx"
            ],
            "question_score": 37,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 40731,
            "item_type": "question",
            "score": 37,
            "last_activity_date": 1700908184,
            "creation_date": 1352469184,
            "body": "I would like to convert .shp into .gpx. \n\nUsing GIS, I open my shapefile and I tried to &quot;save as&quot; gpx but it gives an OGR error: \n\n\n  creation of field ObjectId failed (OGR error: Field of name &#39;ObjectId&#39;\n  is not supported in GPX schema. Use GPX_USE_EXTENSIONS creation option\n  to allow use of the  element).\n\n\nHow can I fix this error?\n",
            "excerpt": "Using <span class=\"highlight\">GIS</span>, I open my shapefile and I tried to &quot;save as&quot; gpx but it gives an OGR error: \n\n\n  creation of field ObjectId failed (OGR error: Field of name &#39;ObjectId&#39;\n  is not supported in GPX schema. &hellip; ",
            "title": "Converting .shp into .gpx using QGIS"
        },
        {
            "tags": [
                "qgis",
                "convert",
                "mxd",
                "qgs"
            ],
            "question_score": 50,
            "is_accepted": false,
            "answer_id": 23718,
            "is_answered": false,
            "question_id": 23717,
            "item_type": "answer",
            "score": 37,
            "last_activity_date": 1503467028,
            "creation_date": 1334757929,
            "body": "This looks like the sort of thing you want:\nhttps://underdark.wordpress.com/2011/05/27/converting-mxd-to-qgis-project-file/\n\n\n  On Wednesday, Allan Maungu announced MXD2QGS, a converter that exports layers from an Arcmap 10 document into a Quantum GIS project file. The tool is built as an ArcToolbox and can be downloaded from the blog.\n\n\nThe only working download link seems to be https://sites.google.com/site/lumtegis/files/Mxd2Qgs.zip\n\nAs of August 2017 this tool also appears to be available at https://github.com/fitnr/mxd2qgs\n\nThere&#39;s also one for doing ArcView 3.x files apparently: http://gix.sourceforge.net/\n",
            "excerpt": "https://underdark.wordpress.com/2011/05/27/converting-mxd-to-qgis-project-file/\n\n\n  On Wednesday, Allan Maungu announced MXD2QGS, a converter that exports layers from an Arcmap 10 document into a Quantum <span class=\"highlight\">GIS</span> &hellip; ",
            "title": "Converting ArcGIS (*.mxd) file to QGIS (*.qgs) file"
        },
        {
            "tags": [
                "qgis",
                "point",
                "coordinates",
                "point-creation"
            ],
            "question_score": 91,
            "is_accepted": false,
            "answer_id": 34209,
            "is_answered": false,
            "question_id": 34204,
            "item_type": "answer",
            "score": 37,
            "last_activity_date": 1450114197,
            "creation_date": 1348568375,
            "body": "Use plugin Numerical Vertex Edit (https://plugins.qgis.org/plugins/numericalVertexEdit/). Or create table with Lat/Lon/Name and save in csv, then load csv table in QGIS (Add Delimited text layer) (info gis-lab.info)\n",
            "excerpt": "Or create table with Lat/Lon/Name and save in csv, then load csv table in QGIS (Add Delimited text layer) (info <span class=\"highlight\">gis</span>-lab.info) &hellip; ",
            "title": "Creating point features with exact coordinates in QGIS"
        },
        {
            "tags": [
                "shapefile",
                "polygon",
                "r"
            ],
            "question_score": 22,
            "is_accepted": true,
            "answer_id": 18313,
            "is_answered": false,
            "question_id": 18311,
            "item_type": "answer",
            "score": 36,
            "last_activity_date": 1325240174,
            "creation_date": 1325240174,
            "body": "First get the coordinates into a 2-column matrix:\n\n\n\nThen create a Polygon, wrap that into a Polygons object, then wrap that into a SpatialPolygons object:\n\n\n\nThe reason for this level of complexity is that a Polygon is a simple ring, a Polygons object can be several rings with an ID (here set to 1) (so is like a single feature in a GIS) and a SpatialPolygons can have a CRS. Ooh, I should probably set it:\n\n\n\nIf you want to turn it into a SpatialPolygonsDataFrame (which is what comes our of readShapeSpatial when the shapefile is polygons) then do:\n\n\n\ngiving this:\n\n\n",
            "excerpt": "SpatialPolygons(list(ps))\n\n\nThe reason for this level of complexity is that a Polygon is a simple ring, a Polygons object can be several rings with an ID (here set to 1) (so is like a single feature in a <span class=\"highlight\">GIS</span> &hellip; ",
            "title": "Instantiating spatial polygon without using a shapefile in R"
        },
        {
            "tags": [
                "career"
            ],
            "question_score": 36,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 19266,
            "item_type": "question",
            "score": 36,
            "last_activity_date": 1656142322,
            "creation_date": 1327499507,
            "body": "How many of you out there work from home?\nWhat kind of company / organization do you work for (private, government, municipal, institution..)?\nHow did you convince your employer it was a good idea?\nWhat are the major drawbacks to working in a GIS position at home?\n",
            "excerpt": "What are the major drawbacks to working in a <span class=\"highlight\">GIS</span> position at home? &hellip; ",
            "title": "GIS professionals working from home"
        },
        {
            "tags": [
                "shapefile",
                "spatialite",
                "file-formats",
                "portable-gis"
            ],
            "question_score": 36,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 69542,
            "item_type": "question",
            "score": 36,
            "last_activity_date": 1520913863,
            "creation_date": 1377261563,
            "body": "I found spatialite more useful than shapefiles as it does not have the limitations of shapefile and it is also portable. Many people here use shapefiles to exchange data and even the experts do not know about this new format.\n\nWhat are the advantages of using spatialite over shapefiles? \n\nCan it be used instead of shapefile? \n\nPlease focus only on those formats which are portable, i.e. can be exchanged using USB sticks. GML, GeoJSON, KML, CSV are not an option and they are not directly editable in GIS.\n\nUPDATE:\nIt has been more than 5 years and the new development is directed towards geopackage which is related to spatialite.\n\nSo now question is more like Advantages of using GEOPACKAGE over GEODATABASE?\n",
            "excerpt": "GML, GeoJSON, KML, CSV are not an option and they are not directly editable in <span class=\"highlight\">GIS</span>. &hellip; ",
            "title": "Advantages of using spatialite over shapefile?"
        },
        {
            "tags": [
                "postgis",
                "mobile",
                "geolocation",
                "mongodb",
                "nosql"
            ],
            "question_score": 36,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 9809,
            "item_type": "question",
            "score": 36,
            "last_activity_date": 1444131538,
            "creation_date": 1305651044,
            "body": "I am working on a web/mobile application based on location data. Since i am already familiar with MongoDB, i found the geospatial indexing of mongo is quite suitable for my needs. As i am mainly dealing with simple/short location points, Mongo 2d indexing is good for me.\n\nAlong the way i picked PostGIS, because of its stable/mature way. And its awesome feature set. But my main concern is performance since my data is heavily dependent on location(mostly 70 - 80% of the db calls deal with the location).\n\nI like mongo because its used by high performance web apps like foursquare already. But i have seen PostGIS is mainly used in government/enterprise projects (mostly non web/mobile apps). So i am little confused right now to choose the right GIS db for my web/mobile app? Got any suggestions?\n",
            "excerpt": "So i am little confused right now to choose the right <span class=\"highlight\">GIS</span> db for my web/mobile app? Got any suggestions? &hellip; ",
            "title": "Best GIS system for high performance web application - PostGIS vs MongoDB"
        },
        {
            "tags": [
                "arcgis-desktop",
                "algorithm",
                "polygon-creation"
            ],
            "question_score": 29,
            "is_accepted": true,
            "answer_id": 5302,
            "is_answered": false,
            "question_id": 5300,
            "item_type": "answer",
            "score": 36,
            "last_activity_date": 1295478625,
            "creation_date": 1295478625,
            "body": "This problem has many valid solutions.  One of them works a little like your description, but instead of slicing the polygons at &quot;random&quot; locations you can do it purposefully in a way designed to minimize the amount of computation.\n\nHere is the basic algorithm.  Its input consists of any plane sweep direction, a polygon P of nonzero area, a target area a between zero and the polygon&#39;s area, and a nonnegative threshold t (in units of area).  Its purpose is to split P with a line perpendicular to the sweep direction into two parts, one to the right of the line and the other to the left of the line, such that the difference between the righthand area and the target area a is no greater than t.\n\nLet L be any oriented line perpendicular to the sweep direction.  Define f(L) to be the area of P found at the right of L, minus a.  In these terms the task is to find a zero of f.  Because f is unlikely to be differentiable, but is continuous, use either a bisection method, the secant method, or--my favorite--Brent&#39;s method.  All are simple and guaranteed to converge.  Use t for the convergence tolerance for the argument.\n\nThat&#39;s it.  Let&#39;s consider what goes into coding this.  The root finding is routine--you can use a generic chunk of code for it--so the GIS work comes down to coding f.  Doing so requires\n\n\n\nBoth operations are implemented in almost any vector-based GIS.  If not, you can replace the line by a very large rectangle representing the half-plane to the right of the line.  Step 1 becomes\n\n\n\nThat is a really basic operation.\n\nTo get started with root finding, you need to find an interval in which the zero of f is guaranteed to lie.  This is easy: project the polygon&#39;s envelope (&quot;bounding box&quot;) into the direction of the line sweep.  The projection is the interval you want.\n\nThis question has a long history.  I implemented this algorithm for ArcView 3.x long ago and described it many times in the old ESRI user forums.  Google\n\n\n  huber split polygon site:forums.esri.com\n\n\nfor discussions, links to code, enhancements and variations (such as splitting polygons into parts of desired sizes which are as compact as possible) and algorithms for raster data.\n\nHere is what the continental US states look like (in an equal area projection) with the bottom third of each state shaded.  Evidently the sweep direction was vertical.\n\n\n",
            "excerpt": "The root finding is routine--you can use a generic chunk of code for it--so the <span class=\"highlight\">GIS</span> work comes down to coding f.  Doing so requires\n\n1.  Splitting the polygon by a line.\n2. &hellip; Both operations are implemented in almost any vector-based <span class=\"highlight\">GIS</span>.  If not, you can replace the line by a very large rectangle representing the half-plane to the right of the line.  Step 1 becomes\n\n1&#39;. &hellip; ",
            "title": "Dividing polygon into specific sizes using ArcGIS Desktop?"
        },
        {
            "tags": [
                "python",
                "shapefile"
            ],
            "question_score": 42,
            "is_accepted": true,
            "answer_id": 145018,
            "is_answered": false,
            "question_id": 145015,
            "item_type": "answer",
            "score": 36,
            "last_activity_date": 1594099000,
            "creation_date": 1430761008,
            "body": "I would recommend becoming familiar with the Python GDAL/OGR API to work with both vector and raster data.  The easiest way to start using GDAL/OGR is via a python distribution such as python(x,y), Anaconda, or OSGeo4W.\nFurther details on using GDAL for your specific tasks:\n\nGet Shapefile Fields and Types\nGet Projection\n\nAdditionally, I would recommend the following tutorial from USU to get you started.\n\nGeoprocessing with Python using Open Source GIS\n\n\nBorrowing from the examples above, the following script uses FOSS tools to perform the following actions:\n\nCheck the spatial reference\nGet shapefile fields and types\nCheck if rows in a user-defined field contain some value\n\n\n\n",
            "excerpt": "Geoprocessing with Python using Open Source <span class=\"highlight\">GIS</span>\n\n\nBorrowing from the examples above, the following script uses FOSS tools to perform the following actions:\n\nCheck the spatial reference\nGet shapefile fields &hellip; ",
            "title": "Is it possible to look at the contents of Shapefile using Python without an ArcMap license?"
        },
        {
            "tags": [
                "openstreetmap"
            ],
            "question_score": 45,
            "is_accepted": true,
            "answer_id": 13697,
            "is_answered": false,
            "question_id": 6933,
            "item_type": "answer",
            "score": 35,
            "last_activity_date": 1526401937,
            "creation_date": 1313604666,
            "body": "JOSM\n\nPerhaps the easiest answer to both parts of your question, is to use JOSM. The Java OpenStreetMap Editor. It&#39;s easy to download data, and easy to &quot;use&quot; data.\n\nFor downloading, JOSM provides a simple interface to let you select a rectangular area to download, however it downloads this via the editing API. This will reject any request which is way too big, and if it&#39;s a little bit too big it will spend a long time thinking about it. Generally a whole city is way too big, but you might be able to get a good a chunk of data by requesting several rectangular areas.\n\nFor &quot;using&quot; the data JOSM lets you see the data and have a good poke around in all the tags. The search feature is quite powerful, allowing you to select elements with particular tags, but beyond that it really depends what kind of &quot;use&quot; you have in mind. You can configure the way JOSM displays the data to some extent, but for nice looking maps you&#39;d probably want to look at rendering tools designed to work with OSM files. You can also look at conversion e.g. to shapefile, but bare in mind the data is ...different ...to what you might be used to, so this conversion is always a bit lossy.\n\nAs an aside...  Although it&#39;s reasonably nice data viewer, the primary purpose of JOSM is to be an OpenStreetMap editor. Just click &#39;upload&#39; to send changes back to OpenStreetMap  (you&#39;ll need to create an OpenStreetMap account) If you didn&#39;t try OpenStreetMap editing yet, you really should. Anyone with even a passing interest in maps should give this a go. Add your local restaurant to the map or something like that. It&#39;s the only way to get a proper understanding of OpenStreetMap, and it&#39;s fun!\n\nBigger files\n\nWhat if a city is too big to load into JOSM? There&#39;s some other options (as follows) but when you&#39;re dealing with this amount of data there&#39;s no escaping the fact that it&#39;s going to be a little bit difficult to &quot;use&quot;. You&#39;re really out of the realm of fun little GUI tools and into big data GIS. The easiest entry to this (which is not all that easy) would probably be to load a large .osm file into PostGIS database using osm2pgsql, and then use GIS desktop tools to view it.\n\nCity extracts\n\nThis download.bbbike.org service offers ready-made downloads for some world cities.\n\nOsmosis\n\nIf you need a different city or different bounding box, then you need to get one of the massive downloads you mentioned (either a country extract, or the whole planet) and then extract a piece out of it.\n\nosmosis is the most widely used tool for this. It&#39;s a java command line tool letting you extract a bounding box on the unix command line with something like this:\n\n\n\nThis shows how you would typically avoid filling your disk with bloated XML data by uncompressing a .bz2 file, piping the output into osmosis and then piping the resulting XML into a bzipped file again.\n\nSo maybe this is not fitting with your definition of &quot;easy&quot;, but osmosis is a worthwhile tool to get the hang of if you&#39;re interested in manipulating big .osm files. You just have to figure out the right command! (good topic for another question I guess)\n",
            "excerpt": "You&#39;re really out of the realm of fun little GUI tools and into big data <span class=\"highlight\">GIS</span>. &hellip; The easiest entry to this (which is not all that easy) would probably be to load a large .osm file into PostGIS database using osm2pgsql, and then use <span class=\"highlight\">GIS</span> desktop tools to view it. &hellip; ",
            "title": "Downloading OpenStreetMap Data"
        },
        {
            "tags": [
                "open-source-gis",
                "software-recommendations",
                "osgeo"
            ],
            "question_score": 35,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 6604,
            "item_type": "question",
            "score": 35,
            "last_activity_date": 1515042785,
            "creation_date": 1298900726,
            "body": "I currently know the following open source GIS servers:\n\n\nGeoserver: java based, vector and bitmap support, also supports. Is now on par with mapserver (performance-wise).\nmapserver: c/c++, used to be the fastest server. Better for raster than vector?\nmapguide: do not know this\nmapnik: the new kid on the block? do not know much about it, but it looks appealing\nmapfish: as far as i know, only retrieves vector-data for display in openlayers. There does exist a rails implementation.\n\n\nIf possible i would like some kind of comparison, which did you choose or prefer and why?\n\nI am looking at building a rails website, and need some kind of GIS server. I will need raster and vector data (clickable). Is this doable with one server? Backend database will be Postgis.\n",
            "excerpt": "I currently know the following open source <span class=\"highlight\">GIS</span> servers:\n\n\nGeoserver: java based, vector and bitmap support, also supports. &hellip; I am looking at building a rails website, and need some kind of <span class=\"highlight\">GIS</span> server. I will need raster and vector data (clickable). Is this doable with one server? Backend database will be Postgis. &hellip; ",
            "title": "Comparing different open source GIS servers?"
        },
        {
            "tags": [
                "maps",
                "workflow"
            ],
            "question_score": 28,
            "is_accepted": true,
            "answer_id": 18200,
            "is_answered": false,
            "question_id": 18199,
            "item_type": "answer",
            "score": 35,
            "last_activity_date": 1324648873,
            "creation_date": 1324647950,
            "body": "Note: This rant will be updated as I go\n\nI&#39;m no computer or ArcGIS pro by any means, but here&#39;s what I do:\n\nBase Files/DBS\n\n\nThese are files that are &quot;raw&quot; in nature and constitute the base of all my analysis\nThese files, databases, and data are hosted outside of my  folder, and are hosted on my internet server, local computer, and dropbox. I always have access to them, and they are very organized, dis and aggregated. You&#39;ll spend a lot of time organizing these.\nI put them all in databases whether in Arc or PostGIS.\nTo each table, I add 3 fields in the table itself or the meta data: DATE_OBTAINED, DATA_DATE, SOURCE_NOTES\nAlso Base files could be queries of multiple other tables. For example, a table could aggregate all the traffic count I obtain into one large query/table.\nI also put here all other data that I find scouring the internet.\nI NEVER DO ANY DIRECT ANALYSIS ON ANY OF THE FILES IN THE BASE FILES\n\n\nProject Files\n\n\nAll my project files go in a  folder. It contains everything related to that project as in, if I copy and paste that folder somewhere else, it will contain everything.\nUsually I have the following structure: \n\nmy_project/\n\nadmin/\ncommunication/\nraw_data/\nanalyzed_data/\noutput_data/\nfrom_client/\nFINAL/\ncode/\nsome_document_date_time.doc\nREADME\n\n\nSlowly I&#39;ve been moving to a local GIT. (you can even host it locally or on your own server). The reason I do not put it on GitHub is that github has a 1.2gb limit which is useless for GIS analysis\nFor my projects, I usually replicate all the GIS tables that I need for my analysis into a new db: project_whatever.\n9 times out of 10, I work only in shp files and I save all my GIS (images, excel, coordinates, etc) to my , , and . \nWhen a project is complete, I put the final submitted copy in \nFor my MXD, I usually save to a new MXD every 2 or 3 hours  for example\nFor Ms Word documents, illustrations, and mostly editing documents, they go in my_projects folder  such as  and . Again all my final deliverables go in in the FINAL folder\nFor R, Python code and some C#, it gets a bit tricky, as I host it outside of the project but with a working copy to  folder. I do this as most of the python code is reusable. If you put all your python code besides the projects, you&#39;ll forget about them. Also, all my python code goes on github.\nTo me project files include any file types including time tracking, communications (I save all my emails as .msg files), I log all our verbal communications in a word file, and I put all those files my_project/communication\nWith ArcGIS use Models, LYR, and &quot;save selection as a new shp layer&quot;. These tools will make it easy to store files in smaller formats, reuse files, and with models, be able to use something in another place.\n\n\nFinal Output\n\n\nEach project when finalized gets zipped and put on my external harddrive.\nAll final products are converted to files from Tables, and to PDF from all other formats. \nEvery Project I do, gets printed for a hard copy backup\n\n\nThe Bottom Line\n\n\nEach person uses multiple and different software and tools. A lot of people I know get organized using basecamp, Harvest, or any other multitude of tools. Also people have different working habits and OCD tendencies. I&#39;m fairly obsessed with getting stuff organized maybe a bit more than others. So develop the system that causes you the least stress while guaranteeing you&#39;ll be consistent in applying and updating it\nBackup and replicate everything\nDon&#39;t work directly on your raw / base data\nFor your projects always use a replica file, as data changes over time, and you don&#39;t want to be scrambling to find the .\neach my_projects folder must have a README text file that you edit it while you&#39;re doing the projects to give some basic information that you know you&#39;ll forget later when you visit the project 2 years down the road\n\n",
            "excerpt": "The reason I do not put it on GitHub is that github has a 1.2gb limit which is useless for <span class=\"highlight\">GIS</span> analysis\nFor my projects, I usually replicate all the <span class=\"highlight\">GIS</span> tables that I need for my analysis into a new db &hellip; : project_whatever.\n9 times out of 10, I work only in shp files and I save all my <span class=\"highlight\">GIS</span> (images, excel, coordinates, etc) to my projects/my_project/raw_data, projects/my_projects/analyzed_data, and projects &hellip; ",
            "title": "Organizing GIS projects?"
        },
        {
            "tags": [
                "education",
                "references"
            ],
            "question_score": 35,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 42045,
            "item_type": "question",
            "score": 35,
            "last_activity_date": 1529299253,
            "creation_date": 1353888739,
            "body": "The college I work for is considering revamping their intro to GIS course. Traditionally, they&#39;ve used the ESRI suite but are now open to using other options. There are two factors responsible for the desire to make a change:\n\n\nThe text book provided by ESRI. The instructors feel that the point and click tutorials don&#39;t teach the students how to think about GIS but rather how to use ESRI software. They&#39;d like to have something that&#39;s more than a manual and that won&#39;t be out of date by the time they arrive.\nTraditionally graduates could expect jobs from either the Territorial Government or Parks Canada (both of which use ArcGIS), but with recent gov&#39;t cut backs these two are no longer the main destination for graduates. After consulting with industry representatives the college has been told that they should be training student to &quot;think spatially&quot; rather how to use just one type of software.\n\n\nAre there any resources the SE.GIS community would consider helpful for developing GIS thought and instruction (rather than tutorials)? And if you were going to commit to teaching with one program/suite which do you think would be most useful to learn such that the skills learned would be most broadly applicable to GIS software in general?\n",
            "excerpt": "The instructors feel that the point and click tutorials don&#39;t teach the students how to think about <span class=\"highlight\">GIS</span> but rather how to use ESRI software. &hellip; Are there any resources the SE.GIS community would consider helpful for developing <span class=\"highlight\">GIS</span> thought and instruction (rather than tutorials)? &hellip; ",
            "title": "Learning to think spatially rather than just follow point and click tutorials"
        },
        {
            "tags": [
                "postgis",
                "postgresql",
                "r"
            ],
            "question_score": 29,
            "is_accepted": true,
            "answer_id": 64990,
            "is_answered": false,
            "question_id": 64950,
            "item_type": "answer",
            "score": 35,
            "last_activity_date": 1372752065,
            "creation_date": 1372752065,
            "body": "If you have PostGIS driver capability in the rgdal package then its just a question of creating a connection string and using that. Here I&#39;m connecting to my local database  using default credentials, so my DSN is rather simple. You might need to add a host, username, or password. See gdal docs for info.\n\n\n\nWhat tables are in that database?\n\n\n\nGet one:\n\n\n\nWhat have I got?\n\n\n\nOtherwise you can use R&#39;s database functionality and query the tables directly.\n\n\n\nThat returns the feature geometry in , which you&#39;ll need to convert to  class objects (SpatialPolygons, SpatialPoints, SpatialLines) to do anything with. The readWKT function in rgeos can help with that.\n\nThe things to beware of are usually stuff like database columns that can&#39;t be mapped to R data types. You can include SQL in the query to do conversions, filtering, or limiting. This should get you started though.\n",
            "excerpt": "Here I&#39;m connecting to my local database <span class=\"highlight\">gis</span> using default credentials, so my DSN is rather simple. You might need to add a host, username, or password. See gdal docs for info. &hellip; &gt; require(rgdal)\n&gt; dsn=&quot;PG:dbname=&#39;<span class=\"highlight\">gis</span>&#39;&quot;\n\n\nWhat tables are in that database? &hellip; ",
            "title": "Working with PostGIS data in R?"
        },
        {
            "tags": [
                "references",
                "education"
            ],
            "question_score": 35,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 15490,
            "item_type": "question",
            "score": 35,
            "last_activity_date": 1588976929,
            "creation_date": 1318210854,
            "body": "Working as a professional within the GIS discipline, I often find it challenging to describe to people what GIS is (in a face to face conversation).  Telling them that GIS stands for Geographic Information Systems, which encompasses a set of technologies that can be used to analyze, map, and organize spatial data is a bit over most people heads.  On the contrary, telling people that GIS can be used to make maps on a computer falls far short of its many potential uses.  With this, I&#39;m looking for some effective video examples that one could show somebody that explain both in words and visually what GIS is, and how the technology is utilized (something your Mom could understand :))?  \n",
            "excerpt": "Working as a professional within the <span class=\"highlight\">GIS</span> discipline, I often find it challenging to describe to people what <span class=\"highlight\">GIS</span> is (in a face to face conversation). &hellip; On the contrary, telling people that <span class=\"highlight\">GIS</span> can be used to make maps on a computer falls far short of its many potential uses. &hellip; ",
            "title": "Is there GIS Video &quot;that Mom can understand&quot;?"
        },
        {
            "tags": [
                "references"
            ],
            "question_score": 35,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 37,
            "is_answered": true,
            "question_id": 927,
            "item_type": "question",
            "score": 35,
            "last_activity_date": 1420382057,
            "creation_date": 1281196832,
            "body": "Programmers&#39; list has been a pleasure to read. Stats&#39; list is growing fast as well. So perhaps there is a place for separate one on this site?\n\nPlease share your nuggets of wisdom / humour / inspiration from the world of GIS, cartography and mapping.\n",
            "excerpt": "Please share your nuggets of wisdom / humour / inspiration from the world of <span class=\"highlight\">GIS</span>, cartography and mapping. &hellip; ",
            "title": "Great GIS, maps &amp; cartography quotes"
        },
        {
            "tags": [
                "qgis",
                "internationalization",
                "windows-xp"
            ],
            "question_score": 35,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 26457,
            "item_type": "question",
            "score": 35,
            "last_activity_date": 1657020560,
            "creation_date": 1338381889,
            "body": "I want the QGIS interface in English, in order to share information with the GIS community. Using another language, when chatting with the GIS community, makes things more difficult. When I installed QGIS, it automatically set the language to French.\nI am using Windows XP in French, but I want QGIS in English.\n",
            "excerpt": "I want the QGIS interface in English, in order to share information with the <span class=\"highlight\">GIS</span> community. Using another language, when chatting with the <span class=\"highlight\">GIS</span> community, makes things more difficult. &hellip; ",
            "title": "Changing language of QGIS Interface"
        },
        {
            "tags": [
                "python",
                "c++",
                "references"
            ],
            "question_score": 34,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 10,
            "is_answered": true,
            "question_id": 883,
            "item_type": "question",
            "score": 34,
            "last_activity_date": 1471284092,
            "creation_date": 1281122874,
            "body": "I would like to develop my GIS programming skills, where do I start? People say learn C++ or Python but where can I learn this in a geographic context? Tutorials or anything would be very helpful, as would any information on languages/programmes to use.\n",
            "excerpt": "I would like to develop my <span class=\"highlight\">GIS</span> programming skills, where do I start? People say learn C++ or Python but where can I learn this in a geographic context? &hellip; ",
            "title": "How do I develop my GIS programming skills?"
        },
        {
            "tags": [
                "coordinate-system",
                "gis-principle"
            ],
            "question_score": 34,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 5068,
            "item_type": "question",
            "score": 34,
            "last_activity_date": 1400509916,
            "creation_date": 1294856321,
            "body": "A Tissot Indicatrix is useful method for communicating at a glance the kinds of distortion a given projection is prone to (in the figure below, each of the red circles occupies the same area). I&#39;ve been told that popular methods for generating TI&#39;s have their own problems, to the point of being sometimes woefully inaccurate. \n\nWhat is the problem with the popular methods, and what is most correct way of generating a TI that is accessible to your average GIS dude(ette)?\n\n\n",
            "excerpt": "What is the problem with the popular methods, and what is most correct way of generating a TI that is accessible to your average <span class=\"highlight\">GIS</span> dude(ette)? &hellip; ",
            "title": "How to create an accurate Tissot Indicatrix?"
        }
    ],
    "has_more": true,
    "quota_max": 300,
    "quota_remaining": 297
}