{
    "items": [
        {
            "tags": [
                "coordinate-system",
                "leaflet",
                "openstreetmap",
                "google-maps",
                "web-mapping"
            ],
            "question_score": 250,
            "is_accepted": true,
            "answer_id": 48952,
            "is_answered": false,
            "question_id": 48949,
            "item_type": "answer",
            "score": 280,
            "last_activity_date": 1680647779,
            "creation_date": 1359012125,
            "body": "There are a few things that you are mixing up.\n\nGoogle Earth is in a Geographic coordinate system with the wgs84\ndatum. (EPSG: 4326)\n\nGoogle Maps is in a projected coordinate system  that is based on the\nwgs84 datum. (EPSG 3857)\n\nThe data in Open Street Map database is stored in a gcs with units\ndecimal degrees &amp; datum of wgs84. (EPSG: 4326)\n\nThe Open Street Map tiles and the WMS webservice, are in the\nprojected coordinate system  that is based on the wgs84 datum. (EPSG\n3857)\n\n\nSo if you are making a web map, which uses the tiles from Google Maps or tiles from the Open Street Map webservice, they will be in Sperical Mercator (EPSG 3857 or srid: 900913) and hence your map has to have the same projection.\n\nI&#39;ll like to expand the point raised by mkennedy\nAll of this further confused by that fact that often even though the map is in Web Mercator(EPSG: 3857), the actual coordinates used are in lat-long (EPSG: 4326). This convention is used in many places, such as:\n\nIn Most Mapping API,s You can give the coordinates in Lat-long, and the API automatically transforms it to the appropriate Web Mercator coordinates.\nWhile Making a KML, you will always give the coordinates in geographic Lat-long, even though it might be showed on top of a web Mercator map.\nMost mobile mapping Libraries use lat-long for position, while the map is in web Mercator.\n\n",
            "excerpt": "This convention is used in many places, such as:\n\nIn Most <span class=\"highlight\">Mapping</span> API,s You can give the coordinates in Lat-long, and the API automatically transforms it to the appropriate Web Mercator coordinates. &hellip; Most mobile <span class=\"highlight\">mapping</span> Libraries use lat-long for position, while the map is in web Mercator. &hellip; ",
            "title": "EPSG 3857 or 4326 for Web Mapping"
        },
        {
            "tags": [
                "coordinate-system",
                "leaflet",
                "openstreetmap",
                "google-maps",
                "web-mapping"
            ],
            "question_score": 250,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 48949,
            "item_type": "question",
            "score": 250,
            "last_activity_date": 1680647894,
            "creation_date": 1359011218,
            "body": "The discussion at What is the difference between WGS84 and EPSG4326? shows that 4326 is just the EPSG identifier of WGS84..\n\nWikipedia entries for Google Maps and OpenStreetMap shows that they both use  WGS 84.\n\nhttp://wiki.openstreetmap.org/wiki/EPSG:3857 states that \n\nEPSG:3857 is a Spherical Mercator projection coordinate system popularized by web services such as Google and later OpenStreetMap. \n\nLeaflet&#39;s help states:\n\nEPSG3857 The most common CRS for online maps, used by almost all free and commercial tile providers. Uses Spherical Mercator projection. Set in by default in Map&#39;s crs option.|\n\nEPSG4326 A common CRS among GIS enthusiasts. Uses simple Equirectangular projection.\n\nThis is confusing - it seems that Google Maps and OpenStreetMap use EPSG3857 but they use WGS84 which &#39;is&#39; EPSG4326. Something can&#39;t be right here, most likely my understanding. \n\nCould someone help me understand?\n",
            "excerpt": "The discussion at What is the difference between WGS84 and EPSG4326? shows that 4326 is just the EPSG identifier of WGS84..\n\nWikipedia entries for Google Maps and OpenStreetMap shows that they both us &hellip; ",
            "title": "EPSG 3857 or 4326 for Web Mapping"
        },
        {
            "tags": [
                "javascript",
                "web-mapping"
            ],
            "question_score": 138,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 16,
            "is_answered": true,
            "question_id": 8032,
            "item_type": "question",
            "score": 138,
            "last_activity_date": 1669439728,
            "creation_date": 1301660659,
            "body": "I am working on a web-based mapping system and I&#39;m trying to figure out which library to use.\n\nThese are links to comparisons of available libraries:\n\n\nLaurent Jegou&#39;s benchmark (from 2010) is a global outlook on web mapping solutions (both client and server).\ncomparison of FOSS libraries by German Carrillo can be found here:\n\n\n\n\nThe list of libraries so far:\n\n\nGoogle Maps\nMicrosoft Virtual Earth\nMapQuest\nLeaflet - &quot;The comment smaller, faster, newer, and more straightforward can also be read as less features and less tested.&quot; -Geographika (see below) \nArcGIS API for JavaScript - Works best with ArcGIS Server (see below). Google Maps and Bing maps extensions are also available, letting you use the ESRI API with Google/Bing maps (though this is true of most libraries).\nYahoo Map API&#39;s\nVia Michelin\nOpenLayers - Extensive documentation and a good amount of functionality plus the ability to use different map providers. \nMapquery - MapQuery has been released and now has some useful documentation It has the very worthwhile goal of combining OpenLayers and jQuery. If you&#39;re particularly keen on the idea of OpenLayers + jQuery, or if you want to contribute to a JavaScript Mapping Library then get involved and contribute your efforts. However if you just want to be an end user, or are new to this area it may not be for you.\nMapstraction - Makes things very simple, especially working with multiple basemap providers. However it is still a work in progress and the functionality is lacking in places, as is the documentation. (E.g. &quot;A GeoJSON object with the type “FeatureCollection” is a feature collection object.&quot; Not very informative.) It appears that it is still being actively developed but as of 4/4/11 there hasn&#39;t been a commit on Github since January.\ndeCarta - Has a mobile and desktop javascript - first is HTML5/CSS3 compliant and the second has more browser compatibility. Source code provided. Friendliest developer terms for a commercial API. You are allowed to brand the map and there are several different map styles. You can choose NAVTEQ or OSM data. They also have several Mobile APIs as well. - edited by TheSteve0 - a deCarta employee\nCloudmade\nPolymaps - Makes it very easy to composite raster and vector data from many different sources. Lets you easily add your own colouring, grouping, and interaction. Runs quickly, manages background tile loading well, and is only 30k of Javascript. One potential down side: it uses SVG which means it does not and will not work in MSIE 7 or 8. It works great in every other browser and should work in IE9\nJump - jump is a light weight maps library that works on its own, meaning, it is not a wrapper for OpenLayers or GoogleMaps API. Currently it is under development, but a lot of essential features work well.\nModestMaps - Another smaller, faster, newer JS mapping library from the makers of Mapbox and TileMill. \nMapiator\n\n\nOpenLayers is the one I am currently using. You can do a lot with it and it supports most data types. However it&#39;s not the best for everything. For example, Leaflet seems smoother in many ways, with image fading and other visual tweaks. If you&#39;re into jQuery you might like to check out MapQuery which is like a combination of jQuery and OpenLayers.\n",
            "excerpt": "I am working on a web-based <span class=\"highlight\">mapping</span> system and I&#39;m trying to figure out which library to use. &hellip; ModestMaps - Another smaller, faster, newer JS <span class=\"highlight\">mapping</span> library from the makers of Mapbox and TileMill. \nMapiator\n\n\nOpenLayers is the one I am currently using. &hellip; ",
            "title": "Comparing various JavaScript mapping libraries?"
        },
        {
            "tags": [
                "coordinate-system",
                "mapinfo",
                "latitude-longitude"
            ],
            "question_score": 126,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 11626,
            "item_type": "question",
            "score": 126,
            "last_activity_date": 1684956311,
            "creation_date": 1309385764,
            "body": "I am using Mapinfo and it has Y as latitude and X as longitude. Is that the same case for all mapping software? As for any country their respective value is multiple of 1 or -1. So for Nepal can I say it is on positive side +1 for both latitude and longitude? And for USA to be +1 Y and -1 X.\n",
            "excerpt": "Is that the same case for all <span class=\"highlight\">mapping</span> software? As for any country their respective value is multiple of 1 or -1. So for Nepal can I say it is on positive side +1 for both latitude and longitude? &hellip; ",
            "title": "Does Y mean latitude and X mean longitude in every GIS software?"
        },
        {
            "tags": [
                "coordinates",
                "latitude-longitude",
                "gis-principle",
                "accuracy",
                "precision"
            ],
            "question_score": 607,
            "is_accepted": false,
            "answer_id": 109178,
            "is_answered": false,
            "question_id": 8650,
            "item_type": "answer",
            "score": 120,
            "last_activity_date": 1492078422,
            "creation_date": 1406945533,
            "body": "Here&#39;s my rule of thumb table...\n\nLatitude coordinate precision by the actual cartographic scale they purport:\n\n\n",
            "excerpt": "of a strand of hair.\n10               10 microns         A speck of pollen.\n11               1.0 micron         A piece of cigarette smoke.\n12               0.1 micron         You&#39;re doing virus-level <span class=\"highlight\">mapping</span> &hellip; What are you <span class=\"highlight\">mapping</span>? &hellip; ",
            "title": "Measuring accuracy of latitude and longitude"
        },
        {
            "tags": [
                "javascript",
                "web-mapping"
            ],
            "question_score": 138,
            "is_accepted": true,
            "answer_id": 8048,
            "is_answered": false,
            "question_id": 8032,
            "item_type": "answer",
            "score": 98,
            "last_activity_date": 1504333680,
            "creation_date": 1301676701,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\nFor non-GIS background devs creating single-function mapping apps - I&#39;d probably recommend Leaflet (now supported by MapBox). Easy to use and small. More functionality relies on plugins of varying quality and support. \n\nGIS online type application - use OpenLayers3 - has the full suite of data sources, controls etc. in a single library. It can also be used for simple mapping apps, so if you have a mix then I&#39;d use this for everything. \n\nGoogle still has the library/data combination (e.g. StreetView is not available anywhere else). \n\nEsri has GUI web app builders, and as noted below, why complicate things if you already use their stack. \n\nCommercial APIs (Google, Bing, Yahoo)\n\nUsing any commercial API leaves you at the mercy of whatever changes the provider makes to the API or Terms of Service. What happens for example if suddenly your local government portal that uses Google Maps suddenly has adverts popping up all over it? Want to reuse your JavaScript Google Maps code for an Intranet site? You&#39;ll find yourself having to pay the $10,000 licencing fee. \n\nMicrosoft often have more defined and fixed terms for their services (if paying) so there may be less of a risk here. \n\nThe recent backlash against Twitter is a good example of developers having an API that changed beneath them. If you aren&#39;t paying for a service then you (or your system) are the one being sold. \n\nGoogle started charging for use of their maps from October 2011. \n\nEsri\n\nAs others have mentioned if you are using an Esri stack then the ArcGIS API for JavaScript will no doubt work well on top of it. Coming from a GIS background Esri have probably thought more about traditional GIS tasks and features than the &quot;neo-geography&quot; web-giants (though this is just an opinion/feeling). \n\nOpenLayers has built in support for ArcGIS REST layers, and if you are looking to reuse your code for non-ESRI based websites then again an open API serves you best. \n\nUse OpenLayers...\n\nI can&#39;t really think why developers would use an API other than OpenLayers. Open Source projects lead to related Open Source projects so there are a wealth of reusable components out there such as the GeoExt library, MapQuery,  and GeoPrisma. \n\nI&#39;ll just add that just because a project is Open Source does not automatically make it better than commercial equivalents - but the OpenLayers API matches the commercial competition in this case, and the ability to see how the source works, the unit tests, the build scripts etc. mean that you can easily build new features on top of it. \n\nThere has been some recent criticism of OpenLayers, mainly related to complexity, styling, and size. There have been counter-arguments made to these here and here by Christopher Schmidt one of the lead developers of OpenLayers. \n\nIt is worth noting that if you need a simple Open Source mapping API then take a look at Cloudmade&#39;s Leaflet. \n\nThe comment smaller, faster, newer, and more straightforward can also be read as less features and less tested.\n\nScan the API documentation for Leaflet and OpenLayers. The latter includes items such as WFS layers, editing tools, and SLD support. It has also been tested in many different environments, and works in IE6 (allowing government and local authority users). \n\nFor simpler display of spatial data Leaflet looks ideal, and easier to get started. However I&#39;ll be sticking with OpenLayers for more feature-rich GIS applications. \n\nCaveats\n\nOne possible downside is often new innovations are seen first in commercial providers&#39; systems - however these nearly always filter through to OpenLayers in time. \n\nFinally I&#39;m sure there are certain scenarios where other APIs are more suitable - on custom hardware, to fit in with an organisations other IT systems, or if you already know an API inside-out and can get a system developed in half the time. \n\nAll the APIs you mentioned are capable of producing great online mapping systems, but your choice should also fit in with you or your company&#39;s future development needs. \n",
            "excerpt": "For non-GIS background devs creating single-function <span class=\"highlight\">mapping</span> apps - I&#39;d probably recommend Leaflet (now supported by MapBox). Easy to use and small. &hellip; It is worth noting that if you need a simple Open Source <span class=\"highlight\">mapping</span> API then take a look at Cloudmade&#39;s Leaflet. &hellip; ",
            "title": "Comparing various JavaScript mapping libraries?"
        },
        {
            "tags": [
                "cartography"
            ],
            "question_score": 184,
            "is_accepted": false,
            "answer_id": 4412,
            "is_answered": false,
            "question_id": 3083,
            "item_type": "answer",
            "score": 86,
            "last_activity_date": 1504333375,
            "creation_date": 1292345585,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\nRADICAL CARTOGRAPHY showcases couple of really nice examples. \n\nMy two favourites:\n\n\nMississippi meanders\n\n\n\n\n\nStatistical Atlas of 1870 US Census\n\n\n\n\n\n\nEduard Imhof&#39;s work, especially his hand-drawn hillshading maps:\n\n\n\n\n\nAs the question does not specify that a map has to be a traditional static map, I would like to propose the Mapnificent London travel times map.\n\n\n\nAs per usualy, Google are really pushing what you can do with Online Mapping APIs.\nIn terms of map design, the v3 API now gives you greater control over tweaking the underlying base map.\n\nThe map is also very user-friendly, but I think usability probably falls outside the realm of beauty.\n",
            "excerpt": "As per usualy, Google are really pushing what you can do with Online <span class=\"highlight\">Mapping</span> APIs.\nIn terms of map design, the v3 API now gives you greater control over tweaking the underlying base map. &hellip; ",
            "title": "Seeking examples of beautiful maps?"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcpy",
                "modelbuilder"
            ],
            "question_score": 74,
            "is_accepted": true,
            "answer_id": 57383,
            "is_answered": false,
            "question_id": 57381,
            "item_type": "answer",
            "score": 85,
            "last_activity_date": 1578715864,
            "creation_date": 1365355573,
            "body": "I believe that the user should clearly define their objectives before deciding which set of tools to use.  ModelBuilder and Python scripting excel at different tasks.  A few thoughts: \n\n\nModelBuilder has no mapping capabilities, whereas\narcpy.mapping does.\nPython can be used to optimize workflows, such as with the\nmultiprocessing package or with parallel processing.\nPython allows for nested loops and other handy iterative logic\ntools.  To accomplish a similar result in ModelBuilder, you would\nhave to construct intricate, and complicated, nested models.\nSimple text manipulation is very easy with Python and either very\ndifficult or not possible with ModelBuilder.\n\ne.g. to rename a list of file names from, for example &quot;m_2010_naip_2310345_nw.img&quot; to &quot;2310345nw.img&quot; can easily be accomplished with Python using the  module.\n\n\nOn the other hand:\n\n\nModelBuilder is very useful for quickly putting together common tools\nand eliminating the need for debugging scripts.\nModelBuilder has a very useful recursive iterator that is easy to\nimplement in order to loop through folders and subfolders.\nModelBuilder excels at visually and intuitively depicting the workflow for\ncomplicated tasks.\nModelBuilder can incorporate Python script tools.\n\n",
            "excerpt": "A few thoughts: \n\n\nModelBuilder has no <span class=\"highlight\">mapping</span> capabilities, whereas\narcpy.mapping does. &hellip; ",
            "title": "When to use ModelBuilder over Python scripting and vice versa?"
        },
        {
            "tags": [
                "labeling",
                "coordinate-system",
                "annotation",
                "latitude-longitude"
            ],
            "question_score": 84,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 6037,
            "item_type": "question",
            "score": 84,
            "last_activity_date": 1571552184,
            "creation_date": 1297363276,
            "body": "I&#39;m trying to get a sense if this is an issue for others or every input/output should be labeled so user is not confused and just go with it?\n\nI think almost everyone pronounces it as &quot;LatLon&quot;.  \n\nWho started it?  \n\nIs it because it&#39;s in alphabetical order compared to &quot;LonLat&quot;?  \n\nMapping Lat and Lon to Cartesian plane Lon is &quot;x&quot; and Lat is &quot;y&quot; so since we say &quot;(x,y)&quot; it should be said as &quot;LonLat&quot;.  And now for display of information.  \n\nShould the status bar on a mapping application display La,Lo or Lo,Lat?  \n\nShould it just be labeled as one way and let user deal with it?  \n\nAnd same with input, what&#39;s the right way to order the fields?\n\nKML&#39;s format is Lon,Lat,Altitude.  While other apps is Lat,Lon and so have to be very vigilant about when converting formats.\n\nIs there a standard?\n",
            "excerpt": "<span class=\"highlight\">Mapping</span> Lat and Lon to Cartesian plane Lon is &quot;x&quot; and Lat is &quot;y&quot; so since we say &quot;(x,y)&quot; it should be said as &quot;LonLat&quot;.  And now for display of information. &hellip; Should the status bar on a <span class=\"highlight\">mapping</span> application display La,Lo or Lo,Lat?  \n\nShould it just be labeled as one way and let user deal with it? &hellip; ",
            "title": "Displaying coordinates and inputs as LatLon or LonLat?"
        },
        {
            "tags": [
                "web-mapping",
                "references"
            ],
            "question_score": 83,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 31,
            "is_answered": true,
            "question_id": 8113,
            "item_type": "question",
            "score": 83,
            "last_activity_date": 1699642289,
            "creation_date": 1301949954,
            "body": "I want to start working on a web map at work to map some of our statistics by city.  \n\nI have an idea, but I&#39;m not exactly sure where to start. \n\nAre there any definitive resources that provide step by step guidance on how to do this?\n",
            "excerpt": "I want to start working on a web map at work to map some of our statistics by city.  \n\nI have an idea, but I&#39;m not exactly sure where to start. \n\nAre there any definitive resources that provide step b &hellip; ",
            "title": "How to Start Web Mapping?"
        },
        {
            "tags": [
                "coordinate-system",
                "distance",
                "spherical-geometry",
                "datum",
                "accuracy"
            ],
            "question_score": 77,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 25494,
            "item_type": "question",
            "score": 77,
            "last_activity_date": 1643282282,
            "creation_date": 1337103873,
            "body": "What level of error do I encounter when approximating the earth as a sphere? Specifically, when dealing with the location of points and, for example, the great circle distances between them.\n\nAre there any studies on the average and worst case error compared to an ellipsoid? I&#39;m wondering how much accuracy I&#39;d be sacrificing if I go with a sphere for the sake of easier calculations.\n\nMy particular scenario involves directly mapping WGS84 coordinates as if they were coordinates on a perfect sphere (with the mean radius defined by the IUGG) without any transformation.\n",
            "excerpt": "My particular scenario involves directly <span class=\"highlight\">mapping</span> WGS84 coordinates as if they were coordinates on a perfect sphere (with the mean radius defined by the IUGG) without any transformation. &hellip; ",
            "title": "How accurate is approximating Earth as sphere?"
        },
        {
            "tags": [
                "arcpy",
                "references"
            ],
            "question_score": 37,
            "is_accepted": false,
            "answer_id": 53826,
            "is_answered": false,
            "question_id": 53816,
            "item_type": "answer",
            "score": 73,
            "last_activity_date": 1615502880,
            "creation_date": 1362692022,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\nLook at posts here and on other websites that use Python scripts and try to deconstruct them and see what techniques the authors are using to accomplish their task.  Our self-assembling FAQ on ArcPy is well worth reviewing for this purpose.\nYou will find it educational to try to solve other people&#39;s problems.  We have a self-assembling list of unanswered questions on ArcPy to help you find them.\nDo not forget that you can right-click any geoprocessing result and click &quot;Copy as Python Snippet&quot; if you just want to get the syntax of a function call, which is especially useful for things like field mappings and code blocks.  It is also possible to export ModelBuilder models to Python code, but there is no guarantee that the code exported from a working model will also work in Python, and for all but the simplest models the code that results is often difficult for beginners to debug.\nArcGIS Documentation:\nRead the help files!!  90% of ArcPy is just the same as using the GUI tools, only you are starting them using Python.  The help files all have example Python code at the bottom.\n\nWhat is ArcPy? is the front page to Help on using ArcPy with ArcMap from versions 10.3 - 10.8\n\n\n\nArcGIS Desktop Help (9.3)\nArcGIS Desktop Help (10)\nArcGIS Desktop Help (10.1)\nArcGIS Desktop Help (10.2)\nArcGIS Desktop Help (10.3)\nArcGIS Desktop Help (10.4)\nArcGIS Desktop Help (10.5)\nArcGIS Desktop Help (10.6)\nArcGIS Pro Help\nPython migration from 10.x to ArcGIS Pro\nArcGIS for Python API (not ArcPy)\n\nOnline Books:\n\nHow to Think Like a Computer Scientist\nDive into Python\nA Byte of Python (2.x)\nLearn Python the Hard Way\n\nOnline Courses:\n\nCodecademy Python Track offers free online coding lessons, including Python.  Use this to get the feel of how Python works before working on ArcPy.\nGoogle’s Python Class\nPenn State – GEOG 485 – GIS Programming and Automation\nArcPy for Python Developers using ArcGIS Pro\n\nTutorials:\n\nNon-Programmer’s Tutorial for Python 2.6\nOfficial Python Tutorial (2.5.4)\nOfficial Python Tutorial (2.6.5)\nOfficial Python Tutorial (2.7)\nDoug Hellmann&#39;s Python Module of the Week (PyMOTW) site\nCode Like a Pythonista: Idiomatic Python\nProgression path - using Python for GIS: from apprentice to guru\n\nPython Documentation:\n\nPython.org\nPython 2.5.4 Documentation (for ArcGIS 9.3)\nPython 2.6.5 Documentation (for ArcGIS 10)\nPython 2.7 Documentation (for ArcGIS 10.1-10.6)\nPython 3.6 Documentation (for ArcGIS Pro)\n\nPresentations:\n\nGetting Started with Python in ArcGIS 10 (from 2010)\nArcGIS Geoprocessing: Python Scripting – Advanced Techniques (from 2009)\nPython Scripting for Map Automation in ArcGIS 10 (from 2010)\n\nPaper Books:\n\nPython in a Nutshell, 2nd Ed\nLearning Python, 3rd Ed\nProgramming Python, 3rd Ed\nPython Cookbook, 2nd Ed\nA Python Primer for ArcGIS\nPython Scripting for ArcGIS\nGIS Tutorial for Python Scripting (coming June 2014)\n\nUser Communities:\n\nStack Overflow\nGIS Stack Exchange\nESRI Python Forum\nESRI Geoprocessing Forum\n\nBlogs:\n\nESRI Geoprocessing Blog\nESRI ArcGIS Desktop Blog\nArcGIS Team Python blog\n\nSample Code:\n\nArcScripts\nGeoprocessing Model and Script Tool Gallery\n\nTools/Integrated Development Environments (IDEs) - Non-commercial:\n\nPythonWin\nPyScripter\nPyDev (plug-in for the Eclipse software development environment)\nPython Tools for Visual Studio\nWinpdb (debugger)\n\nModules/Frameworks:\n\nDjango (web application framework)\ncomtypes (for using ArcObjects in Python)\nscipy/numpy\nPyPI - the Python Package Index\nSeeking Python tools/modules/add-ins for GIS?\n\nAlso see these general tips for new Python programmers in this answer to Exporting mxds into pdfs using ArcPy?.\n",
            "excerpt": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It &hellip; ",
            "title": "Learning ArcPy?"
        },
        {
            "tags": [
                "cartography"
            ],
            "question_score": 72,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 11,
            "is_answered": true,
            "question_id": 3087,
            "item_type": "question",
            "score": 72,
            "last_activity_date": 1504783415,
            "creation_date": 1288498094,
            "body": "A poorly designed map can not only look visually unappealing, but can convey the wrong message, which could lead to bad decisions being made.\n\nI would like to ask people to post examples (that are in the public realm) of poorly designed maps, WITH justification on why it is bad design.   \n\nAlthough this &#39;question&#39; does not have a clear answer, I think it will prove a useful resource to see what merits bad design, so others can learn what NOT to do.  I will let the votes choose the &#39;right&#39; answer.\n\nI would also like to see examples of bad design around web-mapping.\n\nI would argue that although GIS Professionals generally know how to create a good looking map, I would say that they also have a tendency to over-complicate web-maps, by trying to re-create a GIS desktop application on the web:\n\nAlso slow to use, and hard to even get to the map.\n\nI think now that normal people are more used to Google Maps style/simplicity, web-maps should follow a similar approach.\n\nWith the explosion of &#39;NeoGeography&#39; particularly in the web realm, we now have a lot of non-GIS professionals creating maps for the web.  A lot of these developers are often very good at user-interface design, but not trained in cartographic principles.\n\nI think, with web maps, its all about combining the skills of both cartography and user interface design.\n",
            "excerpt": "I would also like to see examples of bad design around web-<span class=\"highlight\">mapping</span>. &hellip; ",
            "title": "What Makes a Map be classed as Badly Designed?"
        },
        {
            "tags": [
                "python",
                "shapefile",
                "shapely"
            ],
            "question_score": 39,
            "is_accepted": true,
            "answer_id": 52708,
            "is_answered": false,
            "question_id": 52705,
            "item_type": "answer",
            "score": 65,
            "last_activity_date": 1662970476,
            "creation_date": 1361601341,
            "body": "Well-known binary is a good binary exchange format that can be exchanged with plenty of GIS software, including Shapely and  GDAL/OGR.\nThis is a tiny example of the workflow with :\n\n\nAlthough the poster has accepted the GDAL/OGR answer, here is a Fiona equivalent:\n\n",
            "excerpt": "geom = None  # destroy these\n\n# Save and close everything\nds = layer = feat = geom = None\n\n\nAlthough the poster has accepted the GDAL/OGR answer, here is a Fiona equivalent:\nfrom shapely.geometry import <span class=\"highlight\">mapping</span> &hellip; int&#39;},\n}\n\n# Write a new Shapefile\nwith fiona.open(&#39;my_shp2.shp&#39;, &#39;w&#39;, &#39;ESRI Shapefile&#39;, schema) as c:\n    ## If there are multiple geometries, put the &quot;for&quot; loop here\n    c.write({\n        &#39;geometry&#39;: <span class=\"highlight\">mapping</span> &hellip; ",
            "title": "Writing Shapely geometries to shapefiles"
        },
        {
            "tags": [
                "qgis",
                "pyqgis",
                "fields-attributes",
                "values"
            ],
            "question_score": 28,
            "is_accepted": false,
            "answer_id": 54059,
            "is_answered": false,
            "question_id": 54057,
            "item_type": "answer",
            "score": 65,
            "last_activity_date": 1722519423,
            "creation_date": 1362991179,
            "body": "To loop over every feature in a layer, use the  generator. This returns an iterator of features () in the layer.\n\nIf you&#39;re only interested in a particular feature, instead of all of the features in the layer, you can access it using the  and its :\n\nOnce you have a  object you can use the  method to retrieve the attributes (a.k.a. columns or fields) associated with that feature (a.k.a. row), e.g.:\n\nIf you want to index the field by its name, rather than a number, you need to use the field mappings:\n\nThe field index shouldn&#39;t change during the loop, so you only need to call it once.\nThere is more information and examples in the PyQGIS cookbook:\nhttp://www.qgis.org/pyqgis-cookbook/vector.html#iterating-over-vector-layer\nYou can access feature attributes much more easily by using the  like a , e.g.\n\nI&#39;m not sure which version came in or if it&#39;s always been there.\n",
            "excerpt": "To loop over every feature in a layer, use the getFeatures() generator. This returns an iterator of features (QgsFeature) in the layer.\nfor feature in layer.getFeatures():\n    pass # do something with &hellip; ",
            "title": "Reading attribute values using PyQGIS"
        },
        {
            "tags": [
                "qgis",
                "qgis-3",
                "references"
            ],
            "question_score": 53,
            "is_accepted": false,
            "answer_id": 3659,
            "is_answered": false,
            "question_id": 3651,
            "item_type": "answer",
            "score": 61,
            "last_activity_date": 1543917013,
            "creation_date": 1290153797,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\nFor QGIS 3.x users:\n\n\nQGIS User Manual - includes both 2.x and 3.x documentation and links to many of the resources listed here\nGIS SE&#39;s self-assembling FAQ on QGIS 3.0\nQGIS Planet blog for more technical and development stuff.\n\n\nFor QGIS 3.x developers:\n\n\nGIS SE&#39;s self-assembling FAQ on PyQGIS in QGIS 3.0\n\n\n\n\nFor QGIS 2.x users:\n\n\nQGIS Training Manual ... covers a wide range of topics\nQGIS User Manual\nQGIS Tutorials and Tips\nLearning QGIS ... if you already know GIS concepts and you are looking for a resource to quickly get started using QGIS\nQGIS Map Design ... for tutorials on making maps\nA Gentle Introduction to GIS Brought to you with Quantum GIS, a Free and Open Source Software GIS Application for everyone; by T. Sutton, O. Dassau, M. Sutton - 115 page manual for beginners with video lectures [here][49]\nDesktop GIS: Mapping the Planet with Open Source Tools by Gary E. Sherman\nQGIS Workshop from Harvard University\nTutorial: QGIS basics for Journalists from UC Berkeley\nIntroducing GIS worksheets\n\n\nFor QGIS 2.x developers:\n\n\nGeneral API documentation\nPyQGIS Cookbook ... on developing python plugins\nMy own notes on developing Python plugins\n\n",
            "excerpt": "Sutton - 115 page manual for beginners with video lectures [here][49]\nDesktop GIS: <span class=\"highlight\">Mapping</span> the Planet with Open Source Tools by Gary E. &hellip; ",
            "title": "Seeking QGIS user interface tutorials and web resources"
        },
        {
            "tags": [
                "shapefile",
                "geotools",
                "dbf"
            ],
            "question_score": 61,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 15784,
            "item_type": "question",
            "score": 61,
            "last_activity_date": 1544423400,
            "creation_date": 1318720418,
            "body": "I&#39;m exporting geometry with attached text attributes from oracle database to esri shapefile format (.shp) with Java and Geotools library.\n\nAttribute columns in our database have names with more than 10 characters, and Geotools forces to truncate them. I understand that it&#39;s due to .shp or .dbf files specification.\n\nI can workaround this, by creating some simple txt file with &quot;shrtname&quot;=&quot;The full and long name&quot;, but obviously it won&#39;t be understand and imported by any other software than ours.\n\nIs there official way to do the mapping from short field names to long full-text names?\n\nFor example, xml file next to all other .shp .dbf .shx files.\n",
            "excerpt": "Is there official way to do the <span class=\"highlight\">mapping</span> from short field names to long full-text names?\n\nFor example, xml file next to all other .shp .dbf .shx files. &hellip; ",
            "title": "Bypassing 10 character limit of field name in shapefiles?"
        },
        {
            "tags": [
                "cartography",
                "coordinate-system"
            ],
            "question_score": 60,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 15528,
            "item_type": "question",
            "score": 60,
            "last_activity_date": 1445863653,
            "creation_date": 1318300319,
            "body": "Bit of a strange question but hope this is OK to ask here.\n\nHas anyone heard of a &#39;1-dimensional&#39; projection of the world map - that is mapping all the points on the globe to a single line?\n\nI was thinking of doing such a thing - trying to keep cities that are &#39;close&#39; on the globe &#39;close&#39; on the line. \n\nBefore I do this, I wondered what the state of the art might be in this area? \n",
            "excerpt": "Has anyone heard of a &#39;1-dimensional&#39; projection of the world map - that is <span class=\"highlight\">mapping</span> all the points on the globe to a single line? &hellip; ",
            "title": "One dimensional map of the world?"
        },
        {
            "tags": [
                "coordinate-system",
                "google-maps",
                "distance",
                "spherical-geometry",
                "curvature"
            ],
            "question_score": 59,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 6822,
            "item_type": "question",
            "score": 59,
            "last_activity_date": 1456088947,
            "creation_date": 1299346283,
            "body": "This is the result of mapping the straight line path from a point in US to Poland using Distance Measurement Tool.\n\nAlso, planes from Asia to US would travel almost over North Pole.\n\n\n\nWhy is the path so curved? I agree that this is a flat representation of a sphere, so I do expect some arc, but I don&#39;t think earth has this much curvature.\n\nWhat am I missing here?\n",
            "excerpt": "This is the result of <span class=\"highlight\">mapping</span> the straight line path from a point in US to Poland using Distance Measurement Tool.\n\nAlso, planes from Asia to US would travel almost over North Pole. &hellip; ",
            "title": "Why is the &#39;straight line&#39; path across continent so curved?"
        },
        {
            "tags": [
                "arcgis-server",
                "coordinate-system",
                "google-maps",
                "web-mapping",
                "cartography"
            ],
            "question_score": 56,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 12646,
            "item_type": "question",
            "score": 56,
            "last_activity_date": 1397859127,
            "creation_date": 1311647746,
            "body": "I understand what the difference is between the Web Mercator projection and Web Mercator Auxiliary Sphere (WMAS). I also understand that both Google and Esri have adopted this projection as their primary projection for their web-maps which is why we have specialized functions that not only re-project between all projections, but are specific functions for WM, such as webMercatorToGeographic. So ultimately I was wondering why we use the WMAS projection, and the reason it has become a standard in web mapping. Is it a purely a result of two spatial giants moving in that direction or was it just solely because of accuracy reasons?\n\nAdditional Links:\nMercator Projection\n",
            "excerpt": "So ultimately I was wondering why we use the WMAS projection, and the reason it has become a standard in web <span class=\"highlight\">mapping</span>. &hellip; ",
            "title": "Why has Web Mercator (auxiliary sphere) become the web map standard?"
        },
        {
            "tags": [
                "web-mapping",
                "software-recommendations"
            ],
            "question_score": 47,
            "is_accepted": true,
            "answer_id": 55264,
            "is_answered": false,
            "question_id": 55119,
            "item_type": "answer",
            "score": 56,
            "last_activity_date": 1618917501,
            "creation_date": 1363992585,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\nThere are quite a few alternatives and I&#39;ve actually written a short book on the subject entitled &quot;Online GIS - Meet the Cloud Publication Platforms that Will Revolutionize our Industry&quot; but that&#39;s a little outdated now.\nHere&#39;s an updated summary:\nMangoMap: Very easy to use, no coding required. Lots of tools and functionality available to make really polished map applications. Much more competitive pricing than ArcGIS Online organisational accounts.\nGISCloud: Online alternative to traditional client/server GIS setup. Many features but hampered by a frustrating user interface.\nMapBox: Making maps sexy again. Programmer focused. Great for maps that need to fit a brand and be able to scale for high traffic. Good fit for consumer internet sites.\nCartoDB: Attractive UX and scales very well. Also lets you preserve the Google Maps experience for end users. Postgres + postgis database on the cloud with a set of API&#39;s on top of it to fetch/save and render data.\nDisclosure: Original answer posted by Founder of MangoMaps and includes  an edit by the CTO of CartoDB - these two products are described in this answer.\n\nI&#39;ve had good luck using GeoCommons for more lightweight mapping.\nThe upside is that the service is free within a certain limit, and includes some fairly powerful analysis tools. I believe any mapping is free if using or creating open data, and while my organization did not end up paying for the service, the prices seemed reasonable.\nI didn&#39;t realize until I visited today, though, that this service is now a part of esri, so their terms may have changed.\n",
            "excerpt": "I&#39;ve had good luck using GeoCommons for more lightweight <span class=\"highlight\">mapping</span>.\nThe upside is that the service is free within a certain limit, and includes some fairly powerful analysis tools. &hellip; I believe any <span class=\"highlight\">mapping</span> is free if using or creating open data, and while my organization did not end up paying for the service, the prices seemed reasonable. &hellip; ",
            "title": "Alternatives to ArcGIS Online?"
        },
        {
            "tags": [
                "open-source-gis",
                "software-recommendations",
                "free-software"
            ],
            "question_score": 142,
            "is_accepted": false,
            "answer_id": 23236,
            "is_answered": false,
            "question_id": 12105,
            "item_type": "answer",
            "score": 54,
            "last_activity_date": 1334145388,
            "creation_date": 1334145388,
            "body": "Benjamin already mentioned SAGA GIS, but just the name so I would like to add more info about this excellent SW:\n\nSAGA (System for Automated Geoscientific Analyses)\n\n\n\nSAGA is also free and opensource like QGIS, but it is focused on raster data analysis and processing.\n\nThe standard modules are:\n\n\nFile access: interfaces to various table, vector, image and grid file formats, including shapefiles, Esri grids (ASCII and binary), and numerous grid file formats that are supported by the GDAL library, in addition to the native SGRD format of SAGA GIS.\nFilter for grids: Gaussian, Laplacian, multi-directional Lee filter.\nGridding: interpolation from vector data using triangulation, nearest neighbour, inverse distance. (my favourite is Multilevel B-Spline interpolation)\nGeostatistics: residual analysis, ordinary and universal kriging, single and multiple regression analysis, variance analysis.\nGrid calculator: combine grids through user defined functions.\nGrid discretisation: skeletonisation, segmentation.\nGrid tools: merging, resampling, gap filling.\nImage classification: cluster analysis, box classification, maximum likelihood, pattern recognition, region growing.\nProjections: various coordinate transformations for vector and grid data (using Proj4 and GeoTrans libraries), georeferencing of grids.\nSimulation of dynamic processes: TOPMODEL, nitrogen distributions, erosion, landscape development.\nTerrain analysis: geomorphometrical calculations such as slope, aspect, curvatures, curvature classification, analytical hillshading, sink eliminition, flow path analysis, catchment delineation, solar radiation, channel lines, relative altitudes.\nVector tools: polygon intersection, contour lines from grid.\n\n\nAccording to the users it can partially replace commercial tools like Spatial analyst in ArcGIS and some people say, that the hydrological tools are even better than ArcHydroTools.\n\nIn my opinion it is good choice for people who are not familiar with GRASS and who need user friendly and free solution which can share data with other GIS tools.\n\nI use it together with QGIS and it works really nice - SAGA for raster data, QGIS for vectors and final map finishing and for quick mapping.\n",
            "excerpt": "I use it together with QGIS and it works really nice - SAGA for raster data, QGIS for vectors and final map finishing and for quick <span class=\"highlight\">mapping</span>. &hellip; ",
            "title": "What free programs should every GIS user have installed?"
        },
        {
            "tags": [
                "cartography",
                "coordinate-system"
            ],
            "question_score": 60,
            "is_accepted": true,
            "answer_id": 15567,
            "is_answered": false,
            "question_id": 15528,
            "item_type": "answer",
            "score": 52,
            "last_activity_date": 1318355755,
            "creation_date": 1318355755,
            "body": "A general technique for mapping a collection of points (for which distances are given) into a Euclidean space (such as three-space, a plane, or even a line) with minimal distortion of the distances is called Multidimensional Scaling (MDS).  There are several algorithms.  Solutions are freely available in R and often are supplied with commercial statistics packages.\n\nThe largest 20 cities in the US are mapped here with Stata 11&#39;s default MDS settings.  The ticks denote 100 km intervals.\n\n\n",
            "excerpt": "A general technique for <span class=\"highlight\">mapping</span> a collection of points (for which distances are given) into a Euclidean space (such as three-space, a plane, or even a line) with minimal distortion of the distances is &hellip; ",
            "title": "One dimensional map of the world?"
        },
        {
            "tags": [
                "data",
                "license",
                "china"
            ],
            "question_score": 31,
            "is_accepted": true,
            "answer_id": 320872,
            "is_answered": false,
            "question_id": 320871,
            "item_type": "answer",
            "score": 51,
            "last_activity_date": 1556203811,
            "creation_date": 1556124989,
            "body": "I am not sure if the context of your question is really on-topic here, but since the answer and its implications is very much relevant for travellers as well, I&#39;ll give it a try.\n\nThe explanation you have read is not entirely accurate. The problem is that accurate map material is neither allowed to be published, nor to leave the country. The Chinese National Bureau of Surveying and Mapping require all companies to obtain permits for map surveying and published map data must be obfuscated, resulting in a deviation of up to 700m between the map and the real world. Sounds strange, but that is how it is.\n\nYou can easily see the result of this obfuscation if you e.g. in Google Maps look at the satellite imagery with a map overlay. It is especially obvious in border proximity, where you will see that the map data for China is skewed, while the map outside China is correct. If you look at this area, the Shenzhen Bay with the border between China and Hong Kong, you can see that the map over Hong Kong in the lower right area is correct, while in the middle of the bay, the map seem to indicate that the bridge makes a sharp bend to the right, while you on the satellite image can see that the bridge in reality is straight. In the upper left area (mainland China), you can then see that there is a significant discrepancy between the imagery and the map. Roads seem to float on the water, pass through buildings and what else not.\n\nSome additional information based on questions in the comments:\n\nThe Chinese Surveying and Mapping Law does not explain why the restriction is in place. It is commonly quoted that it is for national security purposes, but I am not really sure if there is any official statement on that subject at all. Similar regulations and restrictions are actually quite common in many other countries as well, but usually do not apply to the entire country, just to &#39;places of interest&#39;.\n\nThe obfuscation algorithm is prespecified, not publicly known, but is obviously deterministic. Since a lot of example data is available, there have been attempts to reverse-engineer the algorithm and there are more or less reliable software libraries available allowing a backwards mapping from obfuscated to real coordinates. There is more information and links to further resources on the Wikipedia page &#39;Restrictions on geographic data in China&#39;.\n",
            "excerpt": "The Chinese National Bureau of Surveying and <span class=\"highlight\">Mapping</span> require all companies to obtain permits for map surveying and published map data must be obfuscated, resulting in a deviation of up to 700m between &hellip; Some additional information based on questions in the comments:\n\nThe Chinese Surveying and <span class=\"highlight\">Mapping</span> Law does not explain why the restriction is in place. &hellip; ",
            "title": "Map material from China not allowed to leave that country"
        },
        {
            "tags": [
                "javascript",
                "web-mapping"
            ],
            "question_score": 138,
            "is_accepted": false,
            "answer_id": 12517,
            "is_answered": false,
            "question_id": 8032,
            "item_type": "answer",
            "score": 50,
            "last_activity_date": 1496478805,
            "creation_date": 1311337554,
            "body": "There is a new player on javascript mapping front - Leaflet. Developed by CloudMade under BSD licence.\n\nLooks really promising.\n\n\n\n(Source)\n",
            "excerpt": "There is a new player on javascript <span class=\"highlight\">mapping</span> front - Leaflet. Developed by CloudMade under BSD licence.\n\nLooks really promising.\n\n\n\n(Source) &hellip; ",
            "title": "Comparing various JavaScript mapping libraries?"
        },
        {
            "tags": [
                "geoserver",
                "cors",
                "jetty"
            ],
            "question_score": 29,
            "is_accepted": true,
            "answer_id": 250433,
            "is_answered": false,
            "question_id": 210109,
            "item_type": "answer",
            "score": 50,
            "last_activity_date": 1571914632,
            "creation_date": 1501430800,
            "body": "Edit the  file. There are two references to CORS in this file:\n\n\n\n\n\nand \n\n\n\n\n\nYou must uncomment both blocks (that is remove  and  from the  and  blocks.\n\nThen when you restart Jetty you can test that everything is working by using a command like:\n\n\n\nwhich if all is well will give a result like:\n\n\n\nUpdate 24th Oct 2019\n\nIt it is no longer necessary to add the following jar to GeoServer (at least with versions 2.13.x and later) and it will cause an error. I&#39;m leaving this note here for people fighting older versions.\n\n\nAdd the Jetty-Utility Servlets Jar to match the version of Jetty - for current versions of GeoServer (2.15.x) it is 9.4.12.v20180830, copy this to  inside the geoserver-2.15.0 directory (or wherever you unpacked the zip file).\n\n",
            "excerpt": "-- Uncomment following filter to enable CORS --&gt;\n&lt;filter-<span class=\"highlight\">mapping</span>&gt;\n   &lt;filter-name&gt;cross-origin&lt;/filter-name&gt;\n   &lt;url-pattern&gt;/*&lt;/url-pattern&gt;\n&lt;/filter-<span class=\"highlight\">mapping</span>&gt;\n\n\n\nYou must uncomment both blocks (that is &hellip; -- and --&gt; from the filter and filter-<span class=\"highlight\">mapping</span> blocks. &hellip; ",
            "title": "Enabling CORS in GeoServer (jetty)?"
        },
        {
            "tags": [
                "qgis"
            ],
            "question_score": 25,
            "is_accepted": true,
            "answer_id": 324165,
            "is_answered": false,
            "question_id": 324163,
            "item_type": "answer",
            "score": 48,
            "last_activity_date": 1559058158,
            "creation_date": 1559058158,
            "body": "When you open  you should see .\n\n\n\nYou need to exit and restart to see the change.\n",
            "excerpt": "When you open Settings-&gt;Options-&gt;General you should see Night <span class=\"highlight\">Mapping</span>.\n\n\n\nYou need to exit and restart to see the change. &hellip; ",
            "title": "Turn on QGIS Dark Mode"
        },
        {
            "tags": [
                "references",
                "education"
            ],
            "question_score": 47,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 17227,
            "item_type": "question",
            "score": 47,
            "last_activity_date": 1511762659,
            "creation_date": 1322139500,
            "body": "This Q&amp;A lists free as in $0 workshops in GIS and related fields that have their material available to view or download online. The list is not limited to FOSS GIS, as GISers usually use a combination of open and closed source tools to accomplish their tasks. Some of these tools are easier than others and some are better documented. This list will be a great benefit to the community especially for new comers to the field.\nGeneral GIS\n\nGIS Project Video Tutorial on Acquiring, Analyzing, and Mapping US Census Data in QGIS from @A.S\nGIS Tutor: Beginner / Intermediate Level GIS from @radek\nBostonGIS from @simo\nLectures on GIS for the Social Sciences from @ubernatural\n\nOpen-source GIS\n\nOpenGEO Education Center from @radek\nQGIS Videos (faunitalia) from @simo\nGIS SE Question: Geoserver Tutorials from @com\nGIS SE Question: Open Source Training Materials from @MarkIreland\nQGIS for Newbies from @IanAllan\n\nESRI Products\n\nGIS SE Question: Best place for (structured) ArcGIS tutorials from @robintw\nArcGIS Automation and Programming from @Bethany\n\nTransportation\nThese links include either theoretical or applied transportation knowledge in transportation planning\n\nGIS primer for Transportation\nTransit Capacity and Quality of Service Manual\nUrbanSim: FOSS Urban development, socio economic, and land use planning package\nMOVES(Motor Vehicle Emission Simulator) Workshop and technical background\nTransit GIS tutorials\nRemote sensing in transportation workshop\nFlorida&#39;s CBT planning model explained\n\nDisaster Management\n\nGeo-information Technology for Crisis Management \n\nDatabases\n\nSpatial Database Course Material from @radek\n\nGeo Statistics\n\nLearn R Lectures and Classes\nGeodatabase Mining Course from @radek\nA Practical Guide to Geostatistical Mapping\n\n",
            "excerpt": "General GIS\n\nGIS Project Video Tutorial on Acquiring, Analyzing, and <span class=\"highlight\">Mapping</span> US Census Data in QGIS from @A.S\nGIS Tutor: Beginner / Intermediate Level GIS from @radek\nBostonGIS from @simo\nLectures on GIS &hellip; for Crisis Management \n\nDatabases\n\nSpatial Database Course Material from @radek\n\nGeo Statistics\n\nLearn R Lectures and Classes\nGeodatabase Mining Course from @radek\nA Practical Guide to Geostatistical <span class=\"highlight\">Mapping</span> &hellip; ",
            "title": "Free GIS workshops, tutorials, and applied learning material"
        },
        {
            "tags": [
                "web-mapping",
                "references"
            ],
            "question_score": 83,
            "is_accepted": false,
            "answer_id": 42636,
            "is_answered": false,
            "question_id": 8113,
            "item_type": "answer",
            "score": 46,
            "last_activity_date": 1699642289,
            "creation_date": 1354247937,
            "body": "Penn State has an Open Web Mapping class. It should be enough to teach you how web mapping works, and also the technologies involved. Most, if not all, of the tools used in the class are free so you cost shouldn&#39;t be a problem. Here&#39;s the Table of Contents:\nlink to course materials\nhttps://www.e-education.psu.edu/geog585/node/508\n\nLesson 0: Orientation\nLesson 1: Introduction to Open Web Mapping\nLesson 2: Web Map Servers (WMS)\nLesson 3: Web Feature Servers (WFS)\nLesson 4: Extensible Markup Language (XML)\nLesson 5: Advanced Web Map Servers\nLesson 6: Geographic Markup Language (GML)\nLesson 7: WFS Revisited\nLesson 8: Building a Web Mapping Application\nLesson 9: Building a Thin Custom Web Mapping Client\n\n",
            "excerpt": "Penn State has an Open Web <span class=\"highlight\">Mapping</span> class. It should be enough to teach you how web <span class=\"highlight\">mapping</span> works, and also the technologies involved. &hellip; Application\nLesson 9: Building a Thin Custom Web <span class=\"highlight\">Mapping</span> Client &hellip; ",
            "title": "How to Start Web Mapping?"
        },
        {
            "tags": [
                "data",
                "geocoding",
                "united-states",
                "centroids"
            ],
            "question_score": 60,
            "is_accepted": true,
            "answer_id": 5121,
            "is_answered": false,
            "question_id": 5114,
            "item_type": "answer",
            "score": 46,
            "last_activity_date": 1492391206,
            "creation_date": 1294942332,
            "body": "ZIP codes are a habitually abused geography.  It&#39;s understandable that people want to use them because they are so visible and well-known but they aren&#39;t well suited to any use outside the USPS.  ZIP codes aren&#39;t associated with polygons, they are associated with carrier routes and the USPS doesn&#39;t like to share those.  Some ZIP codes are points e.g.  a ZIP code may be associated with a post office, a university or a large corporate complex.  They are used to deliver mail.\n\nThe Census Bureau creates ZIP Code Tabulation Areas (ZCTA) based on their address database.  If it&#39;s appropriate to your work you could try taking the centroid of the ZCTAs.  ZCTA Geography from the 2010 Census is available on the Census Bureau website.\n\nSee also: ZIP Code Geography and Mapping \n",
            "excerpt": "See also: ZIP Code Geography and <span class=\"highlight\">Mapping</span> &hellip; ",
            "title": "Obtaining up-to-date list of US ZIP Codes with Latitude and Longitude Geocodes?"
        },
        {
            "tags": [
                "web-mapping",
                "references"
            ],
            "question_score": 83,
            "is_accepted": false,
            "answer_id": 8119,
            "is_answered": false,
            "question_id": 8113,
            "item_type": "answer",
            "score": 42,
            "last_activity_date": 1301952687,
            "creation_date": 1301952687,
            "body": "Google Fusion Tables is looking promising with mapping and spatial queries\n\npros:easy to set up\n\ncons: all your data is on google servers (good? or bad?)\n\nhttp://sites.google.com/site/fusiontablestalks/stories\n\n\n\nNote: Lots of Media/News Companies are using it - Example Guardian UK Newspaper \nhttp://www.guardian.co.uk/environment/datablog/interactive/2011/mar/07/carbon-emissions-public-buildings-map\n\nThere is a neat Fusion Wizard now to get you set up faster\nhttp://gmaps-samples.googlecode.com/svn/trunk/fusiontables/fusiontableslayer_builder.html\n\nExamples:\nhttp://www.latimes.com/news/local/la-me-us-congress-census-map,0,4500533.htmlstory\n\nOne of the best:\nhttp://tinyurl.com/England-Deprivation-Mapped\n",
            "excerpt": "Google Fusion Tables is looking promising with <span class=\"highlight\">mapping</span> and spatial queries\n\npros:easy to set up\n\ncons: all your data is on google servers (good? or bad?) &hellip; ",
            "title": "How to Start Web Mapping?"
        },
        {
            "tags": [
                "tilemill",
                "cartocss"
            ],
            "question_score": 36,
            "is_accepted": true,
            "answer_id": 62824,
            "is_answered": false,
            "question_id": 62348,
            "item_type": "answer",
            "score": 41,
            "last_activity_date": 1474592472,
            "creation_date": 1370465371,
            "body": "Unfortunately, there isn&#39;t one yet. \n\nI&#39;ve asked myself the same thing occasionally but I&#39;ve found a handful of examples through the years that I&#39;ve drawn some inspiration and learned through. Unfortunately, most authors aren&#39;t putting their all or some of their work public. Also, there&#39;s been a couple small changes in carto, some of the code may not be 100% up to date or may not take advantage of carto&#39;s current capabilities and you&#39;ll also have to change things as people use different data types (postgis queries, shapefiles, json, etc) for your needs.\n\nhttps://github.com/andrewharvey/osm-hybrid-carto\n\nhttps://github.com/aaronlidman/Toner-for-Tilemill \n\nhttps://github.com/ajashton/simple-osm\n\nnice Transit map by Code for america participant jlord - https://github.com/codeforamerica/Transit-Map-in-TileMill \n\nhttps://github.com/mapbox/osm-bright - A great way to start learning carto. This is what really helped me to learn carto and I often use it as a base layer for projects or begin with it for a project. \nA fork of it. \n\nLA Times&#39; &#39;Quiet LA&#39; Map style \n\nPandonia - style made by flickr\n\nhttps://github.com/wboykinm/geosprocket-carto\n\nSome examples from Dane Springmeyer, Tilemill and mapnik developer These are very experimental and push the bounds of what can be done in Carto. \n\nA mapping style for humanitarian contexts from HOT, the humanitarian openstreetmap team. \n\nAdditionally, the cartocss port of the OSM default style mentioned by maning is a nice work.\n\nLastly, this one in my github repo is a decent take off of osm-bright as well: \n\nExperimenting with these styles and modifying them will really help you learn. \n\n\n\nCarto is also used in Mapbox-Studio-Classic (aka tilemill2) but the processing of source data is different because it uses vector tiles. You have to first convert your data source into a vector tile source before using it. \n\nThe following styles, written for use in Mapbox-Studio, use Mapbox-Streets as the source data unless noted. \n\nHigh-contrast black and white style similar aesthetics to Ello - viewable here  \n\nVetiver \n\nAn orienteering map made by Rafa of Mapbox - uses external data sources\n\nDarkly-Neon, from Stephen Smith \n\nn\\|/0, a Halloween-themed carto style that I made that uses numerous regular expressions. If you&#39;re looking to understand how to use regular expressions in Carto, this can help. Viewable here. \n\nLastly, as you experiment with Mapbox-streets as a data source, you&#39;ll also learn that some assumptions are baked into the data source. For example, you cannot display some POIs that are nodes in the #poi_label at a zoom level below 15 or 16. \n",
            "excerpt": "A <span class=\"highlight\">mapping</span> style for humanitarian contexts from HOT, the humanitarian openstreetmap team. \n\nAdditionally, the cartocss port of the OSM default style mentioned by maning is a nice work. &hellip; ",
            "title": "Is there a Carto CSS Gallery which also contains code?"
        },
        {
            "tags": [
                "coordinate-system",
                "google-maps",
                "openlayers-2",
                "epsg",
                "bing-maps"
            ],
            "question_score": 45,
            "is_accepted": true,
            "answer_id": 258,
            "is_answered": false,
            "question_id": 253,
            "item_type": "answer",
            "score": 41,
            "last_activity_date": 1315444515,
            "creation_date": 1279913027,
            "body": "This has been an annoying problem for a while, and hopefully will no longer be an issue.  \n\n3857 looks to be the current and correct code (I hope, that&#39;s what all my tile caches are in!).\n\nUpdate 9/7/11 - as noted by Vadim below in comments, Esri did in fact revert back to 102100 from 3857 at Service Pack 1.  Oddly, ArcGIS Server with SP1 applied returns a WKID of 102100 for a web mercator map service, but in the Services Directory, a web mercator map service has a spatial reference of &#39;102100 (3857)&#39;. EPSG has no entry for 102100. Not sure why Esri has chosen this route, but Esri&#39;s 102100 and 3857 are treated as equivalent by their products.\n\nEPSG - (no direct link)\n\n\n  Code: EPSG::2008.114\n  Reporter: OGP\n  Request: Revisit spherical mercator used for some web mapping applications\n  Actions Taken: Deprecated ellipsoid 7059, datum 6055, method 9841, projection 19847, CRSs 4055 and 3785, tfm 15973. Added methods 1024 and 1026, proj 3856 and projCRS 3857.\n  Entity Types Affected: Ellipsoid; Datum; Coordinate Operation Method; Coordinate Operation; Coordinate Reference System\n  Codes Affected: 7059; 6055; 9841; 15973 19847; 4055 3785\n  Report Date (UTC): 2008-12-11\n  Closed Date (UTC): 2009-02-10\n\n\nOpenLayers  - \n\n\n  Today, there is an officially registered EPSG code 3857 whose projection is identical to EPSG:900913. (http://www.epsg-registry.org/export.htm?gml=urn:ogc:def:crs:EPSG::3857). So, if you need to combine overlay layers that are using either an alias or the official EPSG code with an OpenLayers SphericalMercator layer, you have to make sure that OpenLayers requests EPSG:3857 or other alias in stead of EPSG:900913.\n\n\nESRI - \n\n\n  @jamie - For a long time EPSG refused to assign a code to this coordinate system; therefore ESRI created the WKID codes 102113 and 102100.\n  When EPSG did assign a code, they used 3785, but later changed it to 3857. ArcGIS 10 will follow ESRI practice of using an EPSG code when one exists, and will advertise the coordinate system of the service as 3857. ArcGIS 10 and all Web APIs are being designed to recognize EPSG 3857, ESRI WKID 102113, and ESRI WKID 102100 as equivalent.\n\n",
            "excerpt": "EPSG - (no direct link)\n\n\n  Code: EPSG::2008.114\n  Reporter: OGP\n  Request: Revisit spherical mercator used for some web <span class=\"highlight\">mapping</span> applications\n  Actions Taken: Deprecated ellipsoid 7059, datum 6055, method &hellip; ",
            "title": "What is the current Web Mercator projection code?"
        },
        {
            "tags": [
                "web-mapping",
                "references"
            ],
            "question_score": 83,
            "is_accepted": false,
            "answer_id": 55439,
            "is_answered": false,
            "question_id": 8113,
            "item_type": "answer",
            "score": 41,
            "last_activity_date": 1364271556,
            "creation_date": 1364270560,
            "body": "There are so many options out there and many great answers already. Two of my favorite choices that haven&#39;t already been listed here are CartoDB and MapBox. Both of these provide web based hosting and visualization of data and some very fancy tools with prices starting at FREE. \n\nYou&#39;ll benefit from having desktop software to get your data setup. ArcMap and Quantum GIS are both great choices for the desktop part. \n\nI&#39;d say the strength of MapBox is making beautiful web maps with really great, easy to use templates and ready to go user interface elements. MapBox requires a desktop program called TileMill (also free) which makes use of a styling interface very similar to CSS. \n\nThe strength of CartoDB is that it exposes its PostGIS roots through an SQL API. \n\nBoth of these can be used on their own or in combination with other javascript mapping libraries (e.g. Leaflet, Google Maps, OpenLayers).\n\nNo matter which platforms you decide to start using to get into web mapping, you will most certainly benefit from learning some javascript.  Codecademy is a great place to start (also FREE!!).\n",
            "excerpt": "Both of these can be used on their own or in combination with other javascript <span class=\"highlight\">mapping</span> libraries (e.g. Leaflet, Google Maps, OpenLayers). &hellip; No matter which platforms you decide to start using to get into web <span class=\"highlight\">mapping</span>, you will most certainly benefit from learning some javascript.  Codecademy is a great place to start (also FREE!!). &hellip; ",
            "title": "How to Start Web Mapping?"
        },
        {
            "tags": [
                "pyqgis",
                "standalone",
                "qgs"
            ],
            "question_score": 40,
            "is_accepted": true,
            "answer_id": 29597,
            "is_answered": false,
            "question_id": 29580,
            "item_type": "answer",
            "score": 38,
            "last_activity_date": 1342491462,
            "creation_date": 1342403621,
            "body": "You can&#39;t get a reference to the  object here because it doesn&#39;t exist in this context.  The  () object is a convenience object for plugins, or scripts running inside QGIS, to access the main objects e.g. the map canvas, legend, composer, etc, and only exists when the main application is running.\n\nWhen you create a standalone Python script using the QGIS APIs none of this stuff exists because you are making your own mapping application.\n\nThere are three different situations:\n\n\nA QGIS plugin\nA script that runs inside QGIS (not a plugin) for automation\nStandalone app using QGIS APIs\n\n\n and  have access to , the last one doesn&#39;t.\n\nFor  if you want to create a script that opens a layer in a map canvas you would do this after \n\n\n\nHowever if you are really looking for something like  then you can just write this in your script editor \n\n\n\nbut this has to be run inside QGIS for  to work.  That can be done by putting the script on  and running  in the Python console or by using the ScriptRunner plugin.\n\nNote the following isn&#39;t QGIS yet\n\nThere is a number  that hasn&#39;t been added yet, and hopefully will be in the future, and that is the option to run QGIS with a commandline arg to say run this code.\n\nFor example:\n\n\n\nPlugin logging (version 1.8)\n\nYou can use the QgsMessageLog class to log information to the QGIS log window.  The yellow exclamation mark in the bottom right corner.\n\n\n\nor without using lambda\n\n\n\nI prefer the lambda based one as it is shorter and less typing any time you want to log something. \n",
            "excerpt": "When you create a standalone Python script using the QGIS APIs none of this stuff exists because you are making your own <span class=\"highlight\">mapping</span> application. &hellip; ",
            "title": "Running simple Python script for QGIS from outside"
        },
        {
            "tags": [
                "python",
                "shapefile",
                "visualisation",
                "matplotlib"
            ],
            "question_score": 38,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 61862,
            "item_type": "question",
            "score": 38,
            "last_activity_date": 1558220654,
            "creation_date": 1369494836,
            "body": "I wish to visualize geographical data in Python, without using ArcGIS/ArcPy, and make a map. \n\nOn the internet I found how to make a thematic map using Python: \n\nHere is some code that I tried:\n\n\n\nHowever, when I run this, it gives me random colors. \n\nIf I want to visualise one certain column of my shapefile, how can I implement this using similar code? \n\nThis is very unclear in the link provided above where he only discusses the usage of colors...\n\nWould I perhaps need extra modules to accomplish this, like descartes and PySAL?\n",
            "excerpt": "I wish to visualize geographical data in Python, without using ArcGIS/ArcPy, and make a map. \n\nOn the internet I found how to make a thematic map using Python: \n\nHere is some code that I tried:\n\nimpor &hellip; ",
            "title": "Simple thematic mapping of shapefile using Python?"
        },
        {
            "tags": [
                "web-mapping",
                "references"
            ],
            "question_score": 83,
            "is_accepted": false,
            "answer_id": 8116,
            "is_answered": false,
            "question_id": 8113,
            "item_type": "answer",
            "score": 38,
            "last_activity_date": 1499268132,
            "creation_date": 1301951381,
            "body": "I also just attended a conference where they presented the OpenGeo Suite, which is a stack of OpenLayers, GeoServer, GeoExt &amp; PostGIS.  They offer both the &quot;Enterprise Edition&quot; (paid for version with support) or the &quot;Community Edition&quot; (free) versions.\n(Update) OpenGeo Suite is now Boundless Suite.\n\nAnother package that was demonstrated at the conference was GeoMoose, which is a stack of MapServer and OpenLayers.\n\nYou might consider downloading the OSGEO Live DVD, which you can run in a virtual machine environment in case you don&#39;t want to install a bunch of stuff on your machine while testing it out.  It comes pre-packaged with a bunch of different open source GIS software packages, including web mapping tools.\n",
            "excerpt": "It comes pre-packaged with a bunch of different open source GIS software packages, including web <span class=\"highlight\">mapping</span> tools. &hellip; ",
            "title": "How to Start Web Mapping?"
        },
        {
            "tags": [
                "data"
            ],
            "question_score": 55,
            "is_accepted": true,
            "answer_id": 7760,
            "is_answered": false,
            "question_id": 7758,
            "item_type": "answer",
            "score": 38,
            "last_activity_date": 1327621410,
            "creation_date": 1301095774,
            "body": "\nDiego Valle-Jones has done some interesting work analysing and mapping Mexico&#39;s drug war (R code on github). Wikinarco provides webmap interface to some drug related crime statistics in Mexico. \n\n\n\n\nNow interactive map is also available:\n\n\n\n\nThe Economist has also done some mapping of drug related deaths, cartel areas and traffic routes.\n\n\n\n\n\n\n\n\n\nFrench OWNI provides nice web frontend for Wikileak&#39;s diplomatic cables. There seems to be map app, but it didn&#39;t work for me. Telegraph came with a web map as well.\n\n\n\n\n\n\n\nFor Iraq Wikileaks data visualization mentioned already by Kirk there is also interesting visualization from placr. For &#39;nonspatial&#39; browsing check OWNI&#39;s \napp.\nAnd before Iraq, Guardian  and The Atlantic also tried to visualize selection of Afgan Wikileaks data. \n\n\n\n\n\nOWNI provides &#39;nonspatial&#39; browser again. Nai&#39;s MediaWatch team provides spatio-temporal overview of the violence against journalists.\n\n\n\n\n\n\n\nAs for contrast to wars, Vision of Humanity provides interactive map of Global Peace Index.\n\n\n\n\nUpdate 1: Recently stumbled upon Guardian&#39;s visualization of Nato attacks in Libya. \n\n\n\n\n\nUpdate 2: Although not a military conflict per se, London riots start to fit description of this question as well. Slashgeo points to few geovisualizations on the topic. Guardian maps location of suspects, riots against poverty. And GENeSIS analyzes geolocated tweets.\n\n\n\nUpdate 3: Interesting visualization of protected areas &amp; civil conflicts in Democratic Republic of Congo.\n\n\n\nUpdate 4: Somalian Piracy Threat Map 2010 from Wikipedia article.\n\n\n",
            "excerpt": "Diego Valle-Jones has done some interesting work analysing and <span class=\"highlight\">mapping</span> Mexico&#39;s drug war (R code on github). Wikinarco provides webmap interface to some drug related crime statistics in Mexico. &hellip; Now interactive map is also available:\n\n\n\n\nThe Economist has also done some <span class=\"highlight\">mapping</span> of drug related deaths, cartel areas and traffic routes. &hellip; ",
            "title": "The GIS of War - Tracking Conflicts and Their Effects"
        },
        {
            "tags": [
                "arcgis-server",
                "coordinate-system",
                "google-maps",
                "web-mapping",
                "cartography"
            ],
            "question_score": 56,
            "is_accepted": true,
            "answer_id": 12649,
            "is_answered": false,
            "question_id": 12646,
            "item_type": "answer",
            "score": 35,
            "last_activity_date": 1311691018,
            "creation_date": 1311653731,
            "body": "I&#39;m pretty sure we have Google to thank. Take a look at the original EPSG code WKID for Web Mercator. What does 900913 look like? Helps if you&#39;re at least a little l33t.\n\nWhen Google Maps blew up a few years ago (2005ish), everyone started copying Google. This included Virtual Earth/Bing, Mapquest, Yahoo Maps and eventually Esri. Everyone wanted/needed to be compatible with the most popular web mapping platform. It has been the standard ever since.\n\nEdit:  per mkennedy&#39;s comment, changed EPSG code to WKID\n",
            "excerpt": "Everyone wanted/needed to be compatible with the most popular web <span class=\"highlight\">mapping</span> platform. It has been the standard ever since.\n\nEdit:  per mkennedy&#39;s comment, changed EPSG code to WKID &hellip; ",
            "title": "Why has Web Mercator (auxiliary sphere) become the web map standard?"
        },
        {
            "tags": [
                "shapefile",
                "ogr",
                "shapely",
                "point-in-polygon"
            ],
            "question_score": 22,
            "is_accepted": true,
            "answer_id": 208574,
            "is_answered": false,
            "question_id": 208546,
            "item_type": "answer",
            "score": 35,
            "last_activity_date": 1472316912,
            "creation_date": 1472296839,
            "body": "Shapefiles have no type MultiPolygon (type = Polygon), but they support them anyway (all rings are stored in one feature = list of polygons, look at Converting huge multipolygon to polygons)\n\nThe problem\n\n\n\nIf I open a MultiPolygon shapefile, the geometry is &#39;Polygon&#39; \n\n\n\nSolution 1 with Fiona\n\n\n\nFiona interprets the feature as a MultiPolygon and you can apply the solution presented in More Efficient Spatial join in Python without QGIS, ArcGIS, PostGIS, etc (1)\n\n\n\nSolution 2 with pyshp (shapefile) and the  geo_interface  (GeoJSON like) protocol\n\nThis is a supplement to the answer of xulnik. \n\n\n\nSolution 3 with ogr and the geo_interface protocol (Python Geo_interface applications)\n\n\n\nSolution 4 with GeoPandas as in More Efficient Spatial join in Python without QGIS, ArcGIS, PostGIS, etc (2)\n\n\n\nThe points 1,3,5,6 falls within the boundaries of the MultiPolygon\n",
            "excerpt": "fiona.open(&quot;multipol.shp&quot;)\nmultipolys.schema\n{&#39;geometry&#39;: &#39;Polygon&#39;, &#39;properties&#39;: OrderedDict([(u&#39;id&#39;, &#39;int:10&#39;)])}\nlen(multipolys)\n1\n\n\nSolution 1 with Fiona\n\nimport fiona\nfrom shapely.geometry import shape,<span class=\"highlight\">mapping</span> &hellip; ",
            "title": "Check if a point falls within a multipolygon with Python"
        },
        {
            "tags": [
                "python",
                "shapefile",
                "shapely"
            ],
            "question_score": 39,
            "is_accepted": false,
            "answer_id": 52706,
            "is_answered": false,
            "question_id": 52705,
            "item_type": "answer",
            "score": 35,
            "last_activity_date": 1507623359,
            "creation_date": 1361595958,
            "body": "I&#39;ve designed Fiona to work well with Shapely. Here is a very simple example of using them together to &quot;clean&quot; shapefile features: \n\n\n\nFrom https://github.com/Toblerity/Fiona/blob/master/examples/with-shapely.py.\n",
            "excerpt": "Here is a very simple example of using them together to &quot;clean&quot; shapefile features: \n\nimport logging\nimport sys\n\nfrom shapely.geometry import <span class=\"highlight\">mapping</span>, shape\n\nimport fiona\n\nlogging.basicConfig(stream=sys.stderr &hellip; clean = geom.buffer(0.0)\n                    assert clean.is_valid\n                    assert clean.geom_type == &#39;Polygon&#39;\n                    geom = clean\n                f[&#39;geometry&#39;] = <span class=\"highlight\">mapping</span> &hellip; ",
            "title": "Writing Shapely geometries to shapefiles"
        },
        {
            "tags": [
                "references"
            ],
            "question_score": 35,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 37,
            "is_answered": true,
            "question_id": 927,
            "item_type": "question",
            "score": 35,
            "last_activity_date": 1420382057,
            "creation_date": 1281196832,
            "body": "Programmers&#39; list has been a pleasure to read. Stats&#39; list is growing fast as well. So perhaps there is a place for separate one on this site?\n\nPlease share your nuggets of wisdom / humour / inspiration from the world of GIS, cartography and mapping.\n",
            "excerpt": "Please share your nuggets of wisdom / humour / inspiration from the world of GIS, cartography and <span class=\"highlight\">mapping</span>. &hellip; ",
            "title": "Great GIS, maps &amp; cartography quotes"
        },
        {
            "tags": [
                "point",
                "spatial-statistics",
                "visualisation",
                "gis-principle"
            ],
            "question_score": 44,
            "is_accepted": true,
            "answer_id": 4490,
            "is_answered": false,
            "question_id": 4484,
            "item_type": "answer",
            "score": 34,
            "last_activity_date": 1322583727,
            "creation_date": 1292520879,
            "body": "As always, it depends on your objectives and the nature of the data.  For completely mapped data, a powerful tool is Ripley&#39;s L function, a close relative of Ripley&#39;s K function.  Lots of software can compute this.  ArcGIS might do it by now; I haven&#39;t checked.  CrimeStat does it.  So do GeoDa and R.  An example of its use, with associated maps, appears in\n\nSinton, D. S. and W. Huber. Mapping polka and its ethnic heritage in the United States. Journal of Geography Vol. 106: 41-47. 2007\n\nHere is a CrimeStat screenshot of the &quot;L function&quot; version of Ripley&#39;s K:\n\n\n\nThe blue curve documents a very non-random distribution of points, because it does not lie between the red and green bands surrounding zero, which is where the blue trace for the L-function of a random distribution should lie.\n\nFor sampled data, much depends on the nature of the sampling.  A good resource for this, accessible to those with limited (but not entirely absent) background in math and stats, is Steven Thompson&#39;s textbook on Sampling.\n\nIt is generally the case that most statistical comparisons can be illustrated graphically and all graphical comparisons correspond to or suggest a statistical counterpart.  Therefore any ideas you get from the statistical literature are likely to suggest useful ways to map or otherwise graphically compare the two datasets.\n",
            "excerpt": "<span class=\"highlight\">Mapping</span> polka and its ethnic heritage in the United States. &hellip; ",
            "title": "Comparing two spatial point patterns?"
        },
        {
            "tags": [
                "postgis"
            ],
            "question_score": 32,
            "is_accepted": true,
            "answer_id": 26092,
            "is_answered": false,
            "question_id": 26082,
            "item_type": "answer",
            "score": 34,
            "last_activity_date": 1337849489,
            "creation_date": 1337849489,
            "body": "You can find your answer in &quot;PostGIS in Action&quot;, from Regina O. Obe and Leo S. Hsu, Edited by Manning\n\nThe difference from geometry and geographyc type:\n\n\n  &quot;PostGIS 1.5 introduced a new spatial type called geography, which uses geodetic\n  measurement instead of Cartesian measurement. Coordinate points in the geography\n  type are always represented in WGS 84 lon lat degrees (SRID 4326), but measurement\n  functions and relationships ST_Distance, ST_DWithin, ST_Length, and ST_Area always\n  return answers in meters or assume inputs in meters.&quot;\n\n\nWhat is best to use? It depends:\n\n\n  &quot;When choosing between the geometry and geography type for data storage, you should consider what you’ll be using it for. If all you do are simple measurements and relationship checks on your data, and your data covers a fairly large area, then most likely you’ll be better off storing your data using the new geography type. Although the new geography data type can cover the globe, the geometry type is far from obsolete. The geometry type has a much richer set of functions than geography, relationship checks are generally faster, and it has wider support currently across desktop and web-mapping tools.&quot;\n\n\nAlso, take a look in an already answered question here.\n",
            "excerpt": "The geometry type has a much richer set of functions than geography, relationship checks are generally faster, and it has wider support currently across desktop and web-<span class=\"highlight\">mapping</span> tools.&quot; &hellip; ",
            "title": "What is the Difference between Geometric and Geographic columns?"
        },
        {
            "tags": [
                "software-recommendations",
                "android",
                "mobile-gis"
            ],
            "question_score": 64,
            "is_accepted": false,
            "answer_id": 12513,
            "is_answered": false,
            "question_id": 12452,
            "item_type": "answer",
            "score": 34,
            "last_activity_date": 1629445287,
            "creation_date": 1311335253,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\n\nGPSLogger for Android is a lightweight GPS logger with lots of useful tweaks [control over time/distance of logs, OSM integration, auto email of tracks, and easy on your battery].\nEpiCollect developed at Imperial College London together with web based management tools looks as really good option for data collection (more info here).\nOpen Data Kit (ODK) also looks very promising on data collection front. Check for instance ODK, GeoServer, Leaflet combo.\nAntiMap - was newcomer to the market, accompanied by desktop package that can synchronize with video. Currently it&#39;s website is unresponsive.\nFunf Journal - part of Funf Open Sensing Framework developed by MIT Media Lab\nGIS Cloud&#39;s Mobile Data Collection for Android. Another data collection tool.\nOpenPaths - yet another data collection option from New York Times Company\nInput App: QGIS in your pocket - Free and open source iOS/Android app designed to streamline the whole process behind geo-surveys by Lutra Contsulting Ltd.\nQField for QGIS (Former QGIS on Android) is a very active project and is now at version 1.0:\nBlog: http://opengis.ch/\nFrom an answer deleted for recommending the same software as this one:\n\n\nI like QGIS for android as it accepts both esri shape files and\nmapinfo tab files, and you can do thematic mapping as well as\ndisplaying geotiffs. You can edit shape files easily and use the built\nin gps if you have one, however it crashes my tablet if you are not\nlocated within the bounds of the map. Otherwise it is excellent and\nthe devs are working on python compatibility meaning you will be able\nto use google and bing maps as well as open streets etc.\nThe main issues are that the gui is designed for  a standard screen\nand all the buttons and icons are tiny on anything smaller than a 10&quot;\nscreen.\nFor basic navigation and data entry on a custom map, i was using\navenzas&#39; pdf maps on iOs, which imports geo-registered PDFs. They have\na beta for android which I haven&#39;t used but am planning on trialling.\nyou can make geo-registered pdfs in mapinfo or arcmap.\n\n\nSo far I have settled on collecting KML based vector data with limited attribution.\nApps I have used:\n\nLocus (free and paid version) https://market.android.com/details?id=menion.android.locus&amp;feature=related_apps\nOruxMaps https://market.android.com/details?id=com.orux.oruxmaps\nGoogle Tracks (pre-installed on my phone)\n\nLocus and Orux allow connecting to WMS services, Google/Bing, etc... I believe there is a separate add-on to allow Google maps in Locus.\n\nI came across this interesting application that looks (have not used it) interesting for collection of data.\nhttp://code.google.com/p/geopaparazzi/\nSome more info:\nGeopaparazzi is a tool developed to do very fast qualitative engineering/geologic surveys. Even if the main aim is in the field of surveying, it contains tools that can be of great use also to OpenStreetMappers as well as tourists that want to keep a geo-diary. Geopaparazzi is available on the Android Market.\nTo get started jump into the documentation section: https://code.google.com/p/geopaparazzi/wiki/Docs\nThe main aim of Geopaparazzi is to have a tool that:\n\nfits in any pocket and can be always at hand, when needed\ngives the possibility to take georeferenced and possibly orientated pictures during the survey, with further possibility to import them into the main GIS application BeeGIS\nis able to exploit easily internet connection, if available.\nis extremely easy to use and intuitive, providing just few important functionalities.\n\nThe main features available in Geopaparazzi are:\n\ngeoreferenced notes\ngeoreferenced and orientated pictures\ngps tracks logging\neasy export of collected data\na map view for the navigation of the environment\n\nThis recent presentation might give more insight: http://www.slideshare.net/moovida/geopaparazzi-state-of-the-art\n\nWe develop a mobile GIS solution for Android tablets called Mappt, which has a free trial available from the Google Play store.  The trial version allows you access to all functionality of the software, with the exception that you can not export your data.\nYou can grab the trial for free from the Google Play Store:\nhttps://play.google.com/store/apps/details?id=au.com.mappt\nWith Mappt, you can:\n\nCapture and work with your vector data offline.\nImport and export in Shapefile and KML formats.\nWork with WGS84 and UTM-based Coordinate Reference Systems.\nImport directly from Google Drive and export to email.\nImport your own large imagery, fully available offline, via the ArcGIS Compact Cache Bundle format.  We are also actively implementing other options to import imagery.\nRecord GPS paths.\nDefine geofences, with audible and visual alerts.\n\nSee the Mappt website for further information: www.mappt.com.au\n\n\n\nFulcrum is a cost-effective and customizable GIS mobile data collection platform. Includes a 30-day trial at sign up!\nhttp://fulcrumapp.com/\nhttps://play.google.com/store/apps/details?id=com.spatialnetworks.fulcrum&amp;hl=en\n\n\nI&#39;m working on this and I have just published a GIS application: ItacaMap for Android ( https://play.google.com/store/apps/details?id=com.itacasoft.itacamap ). At the moment you can see basic functionality (zoom, pan, view info, browse, select by rectangle, etc.), but I have already implemented edit functionalities (at least on the server side) and more is cooking.\n\nGeospago is a new application.  It is a software-as-a-solution (SaaS) because it has a mobile application working in conjunction with a web application.  Both may be used for collecting/inputting data, editing/updating data, viewing/sharing data, and importing/exporting data.  The web portal runs on amazon with geoserver and syncs with the android app, which uses SQLite.\nThe web portal is used to invite/manage users, control user access to projects, create projects and custom forms, deploy the forms to users, and manage data.  It can import SHP &amp; CSV files for data maintenance workflows.  It can export data to the standard formats (CSV, KML, SHP), but aslo provides feeds and an API.  This allows users to add a WFS feed to ArcMap or QGIS to see the data live from the cloud, a network link to Google Earth, or create your own script to pull the data through API requests to integrate with other systems.  Collecting data is easy as well as quickly getting new or updated data back into a enterprise system of record.  Geospago is the only app I have seen so far that provides this.\nThe mobile app is used to collect, view, and edit data (point, line, and polygon).  It runs on both phones and tablets.  It handles connected and disconnected environments through the use of mbtiles.  It allows multiple photos to be attached to a single record.  It also has barcode scanning and signature capabilities.  Synchronization is set to user specified intervals or can be manually forced.  This prevents overlap and duplication if you have multiple people collecting data for the same projects in connected areas.\nGeospago is very affordable and available on a monthly, per-license pricing model that it can be frozen between projects or cancel-at-any-time basis so you can use it only when you need it.  Data is secure on Amazon cloud and can be download it at any time.\nThe Geospago website has more information and has a sign up link.  The website also has a link to the mobile app on the Google Play Store.\n\nFound an app called MapItFast that is easy to use.  A free version that lets you gather point, line, polygon features and even photos.  I&#39;ve used it for its basemaps and to calculate distance and area.  Unfortunately, the data stays on the device (no way to export or share..that I can find) without upgrading to the cloud services.  But that looks interesting since data can be exported to CSV, GPX, SHP and KMZ, it has built in synchronization to collaborate on mapping and location, full attribution, editing, and probably a bunch of other stuff I don&#39;t know about yet.  Might be useful to those folks doing group mapping on an Android and wanting a way to get it into Google Maps or ArcGIS.  I like the idea of a low cost Internet Map Server and tools.\nTheir website (http://www.mapitfast.com) has YouTube video.  I downloaded from Google Play.  Found the brochure online:\nhttp://www.mapitfast.com/Documents/MIF_Brochure_2013.pdf\n",
            "excerpt": "http://opengis.ch/\nFrom an answer deleted for recommending the same software as this one:\n\n\nI like QGIS for android as it accepts both esri shape files and\nmapinfo tab files, and you can do thematic <span class=\"highlight\">mapping</span> &hellip; Might be useful to those folks doing group <span class=\"highlight\">mapping</span> on an Android and wanting a way to get it into Google Maps or ArcGIS.  I like the idea of a low cost Internet Map Server and tools. &hellip; ",
            "title": "Seeking Mobile GIS applications for Android Tablets?"
        },
        {
            "tags": [
                "r",
                "spatial-statistics"
            ],
            "question_score": 34,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 35159,
            "item_type": "question",
            "score": 34,
            "last_activity_date": 1374245479,
            "creation_date": 1349588947,
            "body": "I am after a description/methodology for conducting a Geographically Weighted Principal Components Analysis (GWPCA). I am happy using Python for any portion of this and I imagine SPSS or R being used to run the PCA on the geographically weighted variables.\n\nMy dataset is composed of roughly 30 independent variables that are measured throughout ~550 census tracts (vector geometry).\n\nI know this is a loaded question. But, as I search and search, there does not seem to be any solutions out there. What I have come across are mathematical equations that explain the fundamental composition of GWPCA (and GWR). What I am after is more applied in a sense, that I am looking for what major steps I need to accomplish to get from raw data to the GWPCA results.\n\n\n\nI would like to expand on the first part with this edit due to the comments received below.\n\nTo address Paul...\n\nI am basing my interest in GWPCA off of the following paper:\n\nLloyd, C. D., (2010). Analysing population characteristics using geographically weighted principal components analysis: A case study of Northern Ireland in 2001. Computers, Environment and Urban Systems, 34(5), p.389-399.\n\nFor those who do not have access to the literature, I have attached screenshots of the particular sections which explain the mathematics below:\n\n\n\nAnd to address whuber...\n\nWithout going into detail (confidentiality), we are attempting to reduce the 30 variables, which we believe are all very good indicators (albeit globally), to the set of components with eigenvalues greater than 1. By computing the geographically weighted components, we attempt to understand the local variances explained by these components.\n\nI think our primary goal will be to proof the concept of GWPCA, that is, show the spatially explicit nature of our data and that we cannot consider all independent variables to be explanatory on a global scale. Rather, the local scale (neighbourhoods) that each component will identify will aid us in understanding the multi-dimensional nature of our data (how variables can be combined with one another to explain a certain neighbourhoods in our study area).\n\nWe hope to map the percentage of variance accounted for by each component (separately), to understand the extent of the neighbourhood explained by the component in question (aid us in understanding local spatiality of our components). Perhaps some other mapping examples but none come to mind at the moment.\n\nAdditionally:\n\nThe mathematics behind the GWPCA is beyond what I understand given my background in geographic analysis and social statistics. The application of the maths is most important, that is, what do I plug in to these variables/formulas.\n",
            "excerpt": "Perhaps some other <span class=\"highlight\">mapping</span> examples but none come to mind at the moment. &hellip; ",
            "title": "How can I conduct Geographically Weighted Principal Component Analysis using ArcGIS, Python and SPSS/R?"
        },
        {
            "tags": [
                "google-maps",
                "kml"
            ],
            "question_score": 33,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 9902,
            "item_type": "question",
            "score": 33,
            "last_activity_date": 1461372035,
            "creation_date": 1305747575,
            "body": "Our web app includes simple mapping capabilities (currently just markers and KML overlays on an embedded Google Map). This works pretty well; the only real limitation we face is KML overlays that go beyond Google&#39;s size &amp; complexity restrictions for KML. \n\nWe&#39;re considering standing up our own server (e.g. GeoServer or ArcGIS Server); but that seems like a huge step just to serve up (for example) 15 MB of KML when Google&#39;s limit is 10 MB.\n\nI need a sanity check: Is there some middle ground between Google&#39;s free and easy API for KML overlays, and setting up my own tile server? \n",
            "excerpt": "Our web app includes simple <span class=\"highlight\">mapping</span> capabilities (currently just markers and KML overlays on an embedded Google Map). &hellip; ",
            "title": "What&#39;s next if our KML is too big/complex for the Google Maps API?"
        },
        {
            "tags": [
                "versioning",
                "version-control"
            ],
            "question_score": 33,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 61978,
            "item_type": "question",
            "score": 33,
            "last_activity_date": 1565487073,
            "creation_date": 1369688297,
            "body": "Not that I am in any immediate need of a right answer here, but I&#39;ve lately seen some efforts to introduce the concept of &quot;(distributed) version control systems&quot; for geographic data. Some examples (that I know of) are the three whitepapers from OpenGeo (1, 2 &amp; 3) and the &quot;Geosynkronisering (geosyncronization)&quot; project by Norwegian GIS Software vendors and the Norwegian Mapping Agency. I&#39;ve also found Distributed versioning of geospatial data?, which mentions GeoGit (by OpenGeo), and Applying version control to ArcGIS ModelBuilder models? about version control in ArcGIS.\n\nBeing a developer I know (at least enough to be able to use them) how version control systems for source code (like SVN and Git) works, and my background in geomatics tells me that there are some unique challenges with geographical data that makes the approach not completely similar to the way source code (which is basically text) are handled.\n\nWhat are the challenges when dealing with (d)VCS&#39;es for geographical data, how would you solve them, do we need them and are there other attempts to solve these issues than the ones I have mentioned?\n\nI know that the OpenGeo whitepapers will answer some of my questions, but what I&#39;m really is after is a more &quot;pedagogical&quot; answer, in the style of &quot;tell me like I&#39;m a 10-year-old&quot;, so that I can refer people to a great explanation of the challenges and solutions that geographical data brings to the mix.\n\nI hope that someone with some insight will take time to provide some thoughts on the matter, as I said I&#39;m not currently looking to solve a particular problem, but this topic is one that interests me. \n",
            "excerpt": "Some examples (that I know of) are the three whitepapers from OpenGeo (1, 2 &amp; 3) and the &quot;Geosynkronisering (geosyncronization)&quot; project by Norwegian GIS Software vendors and the Norwegian <span class=\"highlight\">Mapping</span> Agency &hellip; ",
            "title": "Implementing version control system for geospatial data?"
        },
        {
            "tags": [
                "web-mapping",
                "development",
                "career"
            ],
            "question_score": 33,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 5083,
            "item_type": "question",
            "score": 33,
            "last_activity_date": 1554720482,
            "creation_date": 1294873183,
            "body": "I am a GIS Analyst at work that dabbles in python scripting in ArcGIS and the Google Maps JavaScript API V3.  \n\nMy professional goal is to either be in web mapping development or desktop/server GIS application development.  \n\nI have seem to hit a plateau and I am not sure how to progress with my learnings or professionally to reach my goal.  \n\nI ask those of you out there that made the jump from technician/analyst how did you do it? \n\nHow can I land a job in web mapping/application development with little to no experience.\n",
            "excerpt": "My professional goal is to either be in web <span class=\"highlight\">mapping</span> development or desktop/server GIS application development. &hellip; How can I land a job in web <span class=\"highlight\">mapping</span>/application development with little to no experience. &hellip; ",
            "title": "Switching career from GIS Technician/Analyst to GIS Web Map Developer/Programmer?"
        },
        {
            "tags": [
                "references",
                "medical-geography"
            ],
            "question_score": 33,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 13,
            "is_answered": true,
            "question_id": 3188,
            "item_type": "question",
            "score": 33,
            "last_activity_date": 1482533189,
            "creation_date": 1288868436,
            "body": "It&#39;s become pretty much a custom to start spatial epidemiology or medical geography textbook / lecture with an example of John Snow&#39;s cholera investigation in 1854 Soho.\n\n\n\nHe&#39;s definitely still remembered in the current literature and even appeared on top answer to a recent question on this site.\n\nCould you give some recent examples where mapping, GIS or spatial analysis provided significant contribution to understanding and explaining an epidemiological issue?\n",
            "excerpt": "Could you give some recent examples where <span class=\"highlight\">mapping</span>, GIS or spatial analysis provided significant contribution to understanding and explaining an epidemiological issue? &hellip; ",
            "title": "Can you point me to an example of a modern-day John Snow?"
        },
        {
            "tags": [
                "polygon",
                "geopandas",
                "vertices",
                "order"
            ],
            "question_score": 19,
            "is_accepted": true,
            "answer_id": 287314,
            "is_answered": false,
            "question_id": 287306,
            "item_type": "answer",
            "score": 32,
            "last_activity_date": 1647803135,
            "creation_date": 1529761285,
            "body": "Not sure if one line method exists, but the following ways could work. (Solutions are for the first feature&#39;s geometry, and they are just for , not for )\nSolution 1:  property of a polygon returns exterior and all interiors of the polygon.\n\n\nResult:\n\n\nSolution 2:  returns  object which consists of  objects.\n\nResult:\n\n\nSolution 3:  function returns the GeoJSON-like mapping of a geometric object.\n\nResult:\n\n",
            "excerpt": ".]]])#9\n\n\nSolution 3: shapely.geometry.mapping function returns the GeoJSON-like <span class=\"highlight\">mapping</span> of a geometric object.\nimport geopandas as gpd\nfrom shapely.geometry import <span class=\"highlight\">mapping</span>\n    \ndf = gpd.read_file(&#39;/home &hellip; /bera/geodata/Rectangle_with_hole.shp&#39;)\n\ng = [i for i in df.geometry]\ngeojson_ob = <span class=\"highlight\">mapping</span>(g[0]) # for first feature/row\nall_coords = geojson_ob[&quot;coordinates&quot;]\nall_coords\n\nResult:\n(((0.0, 0.0), (0.0, 4.0 &hellip; ",
            "title": "Listing all polygon vertices coordinates using GeoPandas"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcgis-10.0",
                "dem",
                "srtm"
            ],
            "question_score": 19,
            "is_accepted": true,
            "answer_id": 40464,
            "is_answered": false,
            "question_id": 14750,
            "item_type": "answer",
            "score": 32,
            "last_activity_date": 1498226925,
            "creation_date": 1352237612,
            "body": "This seems like a good place to describe a simple, fast, and more than reasonably accurate way to compute slopes for a globally extensive DEM.\nPrinciples\nRecall that the slope of a surface at a point is essentially the largest ratio of &quot;rise&quot; to &quot;run&quot; encountered at all possible bearings from that point. The issue is that when a projection has scale distortion, the values of &quot;run&quot; will be incorrectly computed. Even worse, when the scale distortion varies with bearing--which is the case with all projections that are not conformal--how the slope varies with bearing will be incorrectly estimated, preventing accurate identification of the maximum rise:run ratio (and skewing the calculation of the aspect).\nWe can solve this by using a conformal projection to ensure that the scale distortion does not vary with bearing, and then correcting the slope estimates to account for the scale distortion (which varies from point to point throughout the map).  The trick is to use a global conformal projection that allows a simple expression for its scale distortion.\nThe Mercator projection fits the bill: assuming scale is correct at the Equator, its distortion equals the secant of the latitude.  That is, distances on the map appear to be multiplied by the secant.  This causes any slope calculation to compute rise:(sec(f)*run) (which is a ratio), where f is the latitude.  To correct this, we need to multiply the computed slopes by sec(f); or, equivalently, divide them by cos(f).  This gives us the simple recipe:\n\nCompute the slope (as rise:run or a percent) using a Mercator projection, then divide the result by the cosine of the latitude.\n\nWorkflow\nTo do this with a grid given in decimal degrees (such as an SRTM DEM), perform the following steps:\n\nCreate a latitude grid.  (This is just the y-coordinate grid.)\n\nCompute its cosine.\n\nProject both the DEM and the cosine of the latitude using a Mercator projection in which scale is true at the Equator.\n\nIf necessary, convert the elevation units to agree with the units of the projected coordinates (usually meters).\n\nCompute the slope of the projected DEM either as a pure slope or a percent (not as an angle).\n\nDivide this slope by the projected cosine(latitude) grid.\n\nIf desired, reproject the slope grid to any other coordinate system for further analysis or mapping.\n\n\nThe errors in the slope calculations will be up to 0.3% (because this procedure uses a spherical earth model rather than an ellipsoidal one, which is flattened by 0.3%).  That error is substantially smaller than other errors that go into slope calculations and so can be neglected.\n\nFully global calculations\nThe Mercator projection cannot handle either pole.  For work in polar regions, consider using a polar Stereographic projection with true scale at the pole.  The scale distortion equals 2 / (1 + sin(f)).  Use this expression in place of sec(f) in the workflow. Specifically, instead of computing a cosine(latitude) grid, compute a grid whose values are (1 + sin(latitude))/2 (edit: use -latitude for the South Pole, as discussed in the comments).  Then proceed exactly as before.\nFor a complete global solution, consider breaking the terrestrial grid into three parts--one around each pole and one around the equator--, performing a slope calculation separately in each part using a suitable projection, and mosaicing the results.  A reasonable place to split the globe is along circles of latitude at latitudes of 2*ArcTan(1/3), which is about 37 degrees, because at these latitudes the Mercator and Stereographic correction factors are equal to each other (having a common value of 5/4) and it would be nice to minimize the sizes of the corrections made.  As a check of the computations, the grids should be in very close agreement where they overlap (tiny amounts of floating point imprecision and differences due to resampling of the projected grids ought to be the only sources of discrepancies).\nReferences\nJohn P. Snyder, Map Projections--A Working Manual.  USGS Professional Paper 1395, 1987.\n",
            "excerpt": "If desired, reproject the slope grid to any other coordinate system for further analysis or <span class=\"highlight\">mapping</span>. &hellip; ",
            "title": "Using SRTM Global DEM for Slope calculation"
        },
        {
            "tags": [
                "web-mapping",
                "references"
            ],
            "question_score": 83,
            "is_accepted": false,
            "answer_id": 120550,
            "is_answered": false,
            "question_id": 8113,
            "item_type": "answer",
            "score": 32,
            "last_activity_date": 1659365155,
            "creation_date": 1414792735,
            "body": "Edit\nDue to the popularity of this question and answer, I am adding editing some content on this post due to changes with providers and APIs over the past several months.\n\nI recently stumbled upon this website, which also provides some metrics on different software platforms in this area.\n\nAPI choice is related to the scope and purpose of your project, not to mention your budget if you in fact want to use some specific functionality.  The other major caveat is your web development experience, and what language you prefer or have an interest in.\nI think the best way to answer your question is to provide a nice listing of API&#39;s available to you.  Here are three that come to mind.  These are not by any means all of them!\nArcGIS\nAPIs:\n\nJavaScript\nEsri Leaflet\nSilverlight (please see this blog post on last release notes)\nFlex (please see this blog post on last release notes)\n.NET\n...and more (see here)\n\nPros:\n\nThe Experience Builder solution provides one of the most dynamic non-coding web application building experience on the market\nThe Web AppBuilder has made creating web map applications very simple for those not well-versed in web development\nEasy to use application builders (Flex, Silverlight, and JavaScript, just be mindful of the deprecation plans)\nExpansive online forums (Plenty of Stack Exchange Posts)\nWith many solutions available within the ArcGIS stack that require little to no development work, ArcGIS can also be a good choice for deploying solutions in a timely manner.\nGitHub repositories for many of the solutions\n\nCons:\n\nPrice (not for use of API&#39;s, but more-so if you want to publish your own data, also see ArcGIS Online)\nCustomizing application code can be cumbersome\n\nSummary:\nArcGIS has a lot to offer for web GIS products, and has many resources to help you along the way.  Just be aware of the potential costs you run into when wanting to publish your own data.\nGoogle\nAPIs:\n\nJavaScript\nMobile (Android, iOS)\n\nPros:\n\nBy far the most recognized name in web mapping\nExpansive JavaScript API\nMany online samples\nRecently, Google released their Pricing and Plans, which is a great breakdown of services offered\n\nCons:\n\nPotential licensing issues (read up on the terms of service)\nRestrictions on web services\n\nSummary:\nGoogle has a strong name in the market and pretty reliable online services.  Just be sure to understand the ins and outs of their usages, so you don&#39;t step on any legal toes.  The new Pricing and Plans page is quite helpful in that regard.\nOpen Source\nAPIs (all JavaScript based):\n\nLeaflet\nOpenLayers\nGeoServer\n\nPros:\n\nVery easy to use and completely free\nEver growing API\nEver growing developer base with custom plugins being published all the time\nTutorials for beginners\n\nCons:\n\nOfficial support is not as well known BUT the community involved is more than helpful (perhaps even better than commercial GIS support)\n\nSummary:\nOpen Source is truly a great option for anyone who wants to test the waters of Web GIS.  With changes and enhancements made every day in the community, open source can be the inexpensive way to address your geospatial needs.\n\nAs I said, this is not all of the choices you have, but at least now there is a post with links for yourself and others to get familiar with some of the major players in the Web GIS world.\n",
            "excerpt": "Google\nAPIs:\n\nJavaScript\nMobile (Android, iOS)\n\nPros:\n\nBy far the most recognized name in web <span class=\"highlight\">mapping</span>\nExpansive JavaScript API\nMany online samples\nRecently, Google released their Pricing and Plans, which &hellip; ",
            "title": "How to Start Web Mapping?"
        },
        {
            "tags": [
                "openstreetmap",
                "google-maps",
                "crowdsourcing"
            ],
            "question_score": 31,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 24820,
            "item_type": "question",
            "score": 31,
            "last_activity_date": 1573304731,
            "creation_date": 1336181804,
            "body": "I know a lot about the places I visit, and I want to share it with everyone. \n\nI have been donating and volunteering at OpenStreetMap, and I am also aware of Google Maps. \n\nWhere else can I help with collaborative mapping?\n",
            "excerpt": "Where else can I help with collaborative <span class=\"highlight\">mapping</span>? &hellip; ",
            "title": "Donating and volunteering geographical knowledge?"
        },
        {
            "tags": [
                "coordinate-system",
                "datum",
                "gis-principle"
            ],
            "question_score": 64,
            "is_accepted": true,
            "answer_id": 5153,
            "is_answered": false,
            "question_id": 2769,
            "item_type": "answer",
            "score": 31,
            "last_activity_date": 1295011685,
            "creation_date": 1295011685,
            "body": "a.  It is good practice to store a version of the data in the projection in which it was captured.  Re-projection can be a lossy process, and it is important to have the original.  I have a preference for storing in WGS84 for the sake of simplicity. \n\nb.  Depending on your software you may need to re-project into a metre based projections such as UTM.  Support for native geodetic is being added (PostGIS, SQL server). For raster analysis it can be preferable to keep the data in the format it was supplied to avoid data loss through interpolation.  \n\nc.  Web mapping systems have standardised on spherical mercator, and to overlay tiles they need to be in this projection.  For overlaying vector on google maps you use  WGS84.  If you are not targeting web mapping there will usually be a local projection that is standard.\n",
            "excerpt": "Web <span class=\"highlight\">mapping</span> systems have standardised on spherical mercator, and to overlay tiles they need to be in this projection.  For overlaying vector on google maps you use  WGS84. &hellip; If you are not targeting web <span class=\"highlight\">mapping</span> there will usually be a local projection that is standard. &hellip; ",
            "title": "What strategies, criteria, or rules to use for selecting coordinate systems?"
        },
        {
            "tags": [
                "r",
                "spatial-statistics",
                "references"
            ],
            "question_score": 43,
            "is_accepted": true,
            "answer_id": 45333,
            "is_answered": false,
            "question_id": 45327,
            "item_type": "answer",
            "score": 31,
            "last_activity_date": 1653295992,
            "creation_date": 1357501795,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\nThere&#39;s quite a few resources for learning &#39;spatial&#39; R online:\n\nspatial-analyst.net\n\nA really solid blog post by\nFrank Davenport, with notes on some basic spatial data manipulation in R\n\nR Spatial Tips (Internet Archive link, original site seems to be gone)\n\nBarry Rowlingson&#39;s site containing some great examples and a cheatsheet\n\nI&#39;d strongly recommend Analysing spatial point patterns in &#39;R&#39;\nby Prof. Adrian Baddeley at the CSIRO in Australia. It covers\nthe  module in depth and I think it&#39;s a great resource\nfor cluster analysis.\n\nApplied Spatial Data Analysis in R (Bivand, Roger S., Pebesma,\nEdzer J., G&#243;mez-Rubio, Virgilio) and Spatial Statistics and\nModeling (Gaetan, Carlo, Guyon, Xavier) are also both great\nbooks.\n\nVirgilio G&#243;mez Rubio&#39;s (he is the author of the famous/superuseful ASDAR book, mentioned in other answers) website provides materials to his tutorials from useR! conferences - slides, data and code are available.\n\nApart from ADAR, there is now new book &#39;An Introduction to R for Spatial Analysis and Mapping&#39; by Brundson &amp; Comber with code available for download.\n\nCSDE (University of Washington) course on GIS has some spatial R materials, focusing on ESDA, GWR, spatial regression\n\nMaps with R I (II, III) series of blog posts offer a lot of extensively commented code that you can learn from.\n\nUC Davis Soil Resource Laboratory has a nice collection of tips and examples of spatial R\n\nFrancisco Rodriguez-Sanchez has a nice materials on &#39;Spatial data in R: Using R as a GIS&#39;.\n\nA Practical Guide to Geostatistical Mapping by T. Hengl\n\nComprehensive Tutorial for Spatio-Temporal R Package (Bergen et al., 2013)\n\nggmap: Spatial Visualization with ggplot2 (Kahle and Wickham)\n\nD.G Rossiter (lecture notes)\n\nSpatial.ly\n\n\nA few nice tutorials, including some with a focus on interactivity (often listed as a weakness of doing GIS with R)\n\nSpatial data in R: Using R as a GIS: A tutorial to perform basic operations with spatial data in R, such as importing and exporting data (both vectorial and raster), plotting, analysing and making maps. by Francisco Rodriguez-Sanchez\nUsing RStudio as an interactive GIS with\nLeaflet by  Kyle Walker,\nTexas Christian University\nWorking with PostGIS from R by\nDuncan Golicher\nGeospatial Data Processing and Analysis in\nR by Andy Lyons\n\nI also made a quick easy and holistic tutorial you folks can check out here https://github.com/mattjbayly/MapsProj. All you need is the R text script and all other material is downloaded remotely from R.\nMy tutorial covered GIS data imports/exports, basic manipulation of vector &amp; raster data, some of basic plotting and a brief overview of projections.\nEstimated time to complete: 60mins\n",
            "excerpt": "Apart from ADAR, there is now new book &#39;An Introduction to R for Spatial Analysis and <span class=\"highlight\">Mapping</span>&#39; by Brundson &amp; Comber with code available for download. &hellip; A Practical Guide to Geostatistical <span class=\"highlight\">Mapping</span> by T. &hellip; ",
            "title": "Seeking tutorials, books, papers, blogs, etc to handle spatial data in R"
        },
        {
            "tags": [
                "mercator",
                "what3words"
            ],
            "question_score": 20,
            "is_accepted": true,
            "answer_id": 195696,
            "is_answered": false,
            "question_id": 195690,
            "item_type": "answer",
            "score": 31,
            "last_activity_date": 1465192458,
            "creation_date": 1464788325,
            "body": "You&#39;re on the right lines. The what3words grid is algorithmically generated to be nearly exactly 3m by 3m to within a couple of centimetres at latitudes between -85&#186; and +85&#186;. Between +/- 85&#186; north and south and the poles, the notional grid squares expand the closer to the poles you get and at their largest extent are ~4.5m by ~4.5m with some deformation at the poles.\n\nIt&#39;s not easy to visualise the deformation, hence my use of the word notional in the previous paragraph. The datum that what3words works with is EPSG:4326 and the algorithm at the heart of what3words &quot;understands&quot; this and so it&#39;s always algorithmically able to map a 3 word address to coordinates and vice versa. But most web maps, Google&#39;s included, are displaying that data once it&#39;s been (re)projected CRS; Google uses EPSG:3857. It&#39;s really challenging to display the deformation as you&#39;re working against how the underlying mapping API wants you to work. The closest you&#39;ll get is the slight shifts in the notional grid that occur as you move north of south from the meridian, as shown near evens.response.fishes if you zoom in enough that the grid will be shown.\n\n\n\n(disclaimer - in my day job I work for what3words)\n",
            "excerpt": "It&#39;s really challenging to display the deformation as you&#39;re working against how the underlying <span class=\"highlight\">mapping</span> API wants you to work. &hellip; ",
            "title": "How does what3words build a grid of squares on the surface of the Earth?"
        },
        {
            "tags": [
                "united-states",
                "zip-codes",
                "borders",
                "postal-code"
            ],
            "question_score": 34,
            "is_accepted": false,
            "answer_id": 167333,
            "is_answered": false,
            "question_id": 53918,
            "item_type": "answer",
            "score": 31,
            "last_activity_date": 1452172312,
            "creation_date": 1445459081,
            "body": "There are 13 multi-state US Census&#39; ZIP Code Tabulation Areas (ZCTAs): 02861, 42223, 59221, 63673, 71749, 73949, 81137, 84536, 86044, 86515, 88063, 89439 &amp; 97635.\n\nAs others have mentioned, there are a few different ways to figure out the area covered by a ZIP Code, but ZCTAs are the easiest, and the only official version that I know of. \n\nSo your example of 42223 does span a state border, but it looks like it is actually between Maryland and Virginia. that between Kentucky and Tennessee.\n\nHere&#39;s the full list with states:\n\n\n\nHere&#39;s how I generated it (with Pandas in Python):\n\n\n\nEdit: It seems the Census has two different two-digit codings for states. Both are numbers assigned based on the state&#39;s alphabetical ordering, but one seems to apply the numbers directly from 1-51 (50 states + DC), while the other skips some numbers. I was using the first, while I should have been using the second, so the state names I listed were wrong. I&#39;ve updated the code and results with the correct list.\n\nEdit: new state mapping confirmed by the OpenCongress API: https://gist.github.com/gabrielgrant/89f883d093e2abf129ad\n",
            "excerpt": "Edit: new state <span class=\"highlight\">mapping</span> confirmed by the OpenCongress API: https://gist.github.com/gabrielgrant/89f883d093e2abf129ad &hellip; ",
            "title": "Determining which US zipcodes map to more than one state or more than one city?"
        },
        {
            "tags": [
                "r",
                "clustering",
                "quadtree"
            ],
            "question_score": 25,
            "is_accepted": true,
            "answer_id": 31879,
            "is_answered": false,
            "question_id": 31236,
            "item_type": "answer",
            "score": 31,
            "last_activity_date": 1345644682,
            "creation_date": 1345563950,
            "body": "I see MerseyViking has recommended a quadtree. I was going to suggest the same thing and in order to explain it, here&#39;s the code and an example.  The code is written in  but ought to port easily to, say, Python.\n\nThe idea is remarkably simple: split the points approximately in half in the x-direction, then recursively split the two halves along the y-direction, alternating directions at each level, until no more splitting is desired.\n\nBecause the intent is to disguise actual point locations, it is useful to introduce some randomness into the splits. One fast simple way to do this is to split at a quantile set a small random amount away from 50%. In this fashion (a) the splitting values are highly unlikely to coincide with data coordinates, so that the points will fall uniquely into quadrants created by the partitioning, and (b) point coordinates will be impossible to reconstruct precisely from the quadtree.\n\nBecause the intention is to maintain a minimum quantity  of nodes within each quadtree leaf, we implement a restricted form of quadtree.  It will support (1) clustering points into groups having between  and 2*-1 elements each and (2) mapping the quadrants.\n\nThis  code creates a tree of nodes and terminal leaves, distinguishing them by class.  The class labeling expedites post-processing such as plotting, shown below.  The code uses numeric values for the ids. This works up to depths of 52 in the tree (using doubles; if unsigned long integers are used, the maximum depth is 32).  For deeper trees (which are highly unlikely in any application, because at least  * 2^52 points would be involved), ids would have to be strings.\n\n\n\nNote that the recursive divide-and-conquer design of this algorithm (and, consequently, of most of the post-processing algorithms) means that the time requirement is O(m) and RAM usage is O(n) where  is the number of cells and  is the number of points.   is proportional to  divided by the minimum points per cell, .  This is useful for estimating computation times. For instance, if it takes 13 seconds to partition n=10^6 points into cells of 50-99 points (k=50), m = 10^6/50 = 20000. If you want instead to partition down to 5-9 points per cell (k=5), m is 10 times larger, so the timing goes up to about 130 seconds.  (Because the process of splitting a set of coordinates around their middles gets faster as the cells get smaller, the actual timing was only 90 seconds.) To go all the way to k=1 point per cell, it will take about six times longer still, or nine minutes, and we can expect the code actually to be a little faster than that.\n\nBefore going further, let&#39;s generate some interesting irregularly spaced data and create their restricted quadtree (0.29 seconds elapsed time):\n\n\n\nHere&#39;s the code to produce these plots.  It exploits &#39;s polymorphism:  will be called whenever the  function is applied to a  object, for instance.  The power of this is evident in the extreme simplicity of the function to color the points according to their cluster identifier:\n\n\n\nPlotting the grid itself is a little trickier because it requires repeated clipping of the thresholds used for the quadtree partitioning, but the same recursive approach is simple and elegant.  Use a variant to construct polygonal representations of the quadrants if desired.\n\n\n\nAs another example, I generated 1,000,000 points and partitioned them into groups of 5-9 each.  Timing was 91.7 seconds.\n\n\n\n\n\n\n\nAs an example of how to interact with a GIS, let&#39;s write out all the quadtree cells as a polygon shapefile using the  library.  The code emulates the clipping routines of , but this time it has to generate vector descriptions of the cells.  These are output as data frames for use with the  library.\n\n\n\nThe points themselves can be read directly using  or by importing a data file of (x,y) coordinates.\n\nExample of use:\n\n\n\n(Use any desired extent for  here to window into a subregion or to expand the mapping to a larger region; this code defaults to the extent of the points.)\n\nThis alone is enough: a spatial join of these polygons to the original points will identify the clusters. Once identified, database &quot;summarize&quot; operations will generate summary statistics of the points within each cell.\n",
            "excerpt": "It will support (1) clustering points into groups having between k and 2*k-1 elements each and (2) <span class=\"highlight\">mapping</span> the quadrants. &hellip; convert.to.shapefile(polys, polys.attr, &quot;id&quot;, 5)\nwrite.shapefile(polys.shapefile, &quot;f:/temp/quadtree&quot;, arcgis=TRUE)\n\n\n(Use any desired extent for xylim here to window into a subregion or to expand the <span class=\"highlight\">mapping</span> &hellip; ",
            "title": "How can I generate irregular grid containing minimum n points?"
        },
        {
            "tags": [
                "python",
                "shapefile"
            ],
            "question_score": 42,
            "is_accepted": false,
            "answer_id": 145029,
            "is_answered": false,
            "question_id": 145015,
            "item_type": "answer",
            "score": 31,
            "last_activity_date": 1502642035,
            "creation_date": 1430767184,
            "body": "There are many modules to read shapefiles in Python, older than ArcPy, look at the Python Package Index (PyPi): shapefiles. There are also many examples in GIS SE (search for [Python] Fiona, for example)\n\nAll can read the geometry, the fields and  the projections.\n\n\nThe older is osgeo (GDAL/OGR), look at the Python GDAL/OGR Cookbook for example\nanother solution is Fiona, also based on GDAL/OGR, but easier to use (with Python dictionaries: GeoJSON format).\npyshp (shapefile) is a pure Python solution \nGeoPandas use Fiona to read/write the shapefiles and Pandas, for data analysis tools. You need to know Pandas to use it. \n\n\nBut other modules as PySAL:the Python Spatial Analysis Library, Cartopy (which use pyshp) or Matplotlib Basemap can also read shapefiles, among other things.\n\nThe easiest to use is Fiona, but if you only know ArcPy, use pyshp, because osgeo and Fiona require that the GDAL C/C++ library be installed, GeoPandas needs the Pandas module and PySAL is too big (many, many others  treatments) \n\nIf you only want to read the content of a shapefile, you don&#39;t need complex things, simply use the geo interface protocol (GeoJSON) also implemented in ArcPy (ArcPy: AsShape)\n\nWith Fiona (as Python dictionaries):\n\n\n\nWith pyshp (as Python dictionaries)\n\n\n\nWith osgeo/ogr (as Python dictionaries)\n\n\n\nWith GeoPandas (as Pandas dataframe)\n\n\n\n*note on geopandas \nYou have to use older versions of Fiona and GDAL with it or it won&#39;t install.\nGDAL: 1.11.2\nFiona: 1.6.0\nGeopandas: 0.1.0.dev-\n\nThere are many tutorials on the Web and even books (Python Geospatial Development , Learning Geospatial Analysis with Python and Geoprocessing with Python, in press)\n\nMore generally, if you want to use Python without ArcPy, look at Simple thematic mapping of shapefile using Python?\n",
            "excerpt": "books (Python Geospatial Development , Learning Geospatial Analysis with Python and Geoprocessing with Python, in press)\n\nMore generally, if you want to use Python without ArcPy, look at Simple thematic <span class=\"highlight\">mapping</span> &hellip; ",
            "title": "Is it possible to look at the contents of Shapefile using Python without an ArcMap license?"
        },
        {
            "tags": [
                "gis-principle",
                "spatial-analysis"
            ],
            "question_score": 25,
            "is_accepted": true,
            "answer_id": 250000,
            "is_answered": false,
            "question_id": 249963,
            "item_type": "answer",
            "score": 30,
            "last_activity_date": 1501485402,
            "creation_date": 1501066118,
            "body": "General\n\nGeographers among other scientists seek for geographical patterns hoping that this will help them to better understand the processes that have produced these patterns. As you shown, this process begins with the mapping of the locations at which the phenomena are located. Oftentimes, such maps as you have produced above are known as point pattern maps.\n\nSpatial distribution\n\nWhen a reader examines such a map, she is trying to find the spatial distribution (or the spatial or geographic arrangement) of the variable of interest and whether there is any sort of pattern. Usually, there are four types of distribution that are defined for point pattern map (which you have also drawn above). These are:\n\n\nclustered\nnormal\nrandom \nregular/uniform/dispersed\n\n\nFrom Wikipedia:\n\n \n\nBeside the visual investigation, one often needs to use the analysis of frequency or the density of points across a region (done with the help of quadrat analysis) or of the distance between adjacent points (done with the help of nearest neighbor analysis).\n\nModifiable units problem\n\nYou have also mentioned the Modifiable areal unit problem (also known as modifiable units problem). \n\n\n  In spatial analysis, four major problems interfere with an accurate\n  estimation of the statistical parameter: the boundary problem, scale\n  problem, pattern problem (or spatial autocorrelation), and modifiable\n  areal unit problem (Barber 1988)\n\n\nI think it&#39;s relevant in this example, but I would also like to mention some other problems:\n\nBoundary problem\n\n\n  A boundary problem in analysis is a phenomenon in which geographical\n  patterns are differentiated by the shape and arrangement of boundaries\n  that are drawn for administrative or measurement purposes.\n\n\nFor a simple example, if you have your points representing a number of people of a certain ethnic group, depending on the boundaries used you might get a different view on the distribution of the points among, for instance, census districts.\n\nIf the points are located close to each other yet are located in different census districts, you can get a false understanding of the distribution because it would indicate even distribution of the ethnic group in this study area. In contrast, if you would use some other boundaries, you might get another view that indicates significant areal concentration of the ethic group. In the end, you might be confused whether you observe ethnic segregation or ethnic integration.\n\nModifiable units problem\n\nThis can be discussed in two aspects - in terms of the &quot;scale&quot; and the &quot;shape&quot;.\n\nScale problem\n\nValues for various descriptive statistics can vary in a systematic manner when you use more and more aggregated areal data.\n\nA simple illustration: each cell is our polygon area with the count of points.\n\n6&#160;&#160;&#160;&#160;&#160;&#160;10&#160;&#160;&#160;&#160;&#160;&#160;3&#160;&#160;&#160;&#160;&#160;&#160;\n5&#160;&#160;&#160;&#160;&#160;&#160;\n2&#160;&#160;&#160;&#160;&#160;&#160;\n6&#160;&#160;&#160;&#160;&#160;&#160;\n4&#160;&#160;&#160;&#160;&#160;&#160;\n12&#160;&#160;&#160;&#160;&#160;&#160;\n3&#160;&#160;&#160;&#160;&#160;&#160;\n5&#160;&#160;&#160;&#160;&#160;&#160;\n8&#160;&#160;&#160;&#160;&#160;&#160;\n12&#160;&#160;&#160;&#160;&#160;&#160;\n4&#160;&#160;&#160;&#160;&#160;&#160;\n12&#160;&#160;&#160;&#160;&#160;&#160;\n1&#160;&#160;&#160;&#160;&#160;&#160;\n3&#160;&#160;&#160;&#160;&#160;&#160;\n\nThen we aggregate the polygons to get an average number of points:\n\n8&#160;&#160;&#160;&#160;&#160;&#160;4&#160;&#160;&#160;&#160;&#160;&#160;\n4&#160;&#160;&#160;&#160;&#160;&#160;\n8&#160;&#160;&#160;&#160;&#160;&#160;\n4&#160;&#160;&#160;&#160;&#160;&#160;\n10&#160;&#160;&#160;&#160;&#160;&#160;\n8&#160;&#160;&#160;&#160;&#160;&#160;\n2&#160;&#160;&#160;&#160;&#160;&#160;\n\nAnd one more time:\n\n6&#160;&#160;&#160;&#160;&#160;&#160;\n6&#160;&#160;&#160;&#160;&#160;&#160;\n6&#160;&#160;&#160;&#160;&#160;&#160;\n6&#160;&#160;&#160;&#160;&#160;&#160;\n\nHey, we got an even distribution! In a word: spatial aggregation usually tends to minimize the variation shown on a map.\n\nFor another really simple example, it really depends at what scale you are looking at your points. Look at the Wikipedia image for point pattern; the normal distribution might look as clustered one when you zoom out in your digital map. \n\nShape problem\n\nWe could have aggregated the polygons in the table above using vertical or horizontal (joining contiguous north-south rather instead of east-west neighbors). This means that various areal definitions might have a significant impact on the values of your data distribution and descriptive statistics.\n\nThe pattern problem\n\nIn short, the above mentioned methods are not very good at evaluating the type of problem that a human would read easily on a map. To be able to distinguish between the areal patterns and point distributions, one would need to use the spatial autocorrelation methods).\n",
            "excerpt": "As you shown, this process begins with the <span class=\"highlight\">mapping</span> of the locations at which the phenomena are located. Oftentimes, such maps as you have produced above are known as point pattern maps. &hellip; ",
            "title": "What is this GIS Principle Called?"
        },
        {
            "tags": [
                "google-earth-engine",
                "google-earth-engine-javascript-api",
                "sentinel-1",
                "synthetic-aperture-radar"
            ],
            "question_score": 12,
            "is_accepted": true,
            "answer_id": 248230,
            "is_answered": false,
            "question_id": 248216,
            "item_type": "answer",
            "score": 30,
            "last_activity_date": 1587953739,
            "creation_date": 1500498139,
            "body": " is a client-side function, and you cannot call it from a server-side function (the one you are mapping over), so you have to do it all in the client side. I have a repo where you can find a bunch of useful functions: https://github.com/fitoprincipe/geetools-code-editor\nThere is a function to export all images from an ImageCollection to the Drive cloud.\n\n\n\nYou can find the complete code in here and the documentation here\n",
            "excerpt": "Export.image.toDrive is a client-side function, and you cannot call it from a server-side function (the one you are <span class=\"highlight\">mapping</span> over), so you have to do it all in the client side. &hellip; ",
            "title": "Exporting each image from collection in Google Earth Engine"
        },
        {
            "tags": [
                "geoserver",
                "cors",
                "jetty"
            ],
            "question_score": 30,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 210109,
            "item_type": "question",
            "score": 30,
            "last_activity_date": 1571914632,
            "creation_date": 1473416191,
            "body": "I hope somebody has already figured this one out. I just installed Geoserver 2.9 on a vanilla Ubuntu 16.04 distro. The Geoserver 2.8 method of enabling CORS with the shanbe.hezoun class does no longer work with Jetty 9.2.13.\n\nThere are mentions that CORS support is already packaged with Jetty 9.2.13 in the jetty-servlets.jar.\n\nThe Jetty lib which is compiled with Geoserver contains a jetty-servlet-9.2.13.v20150730.jar in geoserver/lib but not jetty-servlets.9.2.13.v20150730.jar. Are these supposed to be the same jar with a different name?\n\nIt should be possible to enable CORS either in geoserver/etc/webdefault.xml or in geoserver/webapps/geoserver/WEB-INF/web.xml.\n\nMy understanding is that the webdefault.xml is applied first and the web.xml thereafter.\n\nI have tried following filter in both xml. I haven&#39;t got as far as adding a filter mapping. Adding the filter alone will cause the Geoserver/Jetty service to not start proper.\n\n\n",
            "excerpt": "I haven&#39;t got as far as adding a filter <span class=\"highlight\">mapping</span>. Adding the filter alone will cause the Geoserver/Jetty service to not start proper. &hellip; ",
            "title": "Enabling CORS in GeoServer (jetty)?"
        },
        {
            "tags": [
                "coordinate-system"
            ],
            "question_score": 21,
            "is_accepted": false,
            "answer_id": 26021,
            "is_answered": false,
            "question_id": 25982,
            "item_type": "answer",
            "score": 29,
            "last_activity_date": 1582889152,
            "creation_date": 1337783092,
            "body": "This is a great question because it uncovers important sources of common misunderstandings.  The brief answer is that although of course geodetic latitude and longitude are a form of latitude and longitude, they are not the only ones and the differences are not trivial, so we should be cautious not to confuse them.\n\nIn all cases, latitude and longitude are numbers used to designate points on the earth&#39;s surface.  Usually, the definition of longitude is straightforward because all but the most detailed models of the earth&#39;s surface assume it is rotationally symmetric.  (Geoids, which account for gravitational anomalies, are a possible exception, but this level of detail is normally used only to develop precise elevation coordinates without modifying the underlying latitude and longitude.)  Lines of longitude are meridians and can be designated by the angle they make with a designated meridian of origin, a &quot;prime meridian.&quot;\nThere are many different kinds of latitude.  They are best discussed in a context where an ellipsoidal model of the earth is given, such as the WGS84 or GRS80 ellipsoids.  The latitude depends on the reference ellipsoid.  (This is important when using data referenced to historical ellipsoids, such as the Clarke 1866 ellipsoid.  With more recent ellipsoids, established through satellite measurements, the differences are so small as to be of interest only when accuracy and precision needs are extremely high (sub meter).)\n\nGeodetic latitude is the (signed) angle between the local normal (&quot;straight up&quot; direction) and the plane of the equator.  This should be a professional&#39;s default understanding of what a &quot;latitude&quot; means, even though it differs from the definition taught to children--and therefore is the common understanding among laymen--which corresponds to the geocentric latitude (for a spherical model).  The two can differ by tens of kilometers, a sizable fraction of one degree.\n\nGeocentric latitude, on the other hand, is the (signed) angle determined by the direction from the center of the earth to the point.  The distinction between geocentric and geodetic latitudes is illustrated in the links and also in my reply at How do you compute the earth&#39;s radius at a given geodetic latitude?.\n\nAdditional latitudes have been defined to help create accurate maps that have particular properties, such as being conformal, equal-area (&quot;authalic&quot;), or isometric.  (By changing the latitude slightly we &quot;project&quot; the ellipsoid onto the sphere and then we apply a projection from the sphere to the plane to make a map.  This last step is relatively simple, because it does not need to handle the complicated ellipsoidal formulas, while the initial change of latitude increases the overall accuracy of the map.)\n\nAn &quot;isometric latitude&quot; isn&#39;t even in degrees; it&#39;s essentially the northing coordinate for a Mercator projection.\n\n\nWhen we change the model of the earth (the reference ellipsoid), we obtain a different set of latitudes altogether.  Frequently this happens when a latitude based on an ellipsoid is considered to be a latitude based on a spherical model.  I recently analyzed the resulting error at How accurate is approximating the Earth as a sphere?, finding the displacements (between the correct location designated by a latitude and the apparent location) can be as great as 20 km.  Differences among the various latitudes in use (see &quot;additional latitudes&quot; above) can be of the same order of magnitude, so even for very rough mapping purposes one should pay attention to what is going on.\n\nAdditional references\nA good, but highly technical, source of information on many forms of latitude is\nBugayevskiy, Lev M. &amp; John P. Snyder, Map Projections, A Reference Manual.  Taylor &amp; Francis, London (1995).\nSee pp. 33-37 for formulae and Appendix 5 for a table of isometric latitudes.\n",
            "excerpt": "Differences among the various latitudes in use (see &quot;additional latitudes&quot; above) can be of the same order of magnitude, so even for very rough <span class=\"highlight\">mapping</span> purposes one should pay attention to what is going &hellip; ",
            "title": "Geodetic Coordinates And Latitude, Longitude"
        },
        {
            "tags": [
                "pyqgis",
                "qgis-plugins",
                "c++"
            ],
            "question_score": 15,
            "is_accepted": false,
            "answer_id": 279381,
            "is_answered": false,
            "question_id": 25575,
            "item_type": "answer",
            "score": 29,
            "last_activity_date": 1547569659,
            "creation_date": 1523635024,
            "body": "Telecom cell site plan and optimization using QGIS\n\nCreate Points or Site Locations:\n\n\nCreate database in CSV (make sure antenna sizes are sorted in descending order: highest first to lowest last, such that masking through overlay of cells could be avoided)\n\n\n\n 2. Import to QGIS using &quot;Add Delimited Text Layer&quot; \n\n\n\nChoose X and Y fields and pick Datum\n\n\nCreate Site Sectors:\nPlease utilize the Plugin &quot;Shape Tools&quot; to create site Sectors\n\n\nMake Sector from &quot;Azimuth&quot;:\nIn this scenario it requires 2 additionally defined columns to form a sector, it could be derived from actual &quot;Azimuth&quot; of the sector.\n\nPer se, an offset of -/+ 20 degrees to the actual orientation would make sector BW 40 degrees from node, or as maybe required based on user requirements.\n\n\nStarting angle field: 1st derived column with - 20 deg. angle: Pick corresponding column here\nEnding angle field: 2nd derived column with +20 deg. angle: Pick corresponding column here\nRadius field: Antenna size or Sector size should be derived in separate column as usual and input should be given to Radius under &quot;Shape Tools&quot;\n\n\n\n\n\nLayer properties--&gt; Style --&gt; Control feature rendering order --&gt; Expression --&gt; Antenna size --&gt; pick Descending under (Asc / Description) to have the sector overlay rendering order size large in bottom and size small on top for visibility onwards making map canvas in case CSV data or table data is not arranged earlier\n\n\n\nhttps://twitter.com/vamsi_uppala/status/984504617215049728\n\nDistance Matrix: Using this inbuilt algorithm distance between source site to its nearest neighbor could be identified to derive sector size of the site based on site density / frequency in an given geography, such that sector overlapping could be avoided while retaining appropriate visibility at all zoom levels (per se 1/3rd of distance calculated using the algorithm was used in below example. In case of multi technology / layer network, technology / layer wise magnitudes or sizes could be used to give visualization theme). \n\nThis process would facilitate better representation network with all proximities while working with KPIs or Neighbor analysis.\n\n\n\nNote: Unique Site list are to be processed since tool would generate null distances if cells from same site are processed to extract distance to nearest neighbor.\n\nFor faster processing NNJoin plugin could be utilized as an substitute for the nearest neighbour (conversation of distance in map units (degrees) to meters or km (metric) could be needed).\n\n\n\n\nCreate Neighbors:\n\nMake WKT format comprising of Line start and end points of neighbor markup\n\nStart point is Source Site&#39;s coordinated (Lat1 Long2) and end point is target site&#39;s coordinates (Lat2 Long2).\n\nMake a new column with formation of LineString(Long1 Lat1,Long2 Lat2), or it could be later derived with the help of Field Calculator via Layer Properties.\n\n\nUtilizing Sector centroids would be better for appropriate rendering and easy identification considering multi-techno sites.\n\nNeighbor relations can be patched with network stats such as &quot;Handover Count / Late HO / Early HO / HO Fail etc.&quot; to derive a thematic for line thickness or colour for easy identification. This excise could use &quot;Graduated&quot; under &quot;Style&quot; menu.\n\n\n\n\nThis process of creating nbrs with HO stats is almost instantaneous for a size which was given a try with HO relations over 800,000 and cells count of ~40,000.\n\nNeighbor Creation from Distance Matrix algorithm:\n\nNeighbor derived through Distance Matrix algorithm and representation on map by source site, however this is representation of nearest neighbor assuming omini presence, which could be used in case of site level neighbor addition like LNADJW and LNADJG where SON would define the relations from this defined profile (neighbour from interesting point of two directional points are yet to be evaluated to suit wireless scenario):\n\n\nBelow formula could be used in Geometry generator to represent the relations on the fly (Layer Properties-&gt;Single symbol-&gt;Marker-&gt;Simple marker-&gt;Symbol layer type-&gt;Geometry generator-&gt;Geometry type-&gt;LineString/MultiLineString):\nmake_line(centroid(geometry(get_feature(&#39;NetworkSiteDatabase&#39;,&#39;Site&#39;,&quot;InputID&quot;))),centroid(geometry(get_feature(&#39;NetworkSiteDatabase&#39;,&#39;Site&#39;,&quot;InputID&quot;))))\n\nMaking TAC, LAC boundaries are easy on QGIS (100,00 sites find this done with in 1 min):\n\n1. Make &quot;Voronoi Polygons&quot; from points\n\n\nUse &quot;Dissolve Boundaries&quot; algorithm under &quot;Process Toolbox&quot; Grass to merge individual cell boundaries to gross TAC, LAC, BSC or Cluster boundaries etc.\n\n\n\n\nA sample work flow is shown below taking 10 km x 10 km grid distance to place cell sites for Indian geography, which is resulted in 36,032 sites with 108,096 cells. And each district is depicted unique TAC boundary for easy understanding and then the output is as follows:\n\nThis is a rough representation of planning and mostly suits day to day capacity and coverage expansions by network operators unless they have very stringent approach methods where constraints are followed for dimensioning viz. Radio propagation models, Terrain, Clutter, Capacity and Service promises (Cell edge throughput, Avg. throughput, Coverage and type of services etc.)\n\n\n\n\nKPI interlacing onto Sectors:\nCSV or Excel could be used with additional Cell, Site, relation level KPIs.\n\nor\n  Use &quot;Join Button&quot; on &quot;Layer Properties&quot; popup window as VLOOKUP function to pullover data from regular KPI reports and represent on map as thematic using common field ex. Cell / Segment name in case of cell level KPI or relation when in case of Handover related etc.\n\n\n\nAnd arrange thematic accordingly: Use &quot;Rulebased&quot; with &quot;Graduated&quot; in case to generate with multiple conditions at one go.\n\nUse &quot;TimeManager&quot; plugin to check KPI plots to identify its dynamics by plying hourly, daily time interval timelapse through selected canvas.\n\nUseful plugins:\n\n&quot;SpreadSheet&quot; \n\n\nImport direct Excel worksheet onto QGIS\nClassification of column data (Integer, Decimal, String, etc.)\nFile data could be plotted at import with corresponding geo-data (Lat Long for points; WKT for HO Lines or Polygons, if any) on choosing datum\nKPI reports could be easily taken onto mapping through this process\n\n\n\n\n&quot;TableManager&quot; For editing column headers on the go\n\n\n&quot;OpenLayer&quot; and &quot;QuickMapservices&quot;: For Map overlays ex. Google Map, Bing Map, OSM, Aster elevation data etc.\n\nTiming Advance Plot:\nUse &quot;Diagrams&quot; option under &quot;Layer Properties&quot; popup and create &quot;pie&quot; chart or &quot;bar&quot; chart to visualize the site signal reachability by TA / PRACH samples.\n\n\n\nApplying diagrammatic thematic for TA and representing all samples in learner method:\n\n\nTA or PRACH thematic on applying variable magnitude or Scaled size method by aggregating overshooting TA samples&gt;6.9 km:\n\n\nTA aggregation through field calculator (in this case data was multiplied by 1 to convert to integer and made summation):\n\n\nSample drive test plot is shown below:\n\n\nQConsolidate: For sharing complete project files with team etc. while retaining all project&#39;s properties.\n\nOther tips: \n\n\nTake HO relations from collocated site sector of 4G (since it is being SON) and replicate same set of collocated site Sectors (on 2G &lt;-&gt; 2G or 3G &lt;-&gt; 2G or or 3G&lt;-&gt;2G or 23G -&gt; 4G, this could be scaled up to OSS level on monthly or bi-monthly basis, and limited to top performing HO count and max allowed relations count.\nSimilar to above could be utilized for neighbors of 3G&lt;-3G&gt; onto 3G&lt;-&gt;2G, where site misses 4G proximity.\nSaving Layer style to Spatlite database:\n\nDrive test plot thematic could be handled easily and process could be scaled up to typical cluster with file sizes over 200 MB or more. Pre to Post drive route matching could be done with much ease by buffering either of the plot to GPS error or bin distances (whichever is high per se ~20 m) such that Pre or Post plot could be clipped out and bin comparison could be done appropriately and hence benchmarking. QGIS has on-the-go layer styling while on processes (Copy/Past) of thematic properties which are saved in different active layer or saved on local m/c (user accessible and editable by Text editor like NotePad++, Submlime etc.), and thematics are also shareable between team etc. \n\n\n\n\nSample RSRP thro&#39; simple Pathloss calculations on omini directional radiation pattern (Bin / Point map with 100 m interval has been created along Indian railways line vector), individual distance (multi-ring buffer) could be utilized to represent the coverage prediction plot (Constraints omitted: Antenna tilts, Elevations, Reflections, Absorption, and many others):\n\n\nRepresentation of drive plot from regular coverage contours:\n\n\nDraw regular distance &quot;multi-ring buffer&quot; from chosen site location (lat long) to make variable distance rings around the given point, dissolving the distance buffers would facilitate representation better\nGenerate points along line vectors\nClip points vector over multi-distance ring buffer to pick corresponding distances to the site \nUse appropriate RF model formula to calculate free space pathloss and represent bin\nUse viewshed approach to involve Ground Elevation in prediction (*Currently under exploration)\nUse Antenna Tilts, Antenna pattern (*Currently under exploration)\nUse Clutter absorption model (*Currently under exploration)\n\n\n\n\nApply COST 231 (Urban RF propagation model) in association with distance calculated through MultiRingBuffer from site centroid. However this process could be further refined to plot directional antenna radiation pattern in association with interpolation of bins for desired pixelation.\n\n\nField calculator could be utilized to check coverage thematic of route map (made points along line) to make iteration checks on different Frequencies and other constants.\n\n\nCost 231 Urban RF model: Formula in field calculator: TX Power-(46.3+33.9*LOG10(Freq. Band in MHz)-13.82*LOG10(20)-(3.2*LOG10(11.75*1)^2-4.97)+(44.9-6.55*LOG10(BTS TX antenna Ht.))*LOG10(&quot;distance in km&quot;)+3)\n\n\nHata Urban RF model: Formula used in field calculator TX Power -(69.55+26.16*log10(1900)-13.89*log10(BTS TX antenna Ht.)-(0.8+(1.1*log10(1900)-0.7)*1.5-1.56*log10(Freq. Band in MHz))+(44.9-6.55*log10(BTS TX antenna Ht.))*log10(&quot;distance in km&quot;)):\n\n\nHata Rural RF model: Formula used: TX Power-((69.55+26.16*log10(Freq. Band in MHz)-13.89*log10(BTS TX antenna Ht.)-(0.8+(1.1*log10(Freq. Band in MHz)-0.7)*1.5-1.56*log10(Freq. Band in MHz))+(44.9-6.55*log10(BTS TX antenna Ht.))log10(&quot;distance in km&quot;))-4.78(log10(Freq. Band in MHz))^2+18.33*log10(Freq. Band in MHz)-40.94)\n\n\n\nServing cell representation using hublines (only ideal condition FSL):\n \n\nhttps://github.com/NationalSecurityAgency/qgis-shapetools-plugin/issues/9\n",
            "excerpt": "File data could be plotted at import with corresponding geo-data (Lat Long for points; WKT for HO Lines or Polygons, if any) on choosing datum\nKPI reports could be easily taken onto <span class=\"highlight\">mapping</span> through this &hellip; ",
            "title": "Creating sectors for telecom towers"
        },
        {
            "tags": [
                "arcpy",
                "polyline-creation",
                "flow-map"
            ],
            "question_score": 11,
            "is_accepted": true,
            "answer_id": 15222,
            "is_answered": false,
            "question_id": 15181,
            "item_type": "answer",
            "score": 29,
            "last_activity_date": 1317411022,
            "creation_date": 1317405905,
            "body": "It seems the most common problem with these types of &quot;flow maps&quot; is that when many lines are included, they collide to such a great extent that it makes it difficult to discern any non-obvious pattern (when reciprocal flows are considered it happens to an even greater extent). Also the long lines tend to dominate the graphic, although it is quite possible the distribution of flows is predominately over short spaces (for instance a host of different distributions between places tend to be similar to Levy flights). I suppose this isn&#39;t necessarily a bad thing (the long lines may be more intrinsically interesting that the short lines for many phenomenon), but I don&#39;t think we want to lose the forest for the trees so to speak.\nAlthough I don&#39;t doubt I&#39;ve missed some potential &quot;solutions&quot; that have been proposed, I will try to sum up some of the ways individuals have tried to solve the problem in work that I have come across.\nDistorting the Lines\nIf you peruse some of the other threads on the sight you will see some examples of how people have dealt with this problem. In particular, the lines are distorted so they don&#39;t overlap with each other or other objects on the map. Whuber&#39;s answer on another similar question (already mentioned in a comment) is an example of this. A presentation by some researchers at Stanford demonstrates this same idea (Phan et al., 2005). Thanks for that presentation goes to dslamb for this answer on another thread (and all of the answers to that thread will be on interest for your question as well). I particularly find it interesting that one of the cardinal examples of this is the old immigration map by Minard is an example of a desirable output (circa 1864!).\nGiven your particular use case (small number of nodes and lines), this seems sufficient. The other &quot;solutions&quot; I present are more intended to visualize data with many lines and many origins-destinations (although I assume they will be useful summaries for the community in general, so I continue on regardless).\nUsing Alpha Blending, Color, and Line Width/Height\nThe maps I listed in that same thread previously noted, Representation of network flows are examples of these. The facebook friends is a good case of adjusting the alpha level of lines, so it takes many more flows to represent a darker (or brighter in that case) connection between the two places. This also demphasizes the longer lines because they tend to happen more infrequently. Similar logic comes from Value-by-Alpha maps for polygon areas (Roth et al., 2010) that have been mentioned on this forum before.\nThe other map I present in that same answer uses color, and a non-traditional 3d perspective arcing lines (Ratti et al., 2010). The authors used a clustering criteria to group homogenous areas together and color code them (so by definition the areas within the color have more similar flow patterns than between colors). The clustering criteria in and of itself could be interesting to identify patterns in the data, although it seems a likely problem with this, as Andrew Gelman has mentioned, is that it tells you pretty much what you already know, that places nearer to each other tend to have more connections.\nLastly, in this category I include techniques that weight the lines (similar to alpha blending) using either the line width, or in the case of the 3d perspective line height, to convey the volume of the flow. See the page on Tobler&#39;s flow mapping software page for some examples in 2d (and the other article I mentioned is an example in 3d using line heights). Also on that page Tobler has a very useful article describing the problems with flowmapping and their historical application (Tobler, 1987).\nAnother example in 3d is this answer by a mankoff on this site. This post on the Sociological images blog shows a useful way in a flow diagram to distinguish between in-flows and out-flows (although again it works because the number of nodes and relatively small, and the nodes on the network can be layed out in an arbitrary way to reduce overplotting). Those same types of arrows (and a few others using hashings) are also in (Tobler, 1987).\nIn the end though line width and color don&#39;t really solve the over-plotting problem. The arcs in 3d help somewhat, although with more complicated flow patterns I think they will have limited utility. IMO alpha blending seems to be the most useful in a wide variety of situations of these three, but color and line width could/should be used in conjunction with line distortion mentioned above.\nData Reduction\nI group two types of techniques here, 1) using small multiple maps (i.e. many maps with inherently less objects to visualize so overplotting is reduced), or 2) other graphical representions, that are not lines, but represent some of the flows via density or choropleth maps. Examples of these can be found in (Corcoran et al., 2009; Rae, 2009; Wood et al., 2010) (thanks to iant for the Rae reference). These tend to reduce the amount of visual information presented by either presenting a series of small multiple maps (or just a smaller area), or use a choropleth mapping scheme to represent some statistic (examples could be number of in-flows, number of outflows, direction of the flows, average distance of the flows). If you have point level data you could represent these statistics through kernal density raster maps, or aggregate them into quadrats.\nWhen information is reduced like this, overplotting isn&#39;t as much a problem. A very cool interactive online example is this migration map by Forbes magazine. You can only see one county at a time, but the reduction of information makes it much easier to parse the lines (and the difference between in-flows and out-flows). A recent post on the ESRI mapping blog also uses a similar technique with the small multiples (they also choose a particular projection for the world map to have &quot;pretty looking&quot; lines, and make good use of color to further highlight different international origins). In that example it works out pretty well because the end destination is the same for all flows, but if flows could be reciprocal it probably wouldn&#39;t work out as well.\nUsing Other Non-map Representations of Flows\nOthers on this site have suggested using alternative diagrams to the actual map to represent the flows (just mapping the origins and destinations in some other manner than their actual geographic location). Examples of these are either cicular visualizations (such as that produced by Circos), arc diagrams (see this example on Protovis, these are also called kriskograms (Xiao &amp; Chun, 2009)), or matrix heat maps (here is another example from the Protovis website). Another option would be to use some type of automated network layout to identify patterns in the flows (such as that capable by Graphviz). Besides Graphviz it appears Gephi, the NetworkX python library, and some R libraries are popular tools as well (see this answer on the stats site).\nThe libraries I cite are pretty cool as they have developed interactive visualizations as well. Here is an example with a similar style to the circular graphics (although not circular!). Here is another interactive visualization using some of the line distortion techniques discussed earlier, network placement (that appears similar to circular Dorling cartograms) as well as other useful statistical summaries (I saw both of those examples originally on the information aesthetics blog).\n\nSome other resources I think are useful are the software and articles coming from the Spatial Data Mining and Visual Analytics Lab. Also the crime travel demand modeling in the CrimeStat program is a gentle introduction to applicable regression techniques for such flow data. Either of these tools may allow you to identify interesting correlations in the flow patterns to other geographic information. Another place to perhaps recieve some useful inspiration for either graphically displaying the data or statistical analysis would be a recent issue of in the Journal of Computational and Graphical Statistics, Volume 20 Issue 2, on examining flight arrival/departure statistics for commercial carriers in the US from 1987 to 2008 (if you are interested in handling big data this would be worthwhile to examine as well). All the articles are free and they have associated posters with each paper.\nIn the end, the data and the medium will dictate how well some of these techniques work in reducing the visual clutter that comes along with flow data. I hope this is a useful place though to find ideas on how to deal with this visualization problem though. If you further refine your question into what you want to accomplish, then others can give useful feedback into actual programmatic implementations (if something is not already available).\n\nCitations\n\nCorcoran, Jonathan, Prem Chhetri &amp; Robert Stimson. (2009) Using circular statistics to explore the geography of the journey to work. Papers in Regional Science 88(1): 119-132.\nPhan, Doantam, Ling Xiao, Ron Yeh, Pat Hanrahan &amp; Terry Winograd. (2005) Flow Map Layout. In Information\nVisualization, 2005. INFOVIS 2005. IEEE Symposium: 219–224.| PDF here\nRae, Alasdair. (2009) From spatial interaction data to spatial interaction information? Geovisualisation and spatial structures of migration from the 2001 UK census. Computers, Environment and Urban Systems 33(3): 161-178.|PDF here\nRatti, Carlo, Stanislav Sobolevsky, Francesco Calabrese, Clio Andris, Jonathan Reades, Mauro Martino, Rob Claxton &amp; Steven H. Strogatz. (2010) Redrawing the map of Great Britain from a Network of Human Interactions. PLoS ONE 5(12). Article is open access from link\nRoth Robert E., Andrew W. Wooddruff &amp; Zachary F. Johnson. (2010) Value-by-alpha maps: An alternative technique to the cartogram. The Cartographic Journal 47(2): 130-140.|PDF here\nTobler, Waldo R. (1987) Experiments in migration mapping by computer. Cartography and Geographic Information Science 14(2): 155-163|PDF here\nWood, Jo, Jason Dykes &amp; Aidan Slingsby. (2010). Visualisation of origins, destinations and flows with OD maps. The Cartographic Journal 47(2): 117-129.|PDF here\nXiao, Ninchuan &amp; Yongwan Chun. (2009) Visualizing migration flows using kriskograms. Cartography and Geographic Information Science 36(2): 183-191.\n\n*note, links to ungated pdf documents are included when I could find one\n",
            "excerpt": "See the page on Tobler&#39;s flow <span class=\"highlight\">mapping</span> software page for some examples in 2d (and the other article I mentioned is an example in 3d using line heights). &hellip; |PDF here\nTobler, Waldo R. (1987) Experiments in migration <span class=\"highlight\">mapping</span> by computer. Cartography and Geographic Information Science 14(2): 155-163|PDF here\nWood, Jo, Jason Dykes &amp; Aidan Slingsby. (2010). &hellip; ",
            "title": "Creating arcs between two points in ArcPy?"
        },
        {
            "tags": [
                "qgis",
                "openstreetmap",
                "sld",
                "qml"
            ],
            "question_score": 29,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 90086,
            "item_type": "question",
            "score": 29,
            "last_activity_date": 1554511005,
            "creation_date": 1395158921,
            "body": "I&#39;m looking for a qml file (or equivalent e.g. sld) to allow me to use QGIS to take OpenStreetMap data and produce paper maps. I&#39;m re-asking this question (it was asked once or twice over a couple of years by other people) because I&#39;m really surprised not to easily find such a thing already (I looked hard). \n\nI have found Anita Graser&#39;s styles - which are good, but only style basic data like roads (and do so simply). I&#39;ve successfully followed the directions for getting OSM data to work with. I&#39;ve carried out some basic style editing successfully. I realise I could create my own styles for this purpose - but this seems like a very big job. I want a visually pleasing map taking into account most of the data available on OSM (i.e. not just streets, but tracks, paths, rivers, woods, lakes, buildings and so on). I&#39;d have thought that there would be other people out there already doing the same... It seems odd to have to re-invent the wheel when both OSM and QGIS are open source / open data projects. I feel like maybe I&#39;ve just missed the obvious repository of OSM qml files which resides out there on the internet somewhere if you know where to look.\n\nAdditional notes in response to query below...\n\nIdeally I&#39;m looking for a Mapnik style rendering of the OSM data, but any equivalent properly developed and complete style would be good.\n\nAt the moment the objective is to use this data to produce paper mapping, but simple use of the mapping as base data on which other geographic data can be displayed also requires a decent rendering. At work I use Ordnance Survey data completely styled to produce a full and very detailed UK map (the point being that I didn&#39;t have to design this styling, it came with the data). I realise that other tools exist for paper mapping, but the same issues tend to arise at one stage or another... I&#39;m more or less successful in making the tool work for me in really basic terms, but to get to something visually useful I end up back with me either needing to re-invent a complete rendering style from scratch (beyond my skill), or encountering such a complex set of requirements for database setups or whatever that the process crashes and burns before I get anywhere useful. With a few more years of GIS experience I&#39;ll maybe be a database, CartoCSS (or whatever else) wizz... but until then I&#39;m prevented from using the amazing resource that OSM provides by this one barrier.\n\nUpdate (July 2015): Please note that I&#39;m still looking for information on this, and given that I&#39;ve just been informed that the question has had 2500 views in the last year clearly others are too.\n",
            "excerpt": "At the moment the objective is to use this data to produce paper <span class=\"highlight\">mapping</span>, but simple use of the <span class=\"highlight\">mapping</span> as base data on which other geographic data can be displayed also requires a decent rendering. &hellip; I realise that other tools exist for paper <span class=\"highlight\">mapping</span>, but the same issues tend to arise at one stage or another... &hellip; ",
            "title": "Seeking qml or sld file for QGIS + OpenStreetMap data?"
        },
        {
            "tags": [
                "shapefile",
                "google-maps",
                "download"
            ],
            "question_score": 18,
            "is_accepted": true,
            "answer_id": 44680,
            "is_answered": false,
            "question_id": 44676,
            "item_type": "answer",
            "score": 29,
            "last_activity_date": 1356372733,
            "creation_date": 1356372733,
            "body": "No, Google&#39;s road data is proprietary and is not distributed in a GIS capable format. This is because Google spends a lot of money keeping their GIS accurate and current, and distributing it for free would allow Google&#39;s competitors (e.g. Microsoft, MapQuest, Apple, ESRI) to download it. This would forfeit Google&#39;s competitive advantage in the web mapping world.\n\nOpenStreetMap does offer downloads of their entire road dataset. The &quot;Downloading data&quot; Wiki page has some more information. The data download page is here. If you only need data for a single region or country, I recommend using the prepackaged downloads from geofabrik.de.\n",
            "excerpt": "This would forfeit Google&#39;s competitive advantage in the web <span class=\"highlight\">mapping</span> world.\n\nOpenStreetMap does offer downloads of their entire road dataset. &hellip; ",
            "title": "Where can I download the Google Road network as shapefile?"
        },
        {
            "tags": [
                "wms",
                "web-service",
                "wfs"
            ],
            "question_score": 10,
            "is_accepted": true,
            "answer_id": 8350,
            "is_answered": false,
            "question_id": 8348,
            "item_type": "answer",
            "score": 28,
            "last_activity_date": 1302454996,
            "creation_date": 1302454996,
            "body": "You are really comparing chalk and cheese. WMS serves up raster tiles of data that have been created by a WMS server. This data can originally be vector or raster data and will have been drawn with style, but by the time it gets to your client it is just a raster image. WFS on the other hand, serves up vector data.\n\nGood places to look are the OGC website which has the standards documents as well as overview documents for the various services. This would be a reference to put in your bibliography. MapServer and GeoServer have lots of documentation on the way each of them deals with WMS and WFS. And of course, there is Wikipedia which has short but generally accurate pages on both, but I suspect you would lose marks if you actually cited the site in your thesis. Best just use it to get an overview.\n\nWith something like these geospatial web services, it usually pays dividends if you actually install a server and play around with creating maps. There are plenty of tutorials out there, and there are lots of previous posts on stackexchange.\n\nMy undergrad thesis is on the use of web mapping for the archaeology industry, and I have a virtual machine (VBox running JeOS Ubuntu 10.10) that runs mapserver and tinyows that I can connect to like a &quot;real&quot; server, and test what I&#39;m writing about.\n",
            "excerpt": "My undergrad thesis is on the use of web <span class=\"highlight\">mapping</span> for the archaeology industry, and I have a virtual machine (VBox running JeOS Ubuntu 10.10) that runs mapserver and tinyows that I can connect to like a &hellip; ",
            "title": "Comparison of WMS and WFS services"
        },
        {
            "tags": [
                "geodesy",
                "ellipsoid",
                "geoid"
            ],
            "question_score": 27,
            "is_accepted": true,
            "answer_id": 53737,
            "is_answered": false,
            "question_id": 53728,
            "item_type": "answer",
            "score": 28,
            "last_activity_date": 1362677639,
            "creation_date": 1362646378,
            "body": "This summarizes my understanding of some of the basic ideas.  Because it is hard to find all of them clearly described and summarized in one place, I could be wrong or misleading about some of them: comments and corrections are welcome.\n\n&quot;Geoids&quot; are approximations to a surface of gravitational equipotential. \n\n\n  The geoid is a hypothetical Earth surface that represents the mean sea level in the absence of winds, currents, and most tides. The geoid is a useful reference surface. It defines the horizontal everywhere and gravity acts perpendicular to it. A carpenter’s level aligns itself along the geoid and a carpenter’s plumb bob points down the vertical or perpendicular to the geoid. Water will not flow in aqueducts if the pipes are perfectly aligned along the geoid. Surveyors use knowledge of the geoid and the horizontal when they lay out highways and boundaries.\n\n\n(NASA)\n\n\n\nTo get a sense of what is gained relative to a sphere or ellipsoid, note that\n\n\nThe difference in apparent elevations between a spherical model and a good ellipsoid is up to two dozen kilometers.  This translates to maximum positioning discrepancies of about 22 kilometers.  The relatively large amount of positioning discrepancy occurs because there is a systematic distortion of the sphere relative to the ellipsoid: it attains one extreme at the poles and another extreme at the Equator.\nThe difference in apparent elevations between a good ellipsoid and a geoid is typically less than 100 meters (about 0.1 kilometers).  This is not a systematic difference: it varies a lot across relatively short sections of the earth (on the order of hundreds of kilometers).  Consequently, the maximum horizontal positioning discrepancy resulting from any hypothetical geoid-based projection is likely on the order of meters or less (usually much less except perhaps over large, carefully chosen areas). \nHowever, the deflection of the geoid (which is the amount by which true gravitational vertical direction varies) reaches up to about an arc-second, which makes it unsuitable for any kind of very high-accuracy mapping based on measuring latitude in terms of a local upward-pointing angle.  An arc-second of deflection translates to almost 30 meters on the ground, and such deflections can vary from one extreme to the other over just a few hundred kilometers.\n\n\nIn return for squeezing out that last 0.5% of accuracy in describing how the geoid varies from the ellipsoid, you need hundreds to hundreds of thousands of parameters compared to two to describe an ellipsoid.  Yes, it is mathematically possible to define a projection based on a geoid instead of an ellipsoid.  [See &quot;Coordinate charts&quot; on pp 4-5 of this text, for instance.  The modern mathematical definition of smooth curved surfaces, like a geoid, is based on a set of projections.  The Implicit Function Theorem guarantees such projections exist for the geoid.]  Computation would be, to say the least, inefficient (although it could be sped up by interpolation in precomputed tables).  When necessary, the difference in vertical positioning can be computed after ellipsoid-based projection in terms of the geoid parameters or by interpolating in a precomputed grid of geoid values.\n\nA serious potential problem with basing map projections on a geoid as reference surface is that the geoid is constantly changing worldwide.  It will change with changes in sea level, for instance.  \n\nBecause nowadays much geopositioning is done in geocentric coordinates, rather than by means of gravitational-based triangulating devices (such as levels), use of a geoid is practically irrelevant: an ellipsoid--however well it might or not be related to gravity, sea level, or the actual shape of the earth--serves as a reasonably stable reference surface relative to which everything else can be located and mapped.  The geoid is then described relative to this reference.  Its description is used in mapping primarily to permit GPS satellites to improve their positioning accuracy.\n",
            "excerpt": "the deflection of the geoid (which is the amount by which true gravitational vertical direction varies) reaches up to about an arc-second, which makes it unsuitable for any kind of very high-accuracy <span class=\"highlight\">mapping</span> &hellip; Its description is used in <span class=\"highlight\">mapping</span> primarily to permit GPS satellites to improve their positioning accuracy. &hellip; ",
            "title": "Are ellipsoids a mathematical necessity?"
        },
        {
            "tags": [
                "coordinate-system",
                "software-recommendations"
            ],
            "question_score": 27,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 28390,
            "item_type": "question",
            "score": 27,
            "last_activity_date": 1591442537,
            "creation_date": 1340834601,
            "body": "I am trying to calculate distortion so I can distort overlaying text and forms to precisely match an image of an equirectangular projection.\n\nHow does one calculate the distortion at a given latitude on an equirectangular projection 1:45,000,000 (say, 2000 pixels wide x 1000 pixels high)?  \n\nI&#39;ve been trying to figure out this post and its links to no avail:\nHow to create an accurate Tissot Indicatrix?\n\nI am not a professional, just a very interested amateur. \n\n\n\nHere&#39;s the long story.\n\nI am visualizing/mapping data using the Processing programming language and would like to have the 2D mapped data (different sized fonts and circles) appear undistorted when wrapped to a 3D globe. The data is mapped using equirectangular x, y&#39;s and the maps I want to use as backdrops are all this projection, so I&#39;m assuming I want to &quot;match&quot; this distortion (e.g. by calculating distortion via latitude using Tissot equations?). Using the programming language I can precisely distort both the text and the circles. I think all I need are the equations to do it correctly.\n\nHere is the original 2D data map:\n\n\n\nWhen wrapped it looks distorted, like this:\n\n\n\nHow can I make my 2D image look undistorted when wrapped to the 3D sphere?\n\nFor reference, here&#39;s the same question asked differently on the Processing forum.\n\n\n\nI&#39;m not sure I want to reproject to an orthographic projection.  I want my 2D data map to wrap to a 3D sphere model that can be interacted with (i.e. spun).\n\nI am using a 3D modeling program (Cinema 4D) to wrap a sphere with a 2MB &quot;Blue Marble&quot; image (equirectangular projection) from NASA.\n\nWhen wrapped it appears undistorted from all hemispheres (not just one hemisphere, as an orthographic projection would be?), see: still from 3D model above.  (The modeling program is doing the orthographic projection for me as I rotate the object, I suppose.)  Therefore, I think that if I distort my 2D data map in a similar way it too will appear undistorted on the 3D sphere.  Here&#39;s a shot I took with an equation that approximates equirectangular distortion.  You&#39;ll notice the egg shaped ellipses from the 2D image look like a circle when wrapped to the 3D sphere.  Similarly, the Tissot ellipses also appear as circles on the 3D sphere.\n\n\n\n\nThis is why I was looking at the Tissot equations...to more precisely figure out the distortion of the equirectangular projection at different latitudes so I could distort my overlay accordingly.\n\nPerhaps I should use a GIS program.  I just downloaded Cartographica and will see if I can figure it out.  \n\nAny Mac software suggestions for someone new undertaking this task?\n",
            "excerpt": "I am visualizing/<span class=\"highlight\">mapping</span> data using the Processing programming language and would like to have the 2D mapped data (different sized fonts and circles) appear undistorted when wrapped to a 3D globe. &hellip; ",
            "title": "Calculating distortion on Equirectangular Projection"
        },
        {
            "tags": [
                "qgis",
                "python",
                "intersection",
                "line",
                "crossing"
            ],
            "question_score": 13,
            "is_accepted": true,
            "answer_id": 138010,
            "is_answered": false,
            "question_id": 137909,
            "item_type": "answer",
            "score": 27,
            "last_activity_date": 1425905715,
            "creation_date": 1425733617,
            "body": "The nodes:\n\nYou want two things, the end points of the polylines (without intermediate nodes) and the intersection points. There are an additional problem, some polylines end points are also intersection points:\n\n\n\nA solution is to use Python and the modules Shapely and Fiona\n\n1) Read the shapefile:\n\n\n\n2) Find the end Points of the lines (how would one get the end points of a polyline?):\n\n\n\n\n\n3) Compute the intersections (iterating through pairs of geometries in the layer with the itertools module). The result of some intersections are MultiPoints and we want a list of points:\n\n\n\n\n\n4) Eliminate duplicates between end points and intersection points (as you can see in the figures)\n\n\n\n5) Save the resulting shapefile\n\n\n\nFinal result:\n\n\n\nThe line segments\n\nIf you want also the segments between the nodes, you need to &quot;planarize&quot; (Planar Graph, no edges cross each other) your shapefile. This can be done by the unary_union function of Shapely\n\n\n\n\n",
            "excerpt": "end points and intersection points (as you can see in the figures)\n\nresult = endpts.extend([pt for pt in inters  if pt not in endpts])\n\n\n5) Save the resulting shapefile\n\nfrom shapely.geometry import <span class=\"highlight\">mapping</span> &hellip; &#39;,&#39;properties&#39;: {&#39;test&#39;: &#39;int&#39;}}\n# creation of the shapefile\nwith fiona.open(&#39;result.shp&#39;,&#39;w&#39;,&#39;ESRI Shapefile&#39;, schema) as output:\n    for i, pt in enumerate(result):\n        output.write({&#39;geometry&#39;:<span class=\"highlight\">mapping</span> &hellip; ",
            "title": "Intersecting lines to get crossings using Python with QGIS?"
        },
        {
            "tags": [
                "coordinate-system",
                "datum",
                "gis-principle",
                "terminology"
            ],
            "question_score": 262,
            "is_accepted": false,
            "answer_id": 684,
            "is_answered": false,
            "question_id": 664,
            "item_type": "answer",
            "score": 27,
            "last_activity_date": 1300742028,
            "creation_date": 1280837097,
            "body": "Geographic projections are a way of showing the curved surface of the Earth on a flat surface like a piece of paper...\n\nFrom the Manifold user documentation:\n\n\n  Earth is not an exact ellipsoid. In fact, because the Earth is such a &quot;lumpy&quot; ellipsoid no single smooth ellipsoid will provide a perfect reference surface for the entire Earth. The practical solution to this is to measure the Earth&#39;s shape in different areas and to then create different reference ellipsoids used for mapping different regions on Earth. \n  A datum is a reference ellipsoid together with an offset from the center of the Earth. By specifying different offsets, you can use the same standard ellipsoids in many different regions of the Earth. Different countries will often use the same ellipsoid but with different offsets for standard government maps in those countries.\n\n",
            "excerpt": "The practical solution to this is to measure the Earth&#39;s shape in different areas and to then create different reference ellipsoids used for <span class=\"highlight\">mapping</span> different regions on Earth. &hellip; ",
            "title": "Difference between projection and datum"
        },
        {
            "tags": [
                "qgis",
                "openstreetmap",
                "openlayers",
                "web-mapping",
                "tiles"
            ],
            "question_score": 26,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 9864,
            "item_type": "question",
            "score": 26,
            "last_activity_date": 1482006147,
            "creation_date": 1305726517,
            "body": "I am looking for a small-scale and easy way to present one or more polygon shapefiles online (on a municipal website without any existing map-server infrastructure, to be precise). Right now, I&#39;m doing all work with QGIS, and I would prefer to stay all open-source (there is no budget left for any big software investments).\n\nResearching this topic resulted in a overwhelming number of possible approaches, and left me quite confused. What I am looking for is\n\n\nbeing able to show categorized polygons in a thematic map\n(- if possible, it would be nice to get popups or to be able to retrieve attribute information - but that&#39;s highly optional)\nI would prefer to do most work (styling, etc) in QGIS\nOSM as base map would be perfectly fine\n\n\nSo far, custom map tiles on an OSM base map look like the thing I&#39;m looking for (or is there a better solution)? What would be the best way to create these tiles?\n",
            "excerpt": "I am looking for a small-scale and easy way to present one or more polygon shapefiles online (on a municipal website without any existing map-server infrastructure, to be precise). Right now, I&#39;m doin &hellip; ",
            "title": "Creating a small web-mapping/map-tiling service"
        },
        {
            "tags": [
                "geoserver",
                "postgresql",
                "postgis-2.0"
            ],
            "question_score": 26,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 37451,
            "item_type": "question",
            "score": 26,
            "last_activity_date": 1638124335,
            "creation_date": 1351076094,
            "body": "How do I publish PostGIS rasters using GeoServer?\n\nI have spent a lot of time trying to create a Raster datasource using Image Mosaic JDBC but with no luck. \n\nSteps performed: \n1. Downloaded and Installed the JDBC Image Mosaic extension (worked ok)\n2. Created the &quot;Connection Parameter&quot; files:\nconnect.postgis.xml.inc:\n\n\n\nmapping.postgis.xml.inc: \n\n\n\nosm.postgis.xml: \n\n\n\nwhere &quot;mosaic&quot; is a table (columns: name, titletable,minX,minY,maxX,maxY,resX,resY) containing one row: &quot;gfm, testrastertable, , , , , , ,&quot;\n 3. Saved the config files in ../geoserver/data_dir/coverages/\n 4. While trying to add an Image Mosaic JDBC data store I receive the following error:\n\n\n\nUpdate: Geoserver log\n\n\n",
            "excerpt": "/localhost:5432/db1&quot; /&gt;\n  &lt;driverClassName value=&quot;org.postgresql.Driver&quot;/&gt;\n  &lt;maxActive value=&quot;10&quot;/&gt;\n  &lt;maxIdle value=&quot;0&quot;/&gt;\n&lt;/connect&gt;\n\n\nmapping.postgis.xml.inc: \n\n&lt;spatialExtension name=&quot;postgis&quot;/&gt;\n&lt;<span class=\"highlight\">mapping</span> &hellip; ENTITY <span class=\"highlight\">mapping</span> PUBLIC &quot;<span class=\"highlight\">mapping</span>&quot;  &quot;mapping.postgis.xml.inc&quot;&gt;\n  &lt;! &hellip; ",
            "title": "Publishing PostGIS Rasters in GeoServer?"
        },
        {
            "tags": [
                "web-mapping",
                "references"
            ],
            "question_score": 83,
            "is_accepted": false,
            "answer_id": 8147,
            "is_answered": false,
            "question_id": 8113,
            "item_type": "answer",
            "score": 26,
            "last_activity_date": 1302007677,
            "creation_date": 1302007677,
            "body": "It looks like you have gotten the Open Source answers in the question above.  If your company has the budget, ESRI can be a very good option.  To clarify, the webmapping APIs in and of themselves are free to use, however the backend ArcGIS Server and SDE will cost you money.  Additioanlly, desktop software will be needed to create map services to be used in the web mapping application.  If you already have access to these resources or can purchase them, I would defintely recommend looking into ESRI solutions.\n\nOne benefit here is that you can code in a variety of languages.  There are ESRI specific APIs for Flex and Silverlight:\n\nFlex: http://help.arcgis.com/en/webapi/flex/index.html\nSilverlight: http://help.arcgis.com/en/webapi/silverlight/index.html\n\nCurrently it seems as if the trend in web programming is moving away from solutions that require plugins and are vendor specific (above), and towards more open source and standards based frameworks.  ESRI has this covered with the Javascript API:\n\nJavascript: http://help.arcgis.com/en/webapi/javascript/arcgis/\n\nIf you take a look at these API websites the documentation is very good.  Additionally, forums are available for community help on specific problems. Tech support through ESRI is also very good.  So it comes down to price and resources, if you already have these applications or have the budget this is an excellent path, if not the above open source solutions are worth looking into.\n",
            "excerpt": "Additioanlly, desktop software will be needed to create map services to be used in the web <span class=\"highlight\">mapping</span> application. &hellip; ",
            "title": "How to Start Web Mapping?"
        },
        {
            "tags": [
                "intersection",
                "spatialite",
                "shapely",
                "nearest-neighbor",
                "fiona"
            ],
            "question_score": 20,
            "is_accepted": true,
            "answer_id": 81628,
            "is_answered": false,
            "question_id": 81613,
            "item_type": "answer",
            "score": 25,
            "last_activity_date": 1388431677,
            "creation_date": 1388422763,
            "body": "I have reproduced your example with shapefiles. \n\nYou can use Shapely and Fiona to solve your problem.\n\n1) Your problem (with a shapely ):\n\n\n\n2) starting with an arbitrary line (with an adequate length):\n\n\n\n\n\n3) using shapely.affinity.rotate to create the radii (rotating the line from the point, look also the Mike Toews&#39;s answer at Python, shapely library: is it possible to do an affine operation on shape polygon?):\n\n\n\n\n\n4) now, using shapely:cascaded_union (or shapely:unary_union) to get a MultiLineString:\n\n\n\n5) the same with the original lines (shapefile)\n\n\n\n6) the intersection between the two multigeometries is computed and the result is saved to a shapefile:\n\n\n\nResult:\n\n\n\n7) but, problem, if you use a a longer radius, the result is different:\n\n\n\n8) And if you want to get your result, you need to select only the point with the shortest distance from the original point on a radius:\n\n\n\nFinal result:\n\n\n\nI hope that is what you want.\n",
            "excerpt": "schema = {&#39;geometry&#39;: &#39;MultiPoint&#39;,&#39;properties&#39;: {&#39;test&#39;: &#39;int&#39;}}\n with fiona.open(&#39;intersect.shp&#39;,&#39;w&#39;,&#39;ESRI Shapefile&#39;, schema) as e:\n      e.write({&#39;geometry&#39;:<span class=\"highlight\">mapping</span>(points), &#39;properties&#39;:{&#39;test&#39;: &hellip; ))\nsolution = cascaded_union(points_ok)\nschema = {&#39;geometry&#39;: &#39;MultiPoint&#39;,&#39;properties&#39;: {&#39;test&#39;: &#39;int&#39;}}\nwith fiona.open(&#39;intersect3.shp&#39;,&#39;w&#39;,&#39;ESRI Shapefile&#39;, schema) as e:\n     e.write({&#39;geometry&#39;:<span class=\"highlight\">mapping</span> &hellip; ",
            "title": "Finding Nearest Line Segments to Point using shapely?"
        },
        {
            "tags": [
                "android",
                "hardware-recommendations",
                "gps"
            ],
            "question_score": 23,
            "is_accepted": false,
            "answer_id": 174313,
            "is_answered": false,
            "question_id": 174225,
            "item_type": "answer",
            "score": 24,
            "last_activity_date": 1522113643,
            "creation_date": 1450379840,
            "body": "I maintain the GPSTest app on Google Play, which is open-source on Github.\n\nI&#39;m actively interested in adding Galileo support in the app, but to do this I need to know what IDs the Galileo satellites show up as in the Android platform.  And, this requires that there be some agreement between Galileo hardware manufacturers of those IDs - see Is there an industry-standard official mapping of Galileo satellites to global &quot;PRN”/ID values?.\n\nI personally haven&#39;t seen any Android devices reporting Galileo satellites yet - as soon as I do, and I&#39;m able to find out the ID range agreed upon for Galileo, I&#39;ll add support to GPSTest.\n\nIf you have an Android device that supports Galileo and you&#39;re willing to help identify the range, please comment on this Github issue.\n\nEDIT Sept. 19, 2016\n\nFor Android 7.0 (N) and higher, Google has added a new API in Android that allows apps to explicitly determine the GNSS type of each satellite for the following GNSS constellation (from https://developer.android.com/reference/android/location/GnssStatus.html).\n\nI&#39;ll work on adding this to GPSTest, and will update my answer when it&#39;s live.\n\nEDIT Oct. 6th, 2016\n\nI have a working build of GPSTest that I believe should support Galileo.  If you have and a device with Galileo support (i.e., hardware), please comment on the below pull request on Github - I&#39;d love to get feedback to know if it works!\n\nhttps://github.com/barbeau/gpstest/pull/59\n\nEDIT Oct. 26, 2016\n\nGPSTest v2.1.8 and up now supports Galileo!  Download on Google Play at https://play.google.com/store/apps/details?id=com.android.gpstest.  Supports all devices with Android 7.0 (N) that have a Galileo-compatible chipset. Support for Galileo on Android 6.0.1 (M) and lower will depend on your device OEM.\n\nSo far users have confirmed that they are able to see Galileo satellites using GPSTest on the following devices:\n\n\nBQ Aquaris X5 Plus (See this post)\nHuawei Mate 9 (See this post)\nSamsung Galaxy S8 and S8+ (See this post and official specs which say &quot;Location (GPS, Galileo, Glonass, BeiDou) *Galileo and BeiDou coverage may be limited.&quot;)\nOnePlus 5 (Android 7.1.1 / OxygenOS 4.5.8) (See this post)\nHuawei P10 (See this post - Android 7.0, firmware version L29C432B171)\nOnePlus 5T (See this post)\n\n\nEDIT Mar. 26, 2018\n\nThe site UseGalileo.eu (by the EU GSA that operates Galileo) now has a list of devices and chipsets that support Galileo:\n\n\nGalileo-compatible smartphones and chipsets\n\n",
            "excerpt": "And, this requires that there be some agreement between Galileo hardware manufacturers of those IDs - see Is there an industry-standard official <span class=\"highlight\">mapping</span> of Galileo satellites to global &quot;PRN”/ID values? &hellip; ",
            "title": "Android devices and apps with support for Galileo positioning?"
        },
        {
            "tags": [
                "python",
                "gdal",
                "pygeoprocessing"
            ],
            "question_score": 15,
            "is_accepted": false,
            "answer_id": 260380,
            "is_answered": false,
            "question_id": 260304,
            "item_type": "answer",
            "score": 24,
            "last_activity_date": 1509901112,
            "creation_date": 1509551021,
            "body": "You can use rasterio to extract the raster values within a polygon as in GIS SE: GDAL python cut geotiff image with geojson file\n\nI use here a one band raster file and GeoPandas for the shapefile ( instead of Fiona) \n\n\n\n\n\nThe out_image result is a Numpy masked array\n\n\n\nNow I use How to I get the coordinates of a cell in a geotif? or Python affine transforms to transform between the pixel and projected coordinates with   as the affine transform for the subset data\n\n\n\nCreation of a new resulting GeoDataFrame with the col, row and elevation values\n\n\n\n\n",
            "excerpt": "extract the geometry in GeoJSON format\ngeoms = shapefile.geometry.values # list of shapely geometries\ngeometry = geoms[0] # shapely geometry\n# transform to GeJSON format\nfrom shapely.geometry import <span class=\"highlight\">mapping</span> &hellip; geoms = [<span class=\"highlight\">mapping</span>(geoms[0])]\n# extract the raster values values within the polygon \nwith rasterio.open(&quot;raster.tif&quot;) as src:\n     out_image, out_transform = mask(src, geoms, crop=True)\n\n\nThe out_image &hellip; ",
            "title": "Extract raster values within shapefile with pygeoprocessing or gdal"
        },
        {
            "tags": [
                "latitude-longitude",
                "mapping"
            ],
            "question_score": 11,
            "is_accepted": true,
            "answer_id": 221433,
            "is_answered": false,
            "question_id": 221431,
            "item_type": "answer",
            "score": 24,
            "last_activity_date": 1481810816,
            "creation_date": 1481733950,
            "body": "They are likely &quot;Degrees, Decimal Minutes&quot;.\n\nConversion to Decimal Degrees\n\nYou can convert it to &quot;Decimal Degrees&quot; by diving the &quot;Decimal Minutes&quot; by 60 and adding the result to the Degrees:\n\n\n\nConversion to Degrees Minutes Seconds\n\nOr you can convert to &quot;Degrees Minutes Seconds&quot; by multiplying the fractional side of the &quot;Decimal Minutes&quot; by 60 to get the Seconds:\n\n\n",
            "excerpt": "They are likely &quot;Degrees, Decimal Minutes&quot;.\n\nConversion to Decimal Degrees\n\nYou can convert it to &quot;Decimal Degrees&quot; by diving the &quot;Decimal Minutes&quot; by 60 and adding the result to the Degrees:\n\n21.440  &hellip; ",
            "title": "What types of lat/long coordinates are these?"
        },
        {
            "tags": [
                "r",
                "cartography"
            ],
            "question_score": 41,
            "is_accepted": true,
            "answer_id": 48858,
            "is_answered": false,
            "question_id": 48828,
            "item_type": "answer",
            "score": 24,
            "last_activity_date": 1360691880,
            "creation_date": 1358952102,
            "body": "In addition to the ones posted here, in the R gallery website there are a few examples: \n\n\nhttp://gallery.r-enthusiasts.com/graph/SuperStorm_Sandy_170\nhttp://gallery.r-enthusiasts.com/RGraphGallery.php?graph=146  \nhttp://gallery.r-enthusiasts.com/RGraphGallery.php?graph=113\n\n\n\n\nother websites with tutorials and good mapping examples in R:\n\n\nhttp://www.molecularecologist.com/2012/09/making-maps-with-r/\nhttp://www.r-bloggers.com/create-maps-with-maptools-r-package/\nhttp://procomun.wordpress.com/2012/02/18/maps_with_r_1/   \nhttp://www.nceas.ucsb.edu/scicomp/usecases/CreateMapsWithRGraphics\n\n\nI hope this helps. The last one gives you one example with vector data and another with satellite imagery, while the r-bloggers has many other mapping examples with R.\n",
            "excerpt": "graph=113\n\n\n\n\nother websites with tutorials and good <span class=\"highlight\">mapping</span> examples in R:\n\n\nhttp://www.molecularecologist.com/2012/09/making-maps-with-r/\nhttp://www.r-bloggers.com/create-maps-with-maptools-r-package &hellip; The last one gives you one example with vector data and another with satellite imagery, while the r-bloggers has many other <span class=\"highlight\">mapping</span> examples with R. &hellip; ",
            "title": "Making beautiful maps in R?"
        },
        {
            "tags": [
                "qgis",
                "grass-gis"
            ],
            "question_score": 52,
            "is_accepted": false,
            "answer_id": 59965,
            "is_answered": false,
            "question_id": 59964,
            "item_type": "answer",
            "score": 24,
            "last_activity_date": 1367831104,
            "creation_date": 1367829384,
            "body": "GRASS is usually used for scientific purposes. So unless you want to do some sophisticated spatial analysis or routine, just stick with QGIS. Also GRASS works with its own formats so you will have to import/export data to exchange data with someone. Even if you will need sophisticated spatial analysis or routine at some point you will be able to do it with SEXTANTE plugin (GRASS support included) for QGIS. In QGIS there was also a plugin for communication with GRASS but SEXTANTE took its place. I think for simple mapping purposes you should use QGIS. \n",
            "excerpt": "I think for simple <span class=\"highlight\">mapping</span> purposes you should use QGIS. &hellip; ",
            "title": "Choosing between QGIS and GRASS for simple thematic maps with different layers"
        },
        {
            "tags": [
                "open-source-gis",
                "references"
            ],
            "question_score": 24,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 22030,
            "item_type": "question",
            "score": 24,
            "last_activity_date": 1697698462,
            "creation_date": 1332278761,
            "body": "I am preparing an intermediate GIS course for graduate and undergraduate students who have likely not been in touch with anything but Esri software. It is an existing course in the curriculum that I will be teaching for the first time. Currently, ArcGIS is the software of choice for the lab sections and practical assignments.\nI want to tweak the course a little to include an introduction to Open Source GIS alternatives. For now, this part of the course will only be two to four weeks (I&#39;m thinking a kind of extended epilogue) so I won&#39;t be able to dig too deep. I hope to branch this off into a full Open Source GIS course next year, but curriculum constraints prohibit me from doing that right away.\nHere&#39;s some reading I have been considering to support the Open Source GIS part of the course, to give you an idea of what I&#39;m (not) looking for:\n\nThe Geospatial Desktop is a book I&#39;d love to use for a full Open Source GIS course but is too much to cover in a few weeks. The chapter &#39;Survey Of Desktop Mapping Software&#39; looks like something I could use.\nThe Dekstop GIS book is of similar breadth but currently out of print.\nThe Grass Book seems too focused on GRASS. I think GRASS will put students with an ArcGIS mindset off. Also, I want them to learn about the breadth of the OS geospatial software spectrum.\n&#39;How to go from GIS novice to Pro without spending a Dime&#39; takes a good, practical approach to delving into OS GIS, and has good links for further reading.\nA white paper from OpenGeo talking about markets for geospatial software, and how that landscape is changing.\n\nCan you suggest other articles and / or books that would be useful to ease students coming from an Esri / ArcGIS background into becoming aware of and using Open Source alternatives?\n",
            "excerpt": "The chapter &#39;Survey Of Desktop <span class=\"highlight\">Mapping</span> Software&#39; looks like something I could use.\nThe Dekstop GIS book is of similar breadth but currently out of print.\nThe Grass Book seems too focused on GRASS. &hellip; ",
            "title": "Seeking introductory books or articles about Open Source GIS for students coming from Esri background"
        },
        {
            "tags": [
                "cartography"
            ],
            "question_score": 184,
            "is_accepted": false,
            "answer_id": 3267,
            "is_answered": false,
            "question_id": 3083,
            "item_type": "answer",
            "score": 24,
            "last_activity_date": 1289069684,
            "creation_date": 1289069684,
            "body": "From the hip my answer would be Stephen Walter&#39;s &#39;The island&#39;: witty, irreverent, slightly subversive he has hand drawn a map of London representing it as an island (poking fun at Londoners&#39; London centric view of the world).  \n\nhttp://www.bl.uk/magnificentmaps/map4.html\n\nI think its beautiful as its highly original, detailed, fascinating and I interpret it as sending up the idea of maps themselves.\n\nHaving said that I think the question is too vague, it would be more useful if it were more specific. IMHO there are a number of separate characteristics that make up map beauty:\n\nFunction: Is it fit for purpose?  My vote for this type would be the London tube map: Original and highly functional it sacrifices distance representation to show the network with more clarity.\n\nAesthetics: The Island map\n\nHistorical Interest: A personal favourite is the Geological map of the UK by William Smith - a world first.\n\n\nhe did this pretty much by himself over 15 (I think) years, before him no one had thought of mapping what was below the ground.\n\nI&#39;d be most interested in hearing people&#39;s examples of maps representing outstanding functionality.\n",
            "excerpt": "he did this pretty much by himself over 15 (I think) years, before him no one had thought of <span class=\"highlight\">mapping</span> what was below the ground. &hellip; ",
            "title": "Seeking examples of beautiful maps?"
        },
        {
            "tags": [
                "python",
                "shapely",
                "fiona",
                "geopandas"
            ],
            "question_score": 19,
            "is_accepted": true,
            "answer_id": 150001,
            "is_answered": false,
            "question_id": 149959,
            "item_type": "answer",
            "score": 24,
            "last_activity_date": 1478132417,
            "creation_date": 1433592884,
            "body": "The question is about Fiona and Shapely and the other answer using GeoPandas requires to also know Pandas. Moreover GeoPandas uses Fiona to read/write shapefiles. \n\nI do not question here the utility of GeoPandas, but you can do it directly with Fiona using the standard module itertools, specially with the command groupby (&quot;In a nutshell, groupby takes an iterator and breaks it up into sub-iterators based on changes in the &quot;key&quot; of the main iterator. This is of course done without reading the entire source iterator into memory&quot;, itertools.groupby).\n\nOriginal Shapefile coloured by the STATEFP field\n\n\n\n\n\nResult\n\n\n",
            "excerpt": "Original Shapefile coloured by the STATEFP field\n\n\n\nfrom shapely.geometry import shape, <span class=\"highlight\">mapping</span>\nfrom shapely.ops import unary_union\nimport fiona\nimport itertools\nwith fiona.open(&#39;cb_2013_us_county_20m.shp &hellip; feature in group])\n            # write the feature, computing the unary_union of the elements in the group with the properties of the first element in the group\n            output.write({&#39;geometry&#39;: <span class=\"highlight\">mapping</span> &hellip; ",
            "title": "Dissolving polygons based on attributes with Python (shapely, fiona)?"
        },
        {
            "tags": [
                "coordinate-system",
                "united-states"
            ],
            "question_score": 24,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 141580,
            "item_type": "question",
            "score": 24,
            "last_activity_date": 1705280156,
            "creation_date": 1428335583,
            "body": "If I wanted to project latitude &amp; longitude data for the contiguous United States (the United States excluding Alaska and Hawaii), which projection would I use? I prefer more accurate distances followed by shapes\n",
            "excerpt": "If I wanted to project latitude &amp; longitude data for the contiguous United States (the United States excluding Alaska and Hawaii), which projection would I use? I prefer more accurate distances follow &hellip; ",
            "title": "Which projection is best for mapping the contiguous United States?"
        },
        {
            "tags": [
                "geoserver",
                "arcgis-server",
                "google-earth",
                "software-recommendations",
                "google-earth-enterprise"
            ],
            "question_score": 23,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 9896,
            "item_type": "question",
            "score": 23,
            "last_activity_date": 1607846099,
            "creation_date": 1305743395,
            "body": "I&#39;m working on a web app that includes mapping capabilities (currently just markers and KML overlays on an embedded Google Map). We&#39;re starting to outgrow the limitations of Google&#39;s free stuff, and Google Earth Enterprise initially seemed to be the natural upgrade path. But at least judging from the tags on this site, it doesn&#39;t seem like it gets a lot of use in the GIS community. \n\nHas anyone used GEE who could compare it to the more widely used server platforms?\n",
            "excerpt": "I&#39;m working on a web app that includes <span class=\"highlight\">mapping</span> capabilities (currently just markers and KML overlays on an embedded Google Map). &hellip; ",
            "title": "Comparing Google Earth Enterprise to ArcGIS for Server and GeoServer?"
        },
        {
            "tags": [
                "coordinate-system",
                "epsg"
            ],
            "question_score": 18,
            "is_accepted": false,
            "answer_id": 242547,
            "is_answered": false,
            "question_id": 242545,
            "item_type": "answer",
            "score": 23,
            "last_activity_date": 1686381168,
            "creation_date": 1496400749,
            "body": "It is a projection of a spheroid on a flat surface.  Every projection has strengths and weaknesses and will preserve some elements of direction, distance or area better or worse than others (which is why careful selection of a suitable, that is local where possible,  projection is so important).\nSo, while the unit of measurement in EPSG:3857 is indeed meters, as you have correctly spotted, distance measurements become increasingly inaccurate away from the equator. All Mercator-style projections have the same limitation as they move away from their reference point. But, where they are not global, the error can be minimized by appropriate positioning of this point.  It is for this reason there are so many UTM zones for instance.  Other projections have different strengths and weaknesses depending on use (e.g. navigation vs cartography).\nSo what&#39;s the point of EPSG:3857?  To understand that, you must understand that it was designed for web mapping and is square so that the map tiles fit nicely into a powers-of-two schema as you progress through each successive zoom-level.  This is EPSG:3857&#39;s particular strength.  It is not designed for distance and area calculations.  There are many much better alternatives.  If you are not using the data for web mapping, I would strongly encourage you to consider some other projection that is more suitable to your use-case, especially if you intend to do distance calculations (or, in that event, cast your data in geographic coordinates and not Cartesian coordinates and use the Haversine formula to calculate distances on a sphere).\nEDIT (re comments):\nThe diagram added to the OP&#39;s question basically is a diagram of my first paragraph, viz that the project introduces distortion.  For more information on how the Earth is projected in this case see here.  The unit of measurement for Web Mercator is NOT pixels but meters.  The OP&#39;s question results from a misunderstanding.   Vector data can also be projected in Web Mercator.  In this case there are no pixels.  So you see, the concept of a unit of measurement as pixels has no relationship to the real world.  However, pixels-per-meter is relevant for a raster as this tells us the resolution of the image.  BUT the unit of measurement is still meters (in this case) and not pixels.\nWhere the confusion for the OP possibly arises is the use of Web Mercator at various zoom levels where tiles are usually set to be 256x256 pixels and a given zoom level has a certain nominal ground resolution, so some web mapping applications use screen pixels as a means of calculating distance.  But, the pixels are interpreted as a meters-distance in relation to the zoom level (and possibly latitude).\n",
            "excerpt": "To understand that, you must understand that it was designed for web <span class=\"highlight\">mapping</span> and is square so that the map tiles fit nicely into a powers-of-two schema as you progress through each successive zoom-level &hellip; If you are not using the data for web <span class=\"highlight\">mapping</span>, I would strongly encourage you to consider some other projection that is more suitable to your use-case, especially if you intend to do distance calculations &hellip; ",
            "title": "How can EPSG:3857 be in meters?"
        },
        {
            "tags": [
                "symbology",
                "software-recommendations"
            ],
            "question_score": 23,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 9,
            "is_answered": true,
            "question_id": 6171,
            "item_type": "question",
            "score": 23,
            "last_activity_date": 1562202674,
            "creation_date": 1297797961,
            "body": "When a user clicks on a map what should they expect to see? \n\nI would say a symbol for where they clicked.  A pushpin seems to be the most accepted icon for generic data. Google has pushed the upside down tear drop. \n\nWhat are other ideas/options and is there a place for finding professional gis oriented icon packs?\n\nI ended up creating this, \n\n\n\nThis just popped up from the guys at map box. Clean maki icons\n",
            "excerpt": "When a user clicks on a map what should they expect to see? \n\nI would say a symbol for where they clicked.  A pushpin seems to be the most accepted icon for generic data. Google has pushed the upside  &hellip; ",
            "title": "Seeking Symbology for Interactive Mapping?"
        },
        {
            "tags": [
                "references"
            ],
            "question_score": 76,
            "is_accepted": false,
            "answer_id": 294,
            "is_answered": false,
            "question_id": 202,
            "item_type": "answer",
            "score": 23,
            "last_activity_date": 1322251510,
            "creation_date": 1279948650,
            "body": "Here&#39;s my &quot;recent&quot; favourites, both cartography-related:\n\n\nDesigning Better Maps: A Guide for GIS Users by Cynthia Brewer  \n\n\n\n\n\nMaking Maps: A Visual Guide to Map Design for GIS by John Krygier and Denis Wood\n\n\n\n\nUnfortunately, and this is kind of sad, I have to admit that I haven&#39;t read a single GIS book in years.\n\nThe basic principles and practices of GIS haven&#39;t changed more than incrementally in the last half-decade, and the cool new technologies--commercial mapping APIs, KML, REST, location-based games and services, etc--have all been advancing at a frenetic pace since 2005 (note the publication date of the two books above)\n\nIf new technology matters to you (and it should) and you think you can rely on books, you may as well give up and go home.  To survive in this environment, you need to be adept with blogs and online documentation, and be willing to experiment.\n",
            "excerpt": "The basic principles and practices of GIS haven&#39;t changed more than incrementally in the last half-decade, and the cool new technologies--commercial <span class=\"highlight\">mapping</span> APIs, KML, REST, location-based games and services &hellip; ",
            "title": "What books, journals, and electronic resources are most valuable for expanding knowledge of GIS?"
        },
        {
            "tags": [
                "openstreetmap",
                "google-maps",
                "crowdsourcing"
            ],
            "question_score": 31,
            "is_accepted": false,
            "answer_id": 24842,
            "is_answered": false,
            "question_id": 24820,
            "item_type": "answer",
            "score": 22,
            "last_activity_date": 1336265686,
            "creation_date": 1336265686,
            "body": "It&#39;s worth noting that at Google Maps, you&#39;re not &#39;donating&#39; your geographic knowledge -- you are giving your geographic knowledge to a for-profit corporate entity, who have a duty to their shareholders to use their position as a majority data holder in the worldwide map data market to increase the value of their company.\n\nThis means that the data that you give to Google is not necessarily something that you can get back out and do what you want with. For example, if you imagine that you start a business making GPS Maps for Bikes, or some such, down the road, getting the data that you give to Google back out for use in the product you want to sell may be difficult, or simply a violation of the Terms of Service which you would not be allowed to pursue.\n\nOpenStreetMap is openly licensed dataset. It is created and supported by more than 500,000 editors, and the data is available for libre (that is, &#39;free as in freedom&#39;) use under the terms of the ODBL, which would allow you to make the GPS Maps For Bikes app without needing to pay a licensing fee to anyone.\n\nData you add to Google Maps is collectively licensed to Google. (Your individual contributions presumably have relatively limited value outside the collection of data, as is the case in almost any map-making effort.)  If you do something Google doesn&#39;t want, then they can say No, and shut you down. Innovation by third parties outside the scope of what limitations Google provides for is not allowed.\n\nOpenStreetMap data is openly licensed and managed by a non-profit organization dedicated to furthering the use of geographic information around the world. If no one has done the new cool thing that you want to do -- you can get the data, and do it. \n\nShort term, you may get more out of Google -- with a massive corporate investment in user-targeted tools, and a massive investment in initial data -- but over time, OpenStreetMap&#39;s openly licensed data is likely to be the more sustainable solution. With half a million editors, and the growing investment from national mapping agencies around the globe, I can&#39;t imagine any way in which OSM is not the more appropriate map provider to support for the long term.\n",
            "excerpt": "With half a million editors, and the growing investment from national <span class=\"highlight\">mapping</span> agencies around the globe, I can&#39;t imagine any way in which OSM is not the more appropriate map provider to support for the &hellip; ",
            "title": "Donating and volunteering geographical knowledge?"
        },
        {
            "tags": [
                "web-mapping",
                "software-recommendations",
                "php"
            ],
            "question_score": 22,
            "is_accepted": true,
            "answer_id": 13878,
            "is_answered": false,
            "question_id": 13868,
            "item_type": "answer",
            "score": 22,
            "last_activity_date": 1494444799,
            "creation_date": 1314036468,
            "body": "Fortunately for you (and all of us!), there are plenty of available (and mature!) options in the FOSS4G world!\n\nFollowing your technology preferences here&#39;s some examples:\n\n\nPython\n\n\nMapfish (not updated since 2011)\nGeoDjango \n\nPHP\n\n\nPMapper\n\npure Javascript\n\n\nOpenLayers\nLeafLet\nOpenLayers + ExtJS\nOpenLayers + Jquery Mapquery, jeobrowser\n\n\n\nFor a more complete reference please visit OSGeo.org. It&#39;s an umbrella organization for the most popular FOSS geospatial projects out there.\n\nMaybe if you&#39;re in the neighborhood you can visit the annual FOSS4G conference. Here&#39;s a list of workshops that happened in 2011 regarding web mapping technologies:\n\n\nMapFish in Production\nIntroduction to Geomajas\nThe Moose is loose, Mapping with GeoMoose\nOpenLayers Application Development\nWeb Mapping with GeoServer\nDeveloping OGC Compliant Web Applications With GeoExt\nInteractive space-time dynamics: A hands-on introduction to i2maps\nA complete open source web mapping stack\nThere&#39;s JavaScript in your backend: Front to Back JavaScript with NodeJS and Polymaps\n\n\nAs for my personal experience developing web mapping applications based on pure javascript/html/css frameworks (OpenLayers/jQuery) can be really straightforward. \n",
            "excerpt": "Here&#39;s a list of workshops that happened in 2011 regarding web <span class=\"highlight\">mapping</span> technologies:\n\n\nMapFish in Production\nIntroduction to Geomajas\nThe Moose is loose, <span class=\"highlight\">Mapping</span> with GeoMoose\nOpenLayers Application Development &hellip; Web <span class=\"highlight\">Mapping</span> with GeoServer\nDeveloping OGC Compliant Web Applications With GeoExt\nInteractive space-time dynamics: A hands-on introduction to i2maps\nA complete open source web <span class=\"highlight\">mapping</span> stack\nThere&#39;s JavaScript &hellip; ",
            "title": "Seeking developer-friendly web GIS?"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcgis-10.2",
                "attribute-table",
                "fields-attributes"
            ],
            "question_score": 22,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 9,
            "is_answered": true,
            "question_id": 81168,
            "item_type": "question",
            "score": 22,
            "last_activity_date": 1601595756,
            "creation_date": 1387632106,
            "body": "How can I change the field names (not the alias) in ArcGIS 10.2?\nI already found this page on ArcGIS support: &quot;Renaming shapefile fields (Defense Mapping)&quot; but there is is not &quot;Defense Mapping&quot; on Customized Mode Categories In my ArcCatalog!\nWithout access to Defense Mapping, how can I change the field names?\n",
            "excerpt": "I already found this page on ArcGIS support: &quot;Renaming shapefile fields (Defense <span class=\"highlight\">Mapping</span>)&quot; but there is is not &quot;Defense <span class=\"highlight\">Mapping</span>&quot; on Customized Mode Categories In my ArcCatalog! &hellip; Without access to Defense <span class=\"highlight\">Mapping</span>, how can I change the field names? &hellip; ",
            "title": "Changing Field Name in ArcGIS Desktop"
        },
        {
            "tags": [
                "privacy"
            ],
            "question_score": 22,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 81321,
            "item_type": "question",
            "score": 22,
            "last_activity_date": 1484158841,
            "creation_date": 1387877701,
            "body": "I often work on mapping sensitive patient level data. Whilst I feel I have a good grasp of many of the governance issues around this (ie when to use binning and k-anonymity techniques) but I&#39;d like to improve my knowledge on this.\n\nHere is a good example of why this is of importance: Spatial confidentiality and GIS: re-engineering mortality locations from published maps about Hurricane Katrina\n\nDoes anyone have any good rules of thumb they employ when mapping sensitive data?\n\nAre there any good resources out there which cover different methods of protecting confidentiality or provide guidance on the matter?\n",
            "excerpt": "I often work on <span class=\"highlight\">mapping</span> sensitive patient level data. &hellip; of why this is of importance: Spatial confidentiality and GIS: re-engineering mortality locations from published maps about Hurricane Katrina\n\nDoes anyone have any good rules of thumb they employ when <span class=\"highlight\">mapping</span> &hellip; ",
            "title": "GIS Related Information Governance"
        },
        {
            "tags": [
                "arcgis-desktop",
                "coordinate-system",
                "epsg",
                "srid"
            ],
            "question_score": 22,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 83861,
            "item_type": "question",
            "score": 22,
            "last_activity_date": 1564360337,
            "creation_date": 1390402195,
            "body": "I don&#39;t know so much about coordinate systems...\n\nIn my office we use to deal with spatial data coming from archaeological sites. Each site has its own x-y-z coordinate system (GCS). Three simple ortogonal cartesian axis.\nIn the last years we have been managing this spatial data through GIS software (ArcGIS), without using specific coordinate system (just leave it as &quot;undefined&quot;)\n\nI&#39;d like to know if there exisits any GCS designed to deal with such datasets using simple cartesian orthogonal axis, without grid distortions of the typical GCS. In addition, I&#39;d like to know if this system is suitable for using it in an online mapping application.\n\nBy the way, we manage 2D (ArcMap) and 3D (ArcScene) environments and work with &quot;mm&quot; as length base unit. \n\nIf such a thing doesn&#39;t exists, maybe someone knows how to create it.\n",
            "excerpt": "In addition, I&#39;d like to know if this system is suitable for using it in an online <span class=\"highlight\">mapping</span> application. &hellip; ",
            "title": "Using customized Coordinate System in ArcGIS Desktop?"
        },
        {
            "tags": [
                "cartography"
            ],
            "question_score": 118,
            "is_accepted": false,
            "answer_id": 2907,
            "is_answered": false,
            "question_id": 2887,
            "item_type": "answer",
            "score": 22,
            "last_activity_date": 1288052486,
            "creation_date": 1288052486,
            "body": "I am slightly red-green colourblind (in that I can still see red and green fine, but have difficulty with say a red and green line next to each other). Does make it a bit easier for me to make maps for people that are red-green colourblind.\n\nIn addition to color brewer and vischeck mentioned above, the GIMP has colourblind filters built in so you can adjust images as part of post processing. Photoshop has the same kinds of filters if you have access.\n\nLastly the ESRI Mapping centre has a set of styles for download that include a colour set suitable for colour deficiency.\n\nHope that helps!\n",
            "excerpt": "Lastly the ESRI <span class=\"highlight\">Mapping</span> centre has a set of styles for download that include a colour set suitable for colour deficiency.\n\nHope that helps! &hellip; ",
            "title": "Accounting for Colour Blindness when designing maps?"
        },
        {
            "tags": [
                "postgis",
                "openlayers",
                "web-mapping",
                "software-recommendations"
            ],
            "question_score": 22,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 7,
            "is_answered": true,
            "question_id": 1190,
            "item_type": "question",
            "score": 22,
            "last_activity_date": 1478120179,
            "creation_date": 1281856570,
            "body": "I am very new to web-mapping, so this question may be a little misguided.\n\nI want to have a very simple web interface using OpenLayers (or even Google Maps if that will be easier) which can display a number of point and polygon tables that are currently in PostGIS.\n\nI want this to be as simple (and as low maintainence) as possible:\n\n\nI don&#39;t want to have to create tiles (unless there is a very good reason), or have a massive, complex layer of middleware.  \nPerformance doesn&#39;t need to be phenomenal, as this is for internal use and thus doesn&#39;t need to scale beyond a couple of concurrent users.\nStyling of the vector layers is of minimal importance.\nOpen source tools are much preferred as I have almost no budget for this.\n\n\nWhat is the recommended approach for this?\n",
            "excerpt": "I am very new to web-<span class=\"highlight\">mapping</span>, so this question may be a little misguided. &hellip; ",
            "title": "Options for displaying PostGIS vectors in OpenLayers"
        },
        {
            "tags": [
                "python",
                "arcobjects",
                "comtypes"
            ],
            "question_score": 143,
            "is_accepted": false,
            "answer_id": 5717,
            "is_answered": false,
            "question_id": 80,
            "item_type": "answer",
            "score": 22,
            "last_activity_date": 1359145891,
            "creation_date": 1296603949,
            "body": "\nHow do I access arcobjects from python?\n\nIf what you are looking for is specific functionality that exists and is in the C++ Arcobjects code, then your best bet would be to create C++ methods to call them.... and then create a python wrapper to access those C++ methods.\nThere are quite a few ways to access C++ methods from python, and lots of people that do so use a tool like SWIG to auto-generate the python classes from the C++ method signatures. It&#39;s been my experience that these autogenerated APIs get pretty nasty when passing non-native C++ types (int, floats) and are never very &#39;pythonic&#39;.\nMy recommended solution would be to use the ctypes API. A great tutorial is here: http://python.net/crew/theller/ctypes/tutorial.html\nThe basic steps are:\n\nwrite some of your core logic in C++, the ones where you believe python performance might be an issue\nCompile that core logic (in this case using the ArcObject C++ API method calls) from object files into a shared (.so) or dynamic library (.dll) using whatever system compiler (nmake,make, etc.)\nWrite a ctypes mapping between the python class and the C++ method signature [SWIG tries to automate this, but it&#39;s easy, even if using crazy object types]\nImport the compiled library into your python program and use the bound class/method bindings like any other python class!\n\nThis is probably more general way to reference C/C++ code from within python, it is probably going to be much simpler in the long run if you don&#39;t have to deal with COM objects. It also will allow all of the system specific functionality reside in the compilation of the linked library object (so the python will not be system/python implementation specific).\n",
            "excerpt": "Write a ctypes <span class=\"highlight\">mapping</span> between the python class and the C++ method signature [SWIG tries to automate this, but it&#39;s easy, even if using crazy object types]\nImport the compiled library into your python &hellip; ",
            "title": "Accessing ArcObjects from Python"
        },
        {
            "tags": [
                "qgis",
                "raster",
                "dem",
                "terrain",
                "curvature"
            ],
            "question_score": 30,
            "is_accepted": false,
            "answer_id": 37069,
            "is_answered": false,
            "question_id": 37066,
            "item_type": "answer",
            "score": 22,
            "last_activity_date": 1684140762,
            "creation_date": 1350567724,
            "body": "Curvature is a complex terrain derivative to compute, the equation that you use depends on the resolution of your input data, as you have to ensure that the curvature results you compute can be distinguished from noise in the data.\nA lot of research has been done recently on curvature calculations on high resolution LiDAR data which showed that a scaling break exists at around 2 or 3 metres resolution and above this point more different algorithms (which I am not as familiar with) need to be used. The best information about calculating topographic curvature probably comes from Hurst et al 2012 and the references therein.\nThe basic principle of curvature calculation, as with slope and aspect, is to pass a moving window over the elevation surface and fit the elevation values to a 6 term polynomial function, the coefficients of which will yield the slope, aspect and curvature of the centre cell of the moving window.\nArcGIS uses a 3x3 search window which will only yield good results in areas completely devoid of vegetation, which makes the tool fairly useless unless people are aware of this limitation, this may suggest why it is not present in QGIS.\nThe maths was derived originally (I think) in Evans (1980) and was simplified in a few pages in Principles of Geographical Information Systems (Amazon link) which I can recommend as a good guide to this kind of terrain analysis at a basic level.\nOne way to calculate curvature of a DEM is to convert the DEM into an ascii raster, read it into a numpy array and then perform the polynomial fitting on a moving window passing through the data. This is fairly easy to do, but is very slow to execute and needs a fair amount of optimization (these kind of operations often get ported to c++ to speed them up).\nTo perform the operation in QGIS you can use the GRASS plugin r.slope.aspect which is also limited by the 3x3 fixed window.\nI realize this is not the simple answer you were doubtless hoping for, but I hope you understand that curvature is complex to derive in a meaningful way. All the best.\n\n",
            "excerpt": "S. (1980), An integrated system of terrain analysis and slope <span class=\"highlight\">mapping</span>, Z. Geomorphol., 36, 274–295. &hellip; ",
            "title": "Calculating terrain Curvature in QGIS"
        },
        {
            "tags": [
                "polygon",
                "vector",
                "algorithm"
            ],
            "question_score": 13,
            "is_accepted": false,
            "answer_id": 104338,
            "is_answered": false,
            "question_id": 68359,
            "item_type": "answer",
            "score": 22,
            "last_activity_date": 1410225677,
            "creation_date": 1404735834,
            "body": "I&#39;ve figured out an algorithm for the grid approach using several Python tools. Rasterising and polygonising is done with rasterio, which is based on GDAL/OGR.  Here are most of the imports:\n\n\n\nFirst, get a few polygon shapes to do statistics with. The list of shape must be sort-of overlapping, otherwise this procedure won&#39;t work as well. There are many way to get these shape into Python, e.g., read a Shapefile with fiona.\n\n\n\nOr how about these five polygons:\n\n\n\n\n\nIn order to grid the vectors, some appropriate raster resolutions need to be determined, and applied to the data extents. E.g., I&#39;m doing everything on a 1 metre grid, but it can be modified to any number. Then build an affine geotransform from the upper-left corner.\n\n\n\nLoop through each polygon, and rasterise them to a grid, where each will be 0 outside the polygon and 1 inside. With each result, accumulate a values to the array , which we&#39;ll normalise to values 0.0 (zero coverage) to 1.0 (all covered). This raster is basically the probability that a polygon covers the grid.\n\n\n\n\n\nThe next step is really only needed if you want a smoothish result from only a few overlapping polygons. It will blur the sharp edges of probability array. You will need a modified  function with full convolution to avoid edge distortions, which modifies the geotransform size.\n\n\n\nNow use the function to do a Gaussian blur on a radius of 100 grid cells (or 100 m in this example), and return the larger-sized array and geotransform results:\n\n\n\n\n\nNow the &quot;average&quot; result can be extracted by selecting a quantile threshold. So, using 0.1 will select a larger area that 10% or more of the polygons cover, while 0.95 will choose a smaller area with 95% coverage. Using 0.5 is the median quantile threshold close to what could be called &quot;average&quot;. Because this example has an odd-number of shapes we get a nice result, but with even-numbers of samples the result is really sensitive.\n\n\n\n\n\nConvert the grid result back to vector, and simplify-away the jagged pixel shapes using a minimum distance of a grid diagonal (or more).\n\n\n\n\n",
            "excerpt": "Here are most of the imports:\n\nimport rasterio\nimport numpy as np\nfrom rasterio import Affine, features\nfrom shapely.geometry import <span class=\"highlight\">mapping</span>, shape\nfrom shapely.ops import cascaded_union\nfrom math import &hellip; if not any(poly_shapes):\n    raise ValueError(&quot;could not find any shapes&quot;)\navg_poly = cascaded_union(poly_shapes)\n# Simplify the polygon\nsimp_poly = avg_poly.simplify(sqrt(dx**2 + dy**2))\nsimp_shape = <span class=\"highlight\">mapping</span> &hellip; ",
            "title": "Creating &quot;average&quot; polygon?"
        }
    ],
    "has_more": true,
    "quota_max": 300,
    "quota_remaining": 298
}