{
    "items": [
        {
            "tags": [
                "coordinates",
                "latitude-longitude",
                "gis-principle",
                "accuracy",
                "precision"
            ],
            "question_score": 609,
            "is_accepted": true,
            "answer_id": 8674,
            "is_answered": false,
            "question_id": 8650,
            "item_type": "answer",
            "score": 980,
            "last_activity_date": 1707411153,
            "creation_date": 1303143449,
            "body": "Accuracy is the tendency of your measurements to agree with the true values.  Precision is the degree to which your measurements pin down an actual value.  The question is about an interplay of accuracy and precision.\nAs a general principle, you don&#39;t need much more precision in recording your measurements than there is accuracy built into them.  Using too much precision can mislead people into believing the accuracy is greater than it really is.\nGenerally, when you degrade precision--that is, use fewer decimal places--you can lose some accuracy.  But how much?  It&#39;s good to know that the meter was originally defined (by the French, around the time of their revolution when they were throwing out the old systems and zealously replacing them by new ones) so that ten million of them would take you from the equator to a pole.  That&#39;s 90 degrees, so one degree of latitude covers about 10^7/90 = 111,111 meters.  (&quot;About,&quot; because the meter&#39;s length has changed a little bit in the meantime.  But that doesn&#39;t matter.)  Furthermore, a degree of longitude (east-west) is about the same or less in length than a degree of latitude, because the circles of latitude shrink down to the earth&#39;s axis as we move from the equator towards either pole.  Therefore, it&#39;s always safe to figure that the sixth decimal place in one decimal degree has 111,111/10^6 = about 1/9 meter = about 4 inches of precision.\nAccordingly, if your accuracy needs are, say, give or take 10 meters, than 1/9 meter is nothing: you lose essentially no accuracy by using six decimal places.  If your accuracy need is sub-centimeter, then you need at least seven and probably eight decimal places, but more will do you little good.\nThirteen decimal places will pin down the location to 111,111/10^13 = about 1 angstrom, around half the thickness of a small atom.\nUsing these ideas we can construct a table of what each digit in a decimal degree signifies:\n\nThe sign tells us whether we are north or south, east or west on the globe.\nA nonzero hundreds digit tells us we&#39;re using longitude, not latitude!\nThe tens digit gives a position to about 1,000 kilometers.  It gives us useful information about what continent or ocean we are on.\nThe units digit (one decimal degree) gives a position up to 111 kilometers (60 nautical miles, about 69 miles).  It can tell us roughly what large state or country we are in.\nThe first decimal place is worth up to 11.1 km: it can distinguish the position of one large city from a neighboring large city.\nThe second decimal place is worth up to 1.1 km: it can separate one village from the next.\nThe third decimal place is worth up to 110 m: it can identify a large agricultural field or institutional campus.\nThe fourth decimal place is worth up to 11 m: it can identify a parcel of land.  It is comparable to the typical accuracy of an uncorrected GPS unit with no interference.\nThe fifth decimal place is worth up to 1.1 m: it distinguish trees from each other.  Accuracy to this level with commercial GPS units can only be achieved with differential correction.\nThe sixth decimal place is worth up to 11 cm: you can use this for laying out structures in detail, for designing landscapes, building roads.  It should be more than good enough for tracking movements of glaciers and rivers.  This can be achieved by taking painstaking measures with GPS, such as differentially corrected GPS.\nThe seventh decimal place is worth up to 1.1 cm: this is good for much surveying and is near the limit of what GPS-based techniques can achieve.\nThe eighth decimal place is worth up to 1.1 mm: this is good for charting motions of tectonic plates and movements of volcanoes.  Permanent, corrected, constantly-running GPS base stations might be able to achieve this level of accuracy.\nThe ninth decimal place is worth up to 110 microns: we are getting into the range of microscopy.  For almost any conceivable application with earth positions, this is overkill and will be more precise than the accuracy of any surveying device.\nTen or more decimal places indicates a computer or calculator was used and that no attention was paid to the fact that the extra decimals are useless.  Be careful, because unless you are the one reading these numbers off the device, this can indicate low quality processing!\n\n",
            "excerpt": "The seventh decimal place is worth up to 1.1 cm: this is good for much <span class=\"highlight\">surveying</span> and is near the limit of what GPS-based techniques can achieve. &hellip; For almost any conceivable application with earth positions, this is overkill and will be more precise than the accuracy of any <span class=\"highlight\">surveying</span> device. &hellip; ",
            "title": "Measuring accuracy of latitude and longitude"
        },
        {
            "tags": [
                "education"
            ],
            "question_score": 77,
            "is_accepted": true,
            "answer_id": 6549,
            "is_answered": false,
            "question_id": 6535,
            "item_type": "answer",
            "score": 132,
            "last_activity_date": 1471341320,
            "creation_date": 1298658455,
            "body": "I make my living applying mathematics and statistics to solving the kinds of problems a GIS is designed to address.  One can learn to use a GIS effectively without knowing much math at all: millions of people have done it.  But over the years I have read (and responded to) many thousands of questions about GIS and in many of these situations some basic mathematical knowledge, beyond what&#39;s usually taught (and remembered) in high school, would have been a distinct advantage.\n\nThe material that keeps coming up includes the following:\n\n\nTrigonometry and spherical trigonometry.  Let me surprise you: this stuff is overused.  In many cases trig can be avoided altogether by using simpler, but slightly more advanced, techniques, especially basic vector arithmetic.\nElementary differential geometry.  This is the investigation of smooth curves and surfaces.  It was invented by C. F. Gauss in the early 1800&#39;s specifically to support wide-area land surveys, so its applicability to GIS is obvious.  Studying the basics of this field prepares the mind well to understand geodesy, curvature, topographic shapes, and so on.\nTopology.  No, this does not mean what you think it means: the word is consistently abused in GIS.  This field emerged in the early 1900&#39;s as a way to unify otherwise difficult concepts with which people had been grappling for centuries.  These include concepts of infinity, of space, of nearness, of connectedness.  Among the accomplishments of 20th century topology was the ability to describe spaces and calculate with them.  These techniques have trickled down into GIS in the form of vector representations of lines, curves, and polygons, but that merely scratches the surface of what can be done and of the beautiful ideas lurking there.  (For an accessible account of part of this history, read Imre Lakatos&#39; Proofs and Refutations.  This book is a series of dialogs within a hypothetical classroom that is pondering questions that we would recognize as characterizing the elements of a 3D GIS.  It requires no math beyond grade school but eventually introduces the reader to homology theory.)\n\nDifferential geometry and topology also deal with &quot;fields&quot; of geometric objects, including the vector and tensor fields Waldo Tobler has been talking about for the latter part of his career.  These describe extensive phenomena within space, such as temperatures, winds, and crustal movements.\nCalculus. Many people in GIS are asked to optimize something: find the best route, find the best corridor, the best view, the best configuration of service areas, etc.  Calculus underlies all thinking about optimizing functions that depend smoothly on their parameters.  It also offers ways to think about and calculate lengths, areas, and volumes.  You don&#39;t need to know much Calculus, but a little will go a long way.\nNumerical analysis. We often have difficulties solving problems with the computer because we run into limits of precision and accuracy.  This can cause our procedures to take a long time to execute (or be impossible to run) and can result in wrong answers.  It helps to know the basic principles of this field so that you can understand where the pitfalls are and work around them.\nComputer science. Specifically, some discrete mathematics and methods of optimization contained therein.  This includes some basic graph theory, design of data structures, algorithms, and recursion, as well as a study of complexity theory.\nGeometry. Of course.  But not Euclidean geometry: a tiny bit of spherical geometry, naturally; but more important is the modern view (dating to Felix Klein in the late 1800&#39;s) of geometry as the study of groups of transformations of objects.  This is the unifying concept to moving objects around on the earth or on the map, to congruence, to similarity.\nStatistics. Not all GIS professionals need to know statistics, but it is becoming clear that a basic statistical way of thinking is essential.  All our data are ultimately derived from measurements and heavily processed afterwards.  The measurements and the processing introduce errors that can only be treated as random.  We need to understand randomness, how to model it, how to control it when possible, and how to measure it and respond to it in any case.  That does not mean studying t-tests, F-tests, etc; it means studying the foundations of statistics so that we can become effective problem solvers and decision makers in the face of chance.  It also means learning some modern ideas of statistics, including exploratory data analysis and robust estimation as well as principles of constructing statistical models.\n\n\n\n\nPlease note that I am not advocating that all GIS practitioners need to learn all this stuff!  Also, I am not suggesting that the different topics should be learned in isolation by taking separate courses.  This is merely an (incomplete) compendium of some of the most powerful and beautiful ideas that many GIS people would deeply appreciate (and be able to apply) were they to know them.  What I suspect we need is to learn enough about these subjects to know when they might be applicable, to know where to go for help, and to know how to learn more if it should be needed for a project or a job.  From that perspective, taking a lot of courses would be overkill and would likely tax the patience of the most dedicated student.  But for anyone who has an opportunity to learn some mathematics and has a choice of what to learn and how to learn it, this list might provide some guidance.\n",
            "excerpt": "I make my living applying mathematics and statistics to solving the kinds of problems a GIS is designed to address.  One can learn to use a GIS effectively without knowing much math at all: millions o &hellip; ",
            "title": "How much math does a GIS Analyst need to know?"
        },
        {
            "tags": [
                "qgis",
                "point",
                "coordinates",
                "point-creation"
            ],
            "question_score": 91,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 13,
            "is_answered": true,
            "question_id": 34204,
            "item_type": "question",
            "score": 91,
            "last_activity_date": 1683105776,
            "creation_date": 1348566885,
            "body": "How do I create point features with exact (manually entered) coordinates in QGIS?\nI get precise GPS coordinates from a survey team which I need to add to a point layer. What I want: add point, type in the coordinates and when pressing enter the point is created where it is supposed to be.\n",
            "excerpt": "I get precise GPS coordinates from a <span class=\"highlight\">survey</span> team which I need to add to a point layer. &hellip; ",
            "title": "Creating point features with exact coordinates in QGIS"
        },
        {
            "tags": [
                "data",
                "global"
            ],
            "question_score": 52,
            "is_accepted": true,
            "answer_id": 504,
            "is_answered": false,
            "question_id": 495,
            "item_type": "answer",
            "score": 56,
            "last_activity_date": 1593963719,
            "creation_date": 1280454575,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\nGlobal\n\nFor non-commercial use, try GADM.\nFor small scale global dataset try Natural Earth: Natural Earth is a public domain map dataset available at 1:10m, 1:50m, and 1:110 million scales\nDIVA-GIS is free data. Just click on &#39;Global level&#39; and a zip file will download of all country boundaries.  Under &#39;Country level&#39; you&#39;ll find administrative areas and a few other things that may interest you but you have to pick the country you want so it could take a little time if you want every country\nOpenStreetMap has a lot of data. It isn&#39;t necessarily authoritative, but if you are just trying to get data it may be suitable.\nhttp://wiki.openstreetmap.org/wiki/Potential_Datasources: This wiki has the most comprehensive (reviewed by data quality) list of freely available data sources\nhttp://wiki.openstreetmap.org/wiki/Shapefiles\nhttp://osmdata.thinkgeo.com/openstreetmap-data/\nThe UN has a dataset for many (but not all) countries, known as the Second Administrative Level Boundaries data set project (SALB).   The dataset is standardized in terms of the international border, metadata profile, spelling, coding scheme, editing protocols used and can be downloaded at no cost. However, as it is licensed under the creative commons by-nc-nd license it cannot be used for commercial purposes.\nyou can find world boundaries shapefile on http://thematicmapping.org/downloads/world_borders.php\n\nAustralia\nThe Bureau of Statistics provides most of the information:\n\nCountry boundaries should be produced by merging all the state boundaries (below) into a single polygon feature.\nState level boundaries are available.\nThe states can be geographically disaggregated in a number of ways - perhaps the most similar to county boundaries are Local Government Areas (LGAs).\nTo find the area of cities, the standard dataset to use is the urban centres and localities digital boundaries.\nZipcodes (or postcodes as they are known here) are more difficult to model.  Because they are based on the rules by which Australia Post deliver the post, they are rather fuzzily defined.  The free option approximates postcodes as the census collection district level, and is available for 2006 from the ABS.\nthe updated 2011 datasets and census results are available via the Data Packs section of the ABS site, which requires free registration.\n\nNew Zealand\n\nKoordinates - This site has free and pay data for New Zealand and various international areas (like Florida!). A range of free layers, boundaries, urban areas, land use, digital elevation, coastline, rivers etc... and topo maps, contours, aerials for some areas - pay for these. Excellent interface and system for ordering downloads.\n\nhttp://www.stats.govt.nz/browse_for_stats/people_and_communities/Geographic-areas/digital-boundary-files.aspx is the Statistics Department&#39;s set of administrative boundaries. They&#39;ve got regions and territorial authorities (the rough equivalent of counties), urban areas (roughly city boundaries) and much more, including meshblocks, which most statistical data is tied to.\n\n\nCanada\n\nAdministrative Boundaries are available at GeoBase.  Note that these boundaries are actually Administrative Boundaries and not coastlines (particularly relevant for the north coast).\nThe Political Boundaries layer in the GeoGratis North American Atlas has nice physical boundaries for North America and surroundings, as well as U.S. States and Canadian Provinces.\n\nGreat Britain\nFor a wide range of free data for Great Britain, visit the Ordnance Survey website:\nhttps://www.ordnancesurvey.co.uk/opendatadownload/products.html\nThere&#39;s a product description page too (but I can&#39;t provide another hyperlink sigh)\nThe Boundary-Line dataset has a number of administrative boundary layers (though why they couldn&#39;t provide a simple, continuous, GB county boundary dataset in it is beyond me). However, there&#39;s a lot of good stuff on this site, including a GB post code gazetteer.\nEuropean Union\nEurostat provides several geo-datasets for EU and a few more countries for free for non-commercial use: Countries, NUTS, Communes, LAUs (municipalities) and coastlines: https://ec.europa.eu/eurostat/web/gisco/geodata/reference-data/administrative-units-statistical-units\n",
            "excerpt": "Great Britain\nFor a wide range of free data for Great Britain, visit the Ordnance <span class=\"highlight\">Survey</span> website:\nhttps://www.ordnancesurvey.co.uk/opendatadownload/products.html\nThere&#39;s a product description page too &hellip; ",
            "title": "Seeking administrative boundaries for various countries?"
        },
        {
            "tags": [
                "data",
                "license",
                "china"
            ],
            "question_score": 31,
            "is_accepted": true,
            "answer_id": 320872,
            "is_answered": false,
            "question_id": 320871,
            "item_type": "answer",
            "score": 51,
            "last_activity_date": 1556203811,
            "creation_date": 1556124989,
            "body": "I am not sure if the context of your question is really on-topic here, but since the answer and its implications is very much relevant for travellers as well, I&#39;ll give it a try.\n\nThe explanation you have read is not entirely accurate. The problem is that accurate map material is neither allowed to be published, nor to leave the country. The Chinese National Bureau of Surveying and Mapping require all companies to obtain permits for map surveying and published map data must be obfuscated, resulting in a deviation of up to 700m between the map and the real world. Sounds strange, but that is how it is.\n\nYou can easily see the result of this obfuscation if you e.g. in Google Maps look at the satellite imagery with a map overlay. It is especially obvious in border proximity, where you will see that the map data for China is skewed, while the map outside China is correct. If you look at this area, the Shenzhen Bay with the border between China and Hong Kong, you can see that the map over Hong Kong in the lower right area is correct, while in the middle of the bay, the map seem to indicate that the bridge makes a sharp bend to the right, while you on the satellite image can see that the bridge in reality is straight. In the upper left area (mainland China), you can then see that there is a significant discrepancy between the imagery and the map. Roads seem to float on the water, pass through buildings and what else not.\n\nSome additional information based on questions in the comments:\n\nThe Chinese Surveying and Mapping Law does not explain why the restriction is in place. It is commonly quoted that it is for national security purposes, but I am not really sure if there is any official statement on that subject at all. Similar regulations and restrictions are actually quite common in many other countries as well, but usually do not apply to the entire country, just to &#39;places of interest&#39;.\n\nThe obfuscation algorithm is prespecified, not publicly known, but is obviously deterministic. Since a lot of example data is available, there have been attempts to reverse-engineer the algorithm and there are more or less reliable software libraries available allowing a backwards mapping from obfuscated to real coordinates. There is more information and links to further resources on the Wikipedia page &#39;Restrictions on geographic data in China&#39;.\n",
            "excerpt": "The Chinese National Bureau of <span class=\"highlight\">Surveying</span> and Mapping require all companies to obtain permits for map <span class=\"highlight\">surveying</span> and published map data must be obfuscated, resulting in a deviation of up to 700m between &hellip; Some additional information based on questions in the comments:\n\nThe Chinese <span class=\"highlight\">Surveying</span> and Mapping Law does not explain why the restriction is in place. &hellip; ",
            "title": "Map material from China not allowed to leave that country"
        },
        {
            "tags": [
                "gps",
                "gis-principle",
                "trilateration",
                "triangulation-survey",
                "triangulation"
            ],
            "question_score": 41,
            "is_accepted": false,
            "answer_id": 42663,
            "is_answered": false,
            "question_id": 17344,
            "item_type": "answer",
            "score": 38,
            "last_activity_date": 1367253221,
            "creation_date": 1354259226,
            "body": "These two illustations are from the field of surveying but they should still apply.\n\nTriangulation\n\nAs Martin has said, in triangulation, you work with angles as illustrated in the following figure.\n\nThe positions of the points of interest are computed based on measured angles and two know points. From those angles, the distances are computed which are in turn used to calculate coordinates for the target points.\n\n\n\nTrilateration\n\n\n\nIn trilateration, you work with distances. From those distances, you compute the angles. Once computed, you can use them in conjunction with the distances to get the position of the target points.\n\nA simpler example would the one at HowStuffWorks. It is quite similar to how GPS works except that this one&#39;s in 2D.\n\nGiven only one distance, you only know you are within a certain distance from Boise (which could be anywhere in that radius)\n\n \n\nGiven another distance from Minneapolis, you can now tell that you are at the intersection of two circle. Still gives you two positions though.\n\n \n\nA position from a third location (Tucson), would narrow down your location to only one point. \n\n\n\nThat&#39;s pretty much how GPS works except that GPS is in 3D and you&#39;re dealing with spheres instead of circles. You&#39;d also end up with two points instead of a single point with the third satellite but you can eliminate the other point as it&#39;s not on the surface of the earth as the illustration shows.\n\n\n\n\n\nIf you would look closely, their goal is the same. To get both distance and direction so that you can get the positions of the points you&#39;re interested in. Both of these techniques were invented before GPS and electronic measuring devices (EDM).\n\nBefore EDMs, triangulation was favored as it was very hard to measure long distances accurately while it was comparatively easy to measure angles. With the advent of electronic distance measurement tools (total stations and their ilk), trilateration also became popular as it was no longer hard to measure distances.\n\nI hope that clarifies things for you.\n\n\n\nDisclaimer: Images are from the ICSM site.\n",
            "excerpt": "These two illustations are from the field of <span class=\"highlight\">surveying</span> but they should still apply.\n\nTriangulation\n\nAs Martin has said, in triangulation, you work with angles as illustrated in the following figure. &hellip; ",
            "title": "Differences between triangulation and trilateration"
        },
        {
            "tags": [
                "software-recommendations",
                "android",
                "mobile-gis"
            ],
            "question_score": 64,
            "is_accepted": false,
            "answer_id": 12513,
            "is_answered": false,
            "question_id": 12452,
            "item_type": "answer",
            "score": 34,
            "last_activity_date": 1629445287,
            "creation_date": 1311335253,
            "body": "\nThis question has been converted to Community Wiki and wiki locked\nbecause it is an example of a question that seeks a list of answers\nand appears to be popular enough to protect it from closure.  It\nshould be treated as a special case and should not be viewed as the\ntype of question that is encouraged on this, or any Stack Exchange\nsite, but if you wish to contribute more content to it then feel free\nto do so by editing this answer.\n\n\n\nGPSLogger for Android is a lightweight GPS logger with lots of useful tweaks [control over time/distance of logs, OSM integration, auto email of tracks, and easy on your battery].\nEpiCollect developed at Imperial College London together with web based management tools looks as really good option for data collection (more info here).\nOpen Data Kit (ODK) also looks very promising on data collection front. Check for instance ODK, GeoServer, Leaflet combo.\nAntiMap - was newcomer to the market, accompanied by desktop package that can synchronize with video. Currently it&#39;s website is unresponsive.\nFunf Journal - part of Funf Open Sensing Framework developed by MIT Media Lab\nGIS Cloud&#39;s Mobile Data Collection for Android. Another data collection tool.\nOpenPaths - yet another data collection option from New York Times Company\nInput App: QGIS in your pocket - Free and open source iOS/Android app designed to streamline the whole process behind geo-surveys by Lutra Contsulting Ltd.\nQField for QGIS (Former QGIS on Android) is a very active project and is now at version 1.0:\nBlog: http://opengis.ch/\nFrom an answer deleted for recommending the same software as this one:\n\n\nI like QGIS for android as it accepts both esri shape files and\nmapinfo tab files, and you can do thematic mapping as well as\ndisplaying geotiffs. You can edit shape files easily and use the built\nin gps if you have one, however it crashes my tablet if you are not\nlocated within the bounds of the map. Otherwise it is excellent and\nthe devs are working on python compatibility meaning you will be able\nto use google and bing maps as well as open streets etc.\nThe main issues are that the gui is designed for  a standard screen\nand all the buttons and icons are tiny on anything smaller than a 10&quot;\nscreen.\nFor basic navigation and data entry on a custom map, i was using\navenzas&#39; pdf maps on iOs, which imports geo-registered PDFs. They have\na beta for android which I haven&#39;t used but am planning on trialling.\nyou can make geo-registered pdfs in mapinfo or arcmap.\n\n\nSo far I have settled on collecting KML based vector data with limited attribution.\nApps I have used:\n\nLocus (free and paid version) https://market.android.com/details?id=menion.android.locus&amp;feature=related_apps\nOruxMaps https://market.android.com/details?id=com.orux.oruxmaps\nGoogle Tracks (pre-installed on my phone)\n\nLocus and Orux allow connecting to WMS services, Google/Bing, etc... I believe there is a separate add-on to allow Google maps in Locus.\n\nI came across this interesting application that looks (have not used it) interesting for collection of data.\nhttp://code.google.com/p/geopaparazzi/\nSome more info:\nGeopaparazzi is a tool developed to do very fast qualitative engineering/geologic surveys. Even if the main aim is in the field of surveying, it contains tools that can be of great use also to OpenStreetMappers as well as tourists that want to keep a geo-diary. Geopaparazzi is available on the Android Market.\nTo get started jump into the documentation section: https://code.google.com/p/geopaparazzi/wiki/Docs\nThe main aim of Geopaparazzi is to have a tool that:\n\nfits in any pocket and can be always at hand, when needed\ngives the possibility to take georeferenced and possibly orientated pictures during the survey, with further possibility to import them into the main GIS application BeeGIS\nis able to exploit easily internet connection, if available.\nis extremely easy to use and intuitive, providing just few important functionalities.\n\nThe main features available in Geopaparazzi are:\n\ngeoreferenced notes\ngeoreferenced and orientated pictures\ngps tracks logging\neasy export of collected data\na map view for the navigation of the environment\n\nThis recent presentation might give more insight: http://www.slideshare.net/moovida/geopaparazzi-state-of-the-art\n\nWe develop a mobile GIS solution for Android tablets called Mappt, which has a free trial available from the Google Play store.  The trial version allows you access to all functionality of the software, with the exception that you can not export your data.\nYou can grab the trial for free from the Google Play Store:\nhttps://play.google.com/store/apps/details?id=au.com.mappt\nWith Mappt, you can:\n\nCapture and work with your vector data offline.\nImport and export in Shapefile and KML formats.\nWork with WGS84 and UTM-based Coordinate Reference Systems.\nImport directly from Google Drive and export to email.\nImport your own large imagery, fully available offline, via the ArcGIS Compact Cache Bundle format.  We are also actively implementing other options to import imagery.\nRecord GPS paths.\nDefine geofences, with audible and visual alerts.\n\nSee the Mappt website for further information: www.mappt.com.au\n\n\n\nFulcrum is a cost-effective and customizable GIS mobile data collection platform. Includes a 30-day trial at sign up!\nhttp://fulcrumapp.com/\nhttps://play.google.com/store/apps/details?id=com.spatialnetworks.fulcrum&amp;hl=en\n\n\nI&#39;m working on this and I have just published a GIS application: ItacaMap for Android ( https://play.google.com/store/apps/details?id=com.itacasoft.itacamap ). At the moment you can see basic functionality (zoom, pan, view info, browse, select by rectangle, etc.), but I have already implemented edit functionalities (at least on the server side) and more is cooking.\n\nGeospago is a new application.  It is a software-as-a-solution (SaaS) because it has a mobile application working in conjunction with a web application.  Both may be used for collecting/inputting data, editing/updating data, viewing/sharing data, and importing/exporting data.  The web portal runs on amazon with geoserver and syncs with the android app, which uses SQLite.\nThe web portal is used to invite/manage users, control user access to projects, create projects and custom forms, deploy the forms to users, and manage data.  It can import SHP &amp; CSV files for data maintenance workflows.  It can export data to the standard formats (CSV, KML, SHP), but aslo provides feeds and an API.  This allows users to add a WFS feed to ArcMap or QGIS to see the data live from the cloud, a network link to Google Earth, or create your own script to pull the data through API requests to integrate with other systems.  Collecting data is easy as well as quickly getting new or updated data back into a enterprise system of record.  Geospago is the only app I have seen so far that provides this.\nThe mobile app is used to collect, view, and edit data (point, line, and polygon).  It runs on both phones and tablets.  It handles connected and disconnected environments through the use of mbtiles.  It allows multiple photos to be attached to a single record.  It also has barcode scanning and signature capabilities.  Synchronization is set to user specified intervals or can be manually forced.  This prevents overlap and duplication if you have multiple people collecting data for the same projects in connected areas.\nGeospago is very affordable and available on a monthly, per-license pricing model that it can be frozen between projects or cancel-at-any-time basis so you can use it only when you need it.  Data is secure on Amazon cloud and can be download it at any time.\nThe Geospago website has more information and has a sign up link.  The website also has a link to the mobile app on the Google Play Store.\n\nFound an app called MapItFast that is easy to use.  A free version that lets you gather point, line, polygon features and even photos.  I&#39;ve used it for its basemaps and to calculate distance and area.  Unfortunately, the data stays on the device (no way to export or share..that I can find) without upgrading to the cloud services.  But that looks interesting since data can be exported to CSV, GPX, SHP and KMZ, it has built in synchronization to collaborate on mapping and location, full attribution, editing, and probably a bunch of other stuff I don&#39;t know about yet.  Might be useful to those folks doing group mapping on an Android and wanting a way to get it into Google Maps or ArcGIS.  I like the idea of a low cost Internet Map Server and tools.\nTheir website (http://www.mapitfast.com) has YouTube video.  I downloaded from Google Play.  Found the brochure online:\nhttp://www.mapitfast.com/Documents/MIF_Brochure_2013.pdf\n",
            "excerpt": "Even if the main aim is in the field of <span class=\"highlight\">surveying</span>, it contains tools that can be of great use also to OpenStreetMappers as well as tourists that want to keep a geo-diary. &hellip; The main aim of Geopaparazzi is to have a tool that:\n\nfits in any pocket and can be always at hand, when needed\ngives the possibility to take georeferenced and possibly orientated pictures during the <span class=\"highlight\">survey</span> &hellip; ",
            "title": "Seeking Mobile GIS applications for Android Tablets?"
        },
        {
            "tags": [
                "qgis",
                "features",
                "select",
                "expression"
            ],
            "question_score": 34,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 153613,
            "item_type": "question",
            "score": 34,
            "last_activity_date": 1477323386,
            "creation_date": 1436318547,
            "body": "I need to style a survey parcel polygon shapefile, based on whether the polygon is a mineral claim or not. Unfortunately, the only information on whether a polygon is a mineral claim or not is contained in the &quot;TITLE&quot; field of the attribute table, which gives the full legal name of the surveyed parcel. \nFor instance, &#39;DISTRICT LOT 5639, BEING AWARD NO. 2 MINERAL CLAIM, KDYD&#39;.\nI need an expression that selects any feature containing the text &#39;MINERAL CLAIM&#39; in the &quot;TITLE&quot; field.\n",
            "excerpt": "I need to style a <span class=\"highlight\">survey</span> parcel polygon shapefile, based on whether the polygon is a mineral claim or not. &hellip; ",
            "title": "How to select features containing specific text string using an expression in QGIS"
        },
        {
            "tags": [
                "3d",
                "visualisation"
            ],
            "question_score": 31,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 8,
            "is_answered": true,
            "question_id": 3617,
            "item_type": "question",
            "score": 31,
            "last_activity_date": 1473718752,
            "creation_date": 1290068976,
            "body": "I can currently only think of two cases:\n\nto visualise potential changes in a landscape, such as the effect of adding windfarms, or the addition of a new building to an urban area. However both these examples are often done using CAD packages.\n\nto impress an audience - which while no doubt effective to get an interest by stakeholders in a GIS, may not provide analytical benefits.\n\n\n\nWhilst 3D data is often critical (for floodplain analysis, river profiles, geological surveys etc.) does a 3D viewer add anything?\n",
            "excerpt": "I can currently only think of two cases:\n\nto visualise potential changes in a landscape, such as the effect of adding windfarms, or the addition of a new building to an urban area. However both these  &hellip; ",
            "title": "When is a 3D Visualisation in GIS Useful?"
        },
        {
            "tags": [
                "qgis",
                "coordinate-system",
                "wgs84",
                "nad83"
            ],
            "question_score": 12,
            "is_accepted": true,
            "answer_id": 383437,
            "is_answered": false,
            "question_id": 383434,
            "item_type": "answer",
            "score": 30,
            "last_activity_date": 1660164231,
            "creation_date": 1609776678,
            "body": "This answer has four sections:\n\nWhat you should do to solve the problem and what you should avoid\nAn example to better illustrate why assigning CRS and reprojecting are not the same\nAn analogy that should help to make this difference better understandable\nUsing batch process to transform several layers at once in QGIS\n\n1. What you should (not) do to solve the problem\nDo NOT &quot;change&quot; the CRS. When you , you simply assigning another CRS definition to your layer. You should never do that if you&#39;re not 100% sure about what you do.\nThis option is only for the case if the layer&#39;s CRS is somehow not correctly recognized - then you have to manually tell QGIS which CRS the layer was initially created in. You have to know the exact CRS, the definition the coordinates of the features are saved in.\nEach layer is saved with coordinates in a certain CRS (projection). So if you assign another CRS, the coordinates from one CRS (like EPSG:4326 / WGS84) are interpreted as being coordinate values belonging to another CRS, in your case NAD83/ New York Long Island EPSG:32118.\nTo make a comparison: it&#39;s somehow like if you had a length measurement in inches and you simply &quot;change&quot; it to meters by replacing &quot;inches&quot; with &quot;meters&quot;, but leaving the numbers as they are: .  This is what you did, simply &quot;assigning&quot; another CRS (=another definition how to interpret the numbers). This can&#39;t work - you must convert (1 inch = 0.0254 m): .\nWhat you should do is reprojecting the layer: right click on your layer /  or go to menu . There, you can define the CRS that your existing layer should be reprojected to. You will get a copy of your input layer in the new CRS.\nWhen saving, in the dialog window you have a CRS section with a drop down menu where you can select the CRS you want to reproject to. Or click on the right side the small symbol &quot;globe with grid&quot;. It will open an advanced CRS selection dialog with more information and the option to filter the CRS description by introducing some letters or numbers:\n\n\n2. Case study to illustrate assigning CRS vs. reprojection\nTo illustrate that: let&#39;s say you have coordinates in  (WGS84, GPS coordinates) 0&#176; E, 51.4777&#176; N: a point nearby the Greenwich observatory in London (today&#39;s IERS reference meridian passes a few dozen meters to the east of the observatory, but that is another story, however it shows how complex the topic is).\nIf you now change the EPSG, you assign another definition to the coordinate values of 0 and 51.4777. Let&#39;s say we tell QGIS that these values are in Web Mercator, . This defintion has it&#39;s point of origin at the intersection of the equator (red line) with the prime meridian (blue line), a point in the Atlantic west ob Gabon, south of Ghana: the red cross on the following map:\n\nThis point of origin is the same as when using . But  is a projected CRS, thus it measures it&#39;s coordinates not on a globe (spheroid) as  does that uses degrees as unit, but on a planar map projection and uses meters. Both start at the same point of origin in the Atlantic. So in /WebMercator, the latitude is measured in meters and our point will be 51.4777 meters to the north of this point, thus in the Atlantic very close to the point of origin. The longitude still has the &quot;right&quot; value because 0 remains zero, thus in this special case, nothing changes (to make things a bit easier here).\nYou see this on this screenshot: a point created in  with coordinates lon 0, lat 51.4777 creates a point that is a few dozen meters north of the equator (red line):\n\nTo get the &quot;right&quot; coordinates value for the point near the Greenwich observatory in , we must use a transformaton algorithm. QGIS normally handels this automatically when we reproject. But often there are several different algorithms for the transformation available. In such cases, QGIS alerts with a dialog window where we can choose one of the available transformations - see the following screenshot. The background: this has to do with different mathematical methods of transformation. Calculating the earths shape to different projections is not so trivial and is almost always not 100% exact, so you always get minor errors when reprojecting - see the info about the accuracy in the screenshot:\n\nWhen we reproject, we see that the latitude for our point near Greenwich observatory is 6706107.21 in  - that means: 6706.1 km to the north of the point of origin in the Atlantic. Be aware: this value is not a distance on earth&#39;s surface, but on the projected planar map canvas. Web Mercator heavily distorts lengths, so the values in meters are of use for coordinate values only, not for measuring distances.\nWe could now use another projected CRS, let&#39;s say ,  Ordnance Survey, British National Grid. After transformation, we see that the same point near Greenwich observatory has again other coordinates: lat: 177234.2, lon: 538989.7. These values are again in meters, but are completely different from the meters we had before when using Web Mercator. So you see: the values only make sense if they are interpreted in the correct CRS.\n\n3. An analogy that should help to make this difference better understandable\nAn analogy of the difference between set CRS and reproject, as this is a very common mistake a lot of users make: To better understand, you could imagine the different CRS as different &quot;languages&quot; (conventions about the meaning of symbols). If you have a text and try to translate it, you must first know in which language your text is to be able to look for the right dictionaries, hire the right interpreter or do the correct setting in the automatic translation tool.\nWhen you have a text in English and want to have a translation into Chinese, you can&#39;t just stick the label &quot;Chinese&quot; on the first page: this does not translate it. To the contrary, the text will make no sense: a native speaker of Chinese will still not be able to understand it (without knowing English) as the English words have no meaning in Chinese. Maybe some words happen to sound similar in both languages, but with completely different meaning: that&#39;s what happened to you: your layer was shown in QGIS, but in a wrong, meaningless place.\nSo that should help understand why you can&#39;t simply &quot;change&quot; the language. You must translate - the analogy of reprojecting in QGIS: every word/sentence must be taken from one language to the other one, according to certain rules (grammar). The same with reprojecting: every coordinate has to be recalculated respecting some transformation algorithms.\nIf you use an online translation tool as Google translate, the language of many texts you paste is automatically recognized. This is what QGIS also tries: when you load data, you normally should not have to set manually the CRS, as in almost all cases the CRS should be already stored in your data. So only if the CRS is not correctly recognized, you should manually assign the correct CRS.\n\n4. Using batch process to transform several layers at once in QGIS\nIf you have several files or layers, you run this as batch process. Just start the reproject dialog using the menu (as described above), than you find a button at the bottom left to start the tool as batch process, see:\n\n",
            "excerpt": "We could now use another projected CRS, let&#39;s say EPSG:27700,  Ordnance <span class=\"highlight\">Survey</span>, British National Grid. &hellip; ",
            "title": "Changing shapefiles from geographic (WGS84) to projected (EPSG:2263) coordinate system using QGIS"
        },
        {
            "tags": [
                "qgis",
                "openstreetmap",
                "sld",
                "qml"
            ],
            "question_score": 29,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 90086,
            "item_type": "question",
            "score": 29,
            "last_activity_date": 1554511005,
            "creation_date": 1395158921,
            "body": "I&#39;m looking for a qml file (or equivalent e.g. sld) to allow me to use QGIS to take OpenStreetMap data and produce paper maps. I&#39;m re-asking this question (it was asked once or twice over a couple of years by other people) because I&#39;m really surprised not to easily find such a thing already (I looked hard). \n\nI have found Anita Graser&#39;s styles - which are good, but only style basic data like roads (and do so simply). I&#39;ve successfully followed the directions for getting OSM data to work with. I&#39;ve carried out some basic style editing successfully. I realise I could create my own styles for this purpose - but this seems like a very big job. I want a visually pleasing map taking into account most of the data available on OSM (i.e. not just streets, but tracks, paths, rivers, woods, lakes, buildings and so on). I&#39;d have thought that there would be other people out there already doing the same... It seems odd to have to re-invent the wheel when both OSM and QGIS are open source / open data projects. I feel like maybe I&#39;ve just missed the obvious repository of OSM qml files which resides out there on the internet somewhere if you know where to look.\n\nAdditional notes in response to query below...\n\nIdeally I&#39;m looking for a Mapnik style rendering of the OSM data, but any equivalent properly developed and complete style would be good.\n\nAt the moment the objective is to use this data to produce paper mapping, but simple use of the mapping as base data on which other geographic data can be displayed also requires a decent rendering. At work I use Ordnance Survey data completely styled to produce a full and very detailed UK map (the point being that I didn&#39;t have to design this styling, it came with the data). I realise that other tools exist for paper mapping, but the same issues tend to arise at one stage or another... I&#39;m more or less successful in making the tool work for me in really basic terms, but to get to something visually useful I end up back with me either needing to re-invent a complete rendering style from scratch (beyond my skill), or encountering such a complex set of requirements for database setups or whatever that the process crashes and burns before I get anywhere useful. With a few more years of GIS experience I&#39;ll maybe be a database, CartoCSS (or whatever else) wizz... but until then I&#39;m prevented from using the amazing resource that OSM provides by this one barrier.\n\nUpdate (July 2015): Please note that I&#39;m still looking for information on this, and given that I&#39;ve just been informed that the question has had 2500 views in the last year clearly others are too.\n",
            "excerpt": "At work I use Ordnance <span class=\"highlight\">Survey</span> data completely styled to produce a full and very detailed UK map (the point being that I didn&#39;t have to design this styling, it came with the data). &hellip; ",
            "title": "Seeking qml or sld file for QGIS + OpenStreetMap data?"
        },
        {
            "tags": [
                "gps",
                "gis-principle",
                "trilateration",
                "triangulation-survey",
                "triangulation"
            ],
            "question_score": 41,
            "is_accepted": false,
            "answer_id": 17345,
            "is_answered": false,
            "question_id": 17344,
            "item_type": "answer",
            "score": 28,
            "last_activity_date": 1518552290,
            "creation_date": 1322560218,
            "body": "It&#39;s already explained in the terms:\n\nTriangulation = working with angles\nTrilateration = working with distances.\n\nIn real world applications you often work with both, or combine them. For example, total station surveys measure both distances and angles. On the other hand, GPS receivers use trilateration concepts, where speed and time equals a distance, to determine your position.\n",
            "excerpt": "It&#39;s already explained in the terms:\n\nTriangulation = working with angles\nTrilateration = working with distances.\n\nIn real world applications you often work with both, or combine them. For example, to &hellip; ",
            "title": "Differences between triangulation and trilateration"
        },
        {
            "tags": [
                "coordinate-system",
                "gis-principle"
            ],
            "question_score": 34,
            "is_accepted": true,
            "answer_id": 5075,
            "is_answered": false,
            "question_id": 5068,
            "item_type": "answer",
            "score": 27,
            "last_activity_date": 1294867570,
            "creation_date": 1294865226,
            "body": "Any software that can project coordinates accurately can compute accurate Tissot indicatrices.\n\nA good source for the formulas is Snyder, John, Map Projections--A Working Manual, primarily at pp 20-26.  (I won&#39;t reproduce them here because this site doesn&#39;t have appropriate tools for communicating mathematical formulas.)  They require all four first derivatives of the projected coordinates (x,y) with respect to the spherical coordinates (lat, lon) = (phi, lambda):\n\n\n\nEverything else about the TI&#39;s is computed in terms of these (using some arithmetic and trigonometric functions: the cosine, principal inverse sine, and principal inverse tangent).  The computations require a description of the earth&#39;s shape.  For the greatest accuracy use an ellipsoidal datum with semimajor axis a and eccentricity e.  (These will be known to the software.)\n\nSnyder&#39;s book has instructions on how to compute everything except these derivatives.  Do it numerically.  I have had excellent results using first-order central finite difference estimates at a distance of h = 10^(-5.2) radians (typically around 50 meters): this is a good compromise between trying to get infinitesimally close and losing too much precision from floating point roundoff (assuming double precision), because the error made is proportional to (10^(-5.2))^2 = 10^(-10.4) and 10^(-5.2) equals 10^10.4 times the IEEE double precision accuracy of 10^(-15.6) and it&#39;s still a lot larger than typical precision in projections, which usually run from 10^(-10) to about 10^(-14).\n\nSo, how do you compute finite difference estimates?  This part is surprisingly easy.   To obtain dx/d(phi) at a point (phi, lambda), ask your GIS to project the points\n\n\n\nUse the estimates\n\n\n\nSimilarly, project the points\n\n\n\nand use the estimates\n\n\n\nThat takes four projections and a tiny bit of arithmetic.  (You can reduce it to three by using non-central differences, but the accuracy goes down a little.  It&#39;s wise aim for high accuracy, without letting h get too small, unless you are sure your GIS is using survey-grade (millimeter) accuracy in its projection formulas.)\n\nFrom these derivatives, along with Snyder&#39;s formulas (paying attention to the modifications described at 4-19 and 4-21), you can obtain the lengths of the axes of the Tissot Indicatrix at (phi, lambda) and its orientation.  On world-scale maps the TI will be so small as to be invisible, so the final thing to do is decide how much you want to rescale each TI.  I determine the scale factor by finding out how large the map will be, finding the sizes of typical TIs across the map, and scaling so that those TIs will be approximately 6% as wide as the map.  It&#39;s a good start, anyway; I let the user adjust the size of the TI from there.  Of course you will rescale all the TIs by the same amount, so they can be compared, and each will be rescaled around its own center (which is obtained by a fifth projection, (phi, lambda) --&gt; (x,y)).\n\nA nice addition to the elliptical portrayal of the TI is to show the directions of the local meridian and parallel: then, at a glance, you can assess the grid convergence.  I also show a standard circle (representing no distortion) concentric with each TI because it improves the reader&#39;s ability to gauge the amount of distortion represented by each ellipse.\n\n\n\nOf note in this Mollweide projection is the extreme TI near the south pole.  It is still a perfect ellipse and accurately describes the map distortion there.\n",
            "excerpt": "It&#39;s wise aim for high accuracy, without letting h get too small, unless you are sure your GIS is using <span class=\"highlight\">survey</span>-grade (millimeter) accuracy in its projection formulas.) &hellip; ",
            "title": "How to create an accurate Tissot Indicatrix?"
        },
        {
            "tags": [
                "qgis",
                "shapefile",
                "vector",
                "dissolve",
                "ordnance-survey"
            ],
            "question_score": 26,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 50290,
            "item_type": "question",
            "score": 26,
            "last_activity_date": 1484692809,
            "creation_date": 1360257396,
            "body": "I&#39;m currently using building data from the Ordnance Survey Vectormap District and I&#39;ve noticed that a lot of building polygons are split in 2 because of the way the OS split up the shapefile.\n\nThis is what I&#39;m seeing in QGIS –&#160;I&#39;ve highlighted some of the buildings split at the tile boundary:\n\n\n\nI can&#39;t manually merge the buildings as there are way too many of them that have been split at the boundaries (this is just a zoomed in example). I&#39;m looking for an automated way to solve this.\n\nUnfortunately, each side of the split buildings has a different id so I can&#39;t easily dissolve them.\n\nHow would you suggest I can automatically merge the building tiles?\n\nEdit\n\nI&#39;m now using PostGIS to merge the polygons split at the tile boundaries. Here is the SQL statement that does this for me –&#160;it&#39;s many, many times faster than doing it with QGIS:\n\n\n\n\n",
            "excerpt": "I&#39;m currently using building data from the Ordnance <span class=\"highlight\">Survey</span> Vectormap District and I&#39;ve noticed that a lot of building polygons are split in 2 because of the way the OS split up the shapefile. &hellip; ",
            "title": "Merging adjacent polygons in shapefile that has been split at tile boundaries?"
        },
        {
            "tags": [
                "polygon",
                "polygon-creation",
                "storage"
            ],
            "question_score": 22,
            "is_accepted": true,
            "answer_id": 10309,
            "is_answered": false,
            "question_id": 10308,
            "item_type": "answer",
            "score": 26,
            "last_activity_date": 1306454561,
            "creation_date": 1306454561,
            "body": "That convention goes back to the surveying industry; which has a point of beginning. So you start at a point in space, and the last point you reference is your closing point. This way you have a closed object. So to build a full COGO object you need to have a complete description of what is being described. Its more accurate than a assumed close.\n",
            "excerpt": "That convention goes back to the <span class=\"highlight\">surveying</span> industry; which has a point of beginning. So you start at a point in space, and the last point you reference is your closing point. &hellip; ",
            "title": "Why do valid polygons repeat the same start and end point?"
        },
        {
            "tags": [
                "georeferencing",
                "accuracy"
            ],
            "question_score": 13,
            "is_accepted": true,
            "answer_id": 8918,
            "is_answered": false,
            "question_id": 8900,
            "item_type": "answer",
            "score": 25,
            "last_activity_date": 1303744369,
            "creation_date": 1303744369,
            "body": "No, there is no absolute value for RMS, because it depends on the quality of the map being georeferenced, the quality of the target (base) map, and the purpose of the georeferencing.  In particular, any advice that relates RMS to cellsize is misinformed, because cellsize reflects precision in the digital representation of an image whereas the RMS error reflects average accuracy (assuming the basemap is perfectly accurate).  Although distinguishing precision and accuracy may seem like aimless pedantry, confusing them is a basic mistake with practical consequences.\n\nAll this is rather vague, so let&#39;s look at a specific example.  Recently I received a series of screenshots of maps showing soil sample locations.  To obtain coordinates, I planned to georeference these screenshots to an orthophoto base map and then digitize the points with heads-up digitization.  Among the considerations were:\n\n\nThe orthophoto base map has 0.3 m cellsize.\nThe screenshots have approximately 2 m cellsize.\nThe soil sample locations were not surveyed; they were located &quot;by eye&quot; on the map when the sampler was in the field.  The client estimated the accuracy was about 3 m, but 10 m is more likely.\nThe screenshots have few sharp details: they are primarily contour lines, with occasional fencelines (which are not clearly visible in the orthophoto).  Thus establishing many good links would be time-consuming and error-prone.\nThere was likely some local distortion in the screenshots, meaning that high accuracy (low RMS) can be achieved only with complex transformations.\nIt was important to digitize the soil sample locations so that relative distances were fairly accurate for nearby points, but absolute accuracy was unnecessary, because one outcome of the study will be to obtain many more soil samples that refine and make more precise this preliminary survey.\n\n\nTo obtain an RMS of half the larger cellsize would require a high-order polynomial transformation or warping across a grid of points, calling for establishing a network of around 50 - 100 good links between the images: one to several hours of careful work, most likely, given the difficulty of even finding visible links.  To obtain an RMS of half the smaller cellsize would require an order of magnitude more effort: days of work.  However, for the purposes of the study an RMS of 5 m would be more than sufficient.  This was achieved with 7 links and an affine transformation, just a few minutes&#39; work.  Note that this RMS is several times greater than the larger of the two cellsizes in the images.\n\nThis example illustrates how blindly following bad rules of thumb can be costly.  Pay attention first to your data quality objectives; everything else follows from them.\n",
            "excerpt": "fairly accurate for nearby points, but absolute accuracy was unnecessary, because one outcome of the study will be to obtain many more soil samples that refine and make more precise this preliminary <span class=\"highlight\">survey</span> &hellip; ",
            "title": "Generally accepted root mean square (RMS) error for rectifying topographic maps"
        },
        {
            "tags": [
                "qgis",
                "polygon",
                "point"
            ],
            "question_score": 11,
            "is_accepted": true,
            "answer_id": 73647,
            "is_answered": false,
            "question_id": 73585,
            "item_type": "answer",
            "score": 25,
            "last_activity_date": 1381937137,
            "creation_date": 1381174444,
            "body": "It seems like you&#39;re working with Ordnance Survey Code-Point data, which is a dataset of the postal code areas in Great Britain and Northern Ireland.\n\nThe &quot;points&quot; you&#39;re referring to are small square polygons that represent so-called &quot;vertical streets&quot;: stacks of more than one post code, which can&#39;t be represented using &quot;conventional&quot; polygons (see Andy Harfoot&#39;s comment for more details). You might want to think twice about removing these polygons if you need the affected postal codes for your analysis.\n\n\n\nThat said, here&#39;s how you can remove these polygons:\n\n\nSelect all vertical street polygons by clicking &quot;Select Features Using an Expression&quot;  and entering . This will select all features that have a postal code starting with , which are the vertical streets.\n\n\nSimply deleting the features won&#39;t help, since the polygons will leave holes behind, as you have already noticed. Instead, you can merge the vertical streets with a neighbouring large polygon using &quot;Vector / Geoprocessing tools / Eliminate sliver polygons&quot;, saving the result to a new file.\n\n\nYou may get the warning message that some features could not be dissolved, together with a list of feature ID&#39;s. If you also want to get rid of these features, select the vertical streets in the new layer using the expression from before, and then do one of the following:\n\n\nIf you want an automatic solution, you can dissolve the vertical streets togehter with all neighbouring polygons. Save the selection to a new layer using &quot;Layer / Save selection as vector file&quot;, and then use &quot;Vector / Research Tools / Select by location&quot; to select features in the merged layer that intersect with the offending vertical streets, creating a new selection. Then dissolve this selection using &quot;Vector / Geoprocessing Tools / Dissolve&quot;, choosing  in the &quot;Dissolve field&quot;. Note that this approach can lead to the undesired dissolution of &quot;proper&quot; polygons if the offending vertical street is on the boundary of two other polygons, or if there are offending vertical streets within two neighbouring polygons.\nIf you want to avoid dissolving other polygons, you can manually select the vertical streets and one adjacent polygon, taking care not to select two neighbouring polygons, and then dissolving them as above.\n\n\n",
            "excerpt": "It seems like you&#39;re working with Ordnance <span class=\"highlight\">Survey</span> Code-Point data, which is a dataset of the postal code areas in Great Britain and Northern Ireland. &hellip; ",
            "title": "Removing small &quot;salt &amp; pepper&quot; polygons from layer in QGIS?"
        },
        {
            "tags": [
                "open-source-gis",
                "references"
            ],
            "question_score": 24,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 22030,
            "item_type": "question",
            "score": 24,
            "last_activity_date": 1697698462,
            "creation_date": 1332278761,
            "body": "I am preparing an intermediate GIS course for graduate and undergraduate students who have likely not been in touch with anything but Esri software. It is an existing course in the curriculum that I will be teaching for the first time. Currently, ArcGIS is the software of choice for the lab sections and practical assignments.\nI want to tweak the course a little to include an introduction to Open Source GIS alternatives. For now, this part of the course will only be two to four weeks (I&#39;m thinking a kind of extended epilogue) so I won&#39;t be able to dig too deep. I hope to branch this off into a full Open Source GIS course next year, but curriculum constraints prohibit me from doing that right away.\nHere&#39;s some reading I have been considering to support the Open Source GIS part of the course, to give you an idea of what I&#39;m (not) looking for:\n\nThe Geospatial Desktop is a book I&#39;d love to use for a full Open Source GIS course but is too much to cover in a few weeks. The chapter &#39;Survey Of Desktop Mapping Software&#39; looks like something I could use.\nThe Dekstop GIS book is of similar breadth but currently out of print.\nThe Grass Book seems too focused on GRASS. I think GRASS will put students with an ArcGIS mindset off. Also, I want them to learn about the breadth of the OS geospatial software spectrum.\n&#39;How to go from GIS novice to Pro without spending a Dime&#39; takes a good, practical approach to delving into OS GIS, and has good links for further reading.\nA white paper from OpenGeo talking about markets for geospatial software, and how that landscape is changing.\n\nCan you suggest other articles and / or books that would be useful to ease students coming from an Esri / ArcGIS background into becoming aware of and using Open Source alternatives?\n",
            "excerpt": "The chapter &#39;<span class=\"highlight\">Survey</span> Of Desktop Mapping Software&#39; looks like something I could use.\nThe Dekstop GIS book is of similar breadth but currently out of print.\nThe Grass Book seems too focused on GRASS. &hellip; ",
            "title": "Seeking introductory books or articles about Open Source GIS for students coming from Esri background"
        },
        {
            "tags": [
                "shapefile",
                "r"
            ],
            "question_score": 22,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 40517,
            "item_type": "question",
            "score": 22,
            "last_activity_date": 1404723784,
            "creation_date": 1352286145,
            "body": "I have a shapefile downloaded from the Ordnance Survey that gives electoral ward (division) boundaries for a county of the United Kingdom. I have successfully used R to load the shapefile and plotted various maps using  as described in this question. It&#39;s all working rather well. \n\nNow I would like to create a new polygon of arbitrary shape, add it to the map, then calculate the population living in the area lying under the shape, which might cover or partially cover multiple divisions. I have the population for each electoral division and I can make the simplifying assumption that the population in each ward is uniformly distributed. That suggests the following steps.\n\n1) Overlay a new shape on the map that partially covers multiple electoral divisions. Let&#39;s say there are 3 divisions, for the sake of argument. It would look something like this. [Edit: except that in the image below the shape straddles 5 divisions rather than 3]\n\n\n\n2) Calculate the percentage of the area of each of these 3 divisions that intersects with the overlaid polygon.\n\n3) Estimate population by getting the percentage of the area of each division covered by the overlaid shape and multiplying this by the population of each division.\n\nI think I can probably work out how to create the polygon and overlay it on the map i.e. add it to the existing data frame using the useful answer to this and other questions. The bit that worries me is the task of working out the percentage of each division that is covered by the overlaid shape. The  and  columns in the data frame are those strange Ordnance Survey OpenData figures (Eastings and Northings or something). \n\nSo my first question is: How would I go about finding the area (or a subset of the area) of the polygons that define the borders of an electoral division using this data? Because even a meaningful subset of this data frame is large I have used  to create a 500k file (which can be copied and pasted or downloaded from here) rather than posting it in this question. The map that forms the base for the image above was created with the following:\n\n\n\nMy second question is: am I using the right tools? Currently I am using  from the  package to read the shapefile. I then use  to create a data frame of about 130k lines, suitable for use in . Maybe I should be using a different package if there is one with useful tools for such processes?\n",
            "excerpt": "I have a shapefile downloaded from the Ordnance <span class=\"highlight\">Survey</span> that gives electoral ward (division) boundaries for a county of the United Kingdom. &hellip; The lat and long columns in the data frame are those strange Ordnance <span class=\"highlight\">Survey</span> OpenData figures (Eastings and Northings or something). &hellip; ",
            "title": "Using R to calculate the area of multiple polygons on a map that intersect with another overlaid polygon"
        },
        {
            "tags": [
                "coordinate-system",
                "wgs84",
                "geodesy"
            ],
            "question_score": 17,
            "is_accepted": false,
            "answer_id": 149751,
            "is_answered": false,
            "question_id": 149749,
            "item_type": "answer",
            "score": 22,
            "last_activity_date": 1433415376,
            "creation_date": 1433415376,
            "body": "So there are two pieces to what someone might call a Coordinate System\n\nThe first is a Geographic Coordinate System or GCS, which is what WGS84 falls under. The definition given by ESRI states that a GCS uses a three-dimensional spherical surface to define locations on the earth. Basically, a GCS is used to define your real world points on a 3 dimensional digital surface. Examples of this include WGS84 (World Geodetic Survey 1984), NAD83 (North American Datum 1983), or NAD27 (used before NAD83. North American Datum 1927)\n\nThe other is a Projected Coordinate System or PCS. A PCS is used to take those points that you defined with your GCS and translate them to a 2-dimensional surface. This is what people commonly refer to as a &quot;projection&quot;. This can include things like Robinson, Albers Equal Area, and (one of my personal favorites) Waterman butterfly.\n\nThese are different parts and are made up of different pieces, but both of these together create a coordinate system. This is the very simple definition of both, but if you want to get into the math of everything, ESRI has good documentation in their resources section discussing map projections. Wikipedia&#39;s page on map projections also does a very good job of explaining the different types of PCSs, what distortions are caused, etc. Many projections also have their own pages explaining their history, math, etc.\n",
            "excerpt": "Examples of this include WGS84 (World Geodetic <span class=\"highlight\">Survey</span> 1984), NAD83 (North American Datum 1983), or NAD27 (used before NAD83. &hellip; ",
            "title": "Is WGS84 a Coordinate system or projection system?"
        },
        {
            "tags": [
                "geoprocessing",
                "gdal",
                "geotiff-tiff",
                "imagery",
                "aerial-photography"
            ],
            "question_score": 4,
            "is_accepted": true,
            "answer_id": 20227,
            "is_answered": false,
            "question_id": 20196,
            "item_type": "answer",
            "score": 21,
            "last_activity_date": 1680182534,
            "creation_date": 1329137087,
            "body": "GDAL has a wonderful file format called VRT, which is an XML wrapper around one or more raster files.\nOne feature of VRTs is their ability to encode square convolution kernels for any given band. It does involve playing around with XML in a text editor (or programatically), but if you&#39;re already used to the GDAL tools, it shouldn&#39;t be too hard.\nExample&#39;s input\nTo illustrate, I took this image of some Ordnance Survey data from around the old OS building in Southampton:\n\nEmbed into .vrt\nAnd ran gdalbuildvrt to generate an initial VRT file:\n\nEdit metadata\nThen I replaced the  elements with  elements and add in the element  with a  and  (coefficients) for a 5x5 Gaussian convolution kernel:\n\nYou can get alternative values thanks to an online Gaussian Kernel Calculator.\nConvert back to .tiff\nThen ran gdal_translate to convert to a TIFF:\n\nWhich gives me this image:\n\nWith its georeferencing data intact, which you can check via :\n\nGrey scale\nFor the greyscale part, I suggest you use Quantum GIS and its good (if currently slightly quirky) Raster Calculator. Simply load up your blurred image, select  and use the following expression:\n\nLoading that image into QGIS, gives me:\n\nOther coefficients can be used for the greyscale conversion, but those are a good starting point.\nAlso, it shouldn&#39;t matter whether you blur first then reduce, or the other way round.\n",
            "excerpt": "Example&#39;s input\nTo illustrate, I took this image of some Ordnance <span class=\"highlight\">Survey</span> data from around the old OS building in Southampton:\n\nEmbed into .vrt\nAnd ran gdalbuildvrt to generate an initial VRT file:\ngdalbuildvrt &hellip; ",
            "title": "How to convert GeoTIFF to grayscale and add gaussian blur?"
        },
        {
            "tags": [
                "data",
                "remote-sensing",
                "google-earth",
                "google-earth-engine",
                "kenya"
            ],
            "question_score": 20,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 61476,
            "item_type": "question",
            "score": 20,
            "last_activity_date": 1487159141,
            "creation_date": 1369203928,
            "body": "I am doing a household survey in Kenya, and I need to ensure that my survey team visits every house within a given area.  I&#39;ve been going to google maps and right-clicking on roofs to get coordinates via the &quot;what&#39;s here&quot; option.  This is really an inefficient use of time.\n\nI&#39;d prefer to have a high-resolution image that I could upload to google earth engine, and then perform a machine-learning algorithm to identify roofs.  I&#39;d want to get a text file of the lat/longs of all the houses, which I could then cluster by distance and give to my surveyors, both in map and in checklist format.\n\nBut the images in google maps satellite view are copyrighted and not available in earth engine.  So I need images at high-enough resolution to identify corrugated iron and straw thatch roofs, with roughly ~3km^2 spatial extent.\n\nWhat are some good sources for such data?  Ideally that will give it freely or cheaply to graduate students and/or nonprofits?\n",
            "excerpt": "I am doing a household <span class=\"highlight\">survey</span> in Kenya, and I need to ensure that my <span class=\"highlight\">survey</span> team visits every house within a given area. &hellip; ",
            "title": "Source for high-resolution satellite images free/low-cost?"
        },
        {
            "tags": [
                "data",
                "terminology"
            ],
            "question_score": 16,
            "is_accepted": true,
            "answer_id": 34750,
            "is_answered": false,
            "question_id": 34733,
            "item_type": "answer",
            "score": 20,
            "last_activity_date": 1553774118,
            "creation_date": 1349191333,
            "body": "There is a good information about these terms on Basudeb Bhatta&#39;s Blog at this link, copied below. \n\n@Brad Nesom&#39;s definitions are good but I thought that geodata was an abbreviation of &quot;geographic data.&quot; However, Brad&#39;s definition of geodata is quite logical.\n\nBeside these in my opinion:\n\n\n\n...\n\n\n  Often my students ask about the difference(s) between spatial and\n  geospatial. These two words appear very frequently in remote sensing\n  and GIS literature.\n  \n  The word spatial originated from Latin &#39;spatium&#39;, which means space.\n  Spatial means &#39;pertaining to space&#39; or &#39;having to do with space,\n  relating to space and the position, size, shape, etc.&#39; (Oxford\n  Dictionary), which refers to features or phenomena distributed in\n  three-dimensional space (any space, not only the Earth&#39;s surface) and,\n  thus, having physical, measurable dimensions. In GIS, &#39;spatial&#39; is\n  also referred to as &#39;based on location on map&#39;.\n  \n  Geographic(al) means &#39;pertaining to geography (the study of the\n  surface of the earth)&#39; and &#39;referring to or characteristic of a\n  certain locality, especially in reference to its location in relation\n  to other places&#39; (Macquarie Dictionary). Spatial has broader meaning,\n  encompassing the term geographic. Geographic data can be defined as a\n  class of spatial data in which the frame is the surface and/or\n  near-surface of the Earth. &#39;Geographic&#39; is the right word for graphic\n  presentation (e.g., maps) of features and phenomena on or near the\n  Earth&#39;s surface. Geographic data uses different feature types (raster,\n  points, lines, or polygons) to uniquely identify the location and/or\n  the geographical boundaries of spatial (location based) entities that\n  exist on the earth surface. Geographic data are a significant subset\n  of spatial data, although the terms geographic, spatial, and\n  geospatial are often used interchangeably.\n  \n  Geospatial is another word, and might have originated in the industry\n  to make the things differentiate from geography. Though this word is\n  becoming popular, it has not been defined in any of the standard\n  dictionary yet. Since &#39;geo&#39; is from Greek &#39;gaya&#39; meaning Earth,\n  geospatial thus means earth-space. NASA says &#39;geospatial means the\n  distribution of something in a geographic sense; it refers to entities\n  that can be located by some co-ordinate system&#39;. Geospatial data is to\n  develop information about features, objects, and classes on Earth&#39;s\n  surface and/or near Earth&#39;s surface. Geospatial is that type of\n  spatial data which is related to the Earth, but the terms spatial and\n  geospatial are often used interchangeably. United States Geological\n  Survey (USGS) says &quot;the terms spatial and geospatial are equivalent&quot;.\n\n",
            "excerpt": "United States Geological\n  <span class=\"highlight\">Survey</span> (USGS) says &quot;the terms spatial and geospatial are equivalent&quot;. &hellip; ",
            "title": "Spatial data? Geodata? Geographic Data? Geospatial data?"
        },
        {
            "tags": [
                "resolution",
                "resampling"
            ],
            "question_score": 19,
            "is_accepted": true,
            "answer_id": 94304,
            "is_answered": false,
            "question_id": 94302,
            "item_type": "answer",
            "score": 20,
            "last_activity_date": 1399754716,
            "creation_date": 1398637336,
            "body": "Actually it&#39;s not all that situation dependent and is all about statistical error.\n\nAny time you resample to a higher resolution, you are introducing false accuracy. Consider a set of data measured in feet at whole numbers only. Any given point may be +/- 0.5 feet from its actual location. If you resample to the nearest tenth, you are now saying any given number is no more than +/- 0.1 from its actual location. Yet you know your original measurements were not that accurate, and you are now operating within the margin of error. However if you go the other way and resample to the lower resolution, you know that any given point value is definitely accurate because it is contained within the larger sample&#39;s margin of error.\n\nOutside of statistical math, the first place that this comes to mind is in land surveying. Older surveys only specified bearings down to the nearest half-minute and distances to the tenth of a foot. Plotting a boundary traverse with these measurements can often result in a misclosure (the start point and end point should be the same but are not) measured in feet. Modern surveys go to at least the nearest second and hundreth of a foot. Derived values (such as the area of a lot) can be significantly affected by the difference in precision. The derived value itself can also be given as overly precise. \n\nIn your analysis case, if you resample to the higher resolution your results will imply a much greater accuracy than the data on which they are based. Consider your SRTM at 90m. By whatever method they measure the elevation (avg/max/mean return), the smallest unit (pixel) that can be differentiated from its neighbors is 90m. If you resample that to 30m, either:\n\n\nyou assume all nine of the resulting pixels are that same elevation when in\ntruth maybe only one - the center, or the top left - (or none!) is\nyou interpolate between pixels, creating derived values not present\nbefore\n\n\nThus in both cases you introduce false accuracy because your new subsamples were not actually measured.\n\nRelated question: What practices are available for modelling land suitability?\n",
            "excerpt": "Outside of statistical math, the first place that this comes to mind is in land <span class=\"highlight\">surveying</span>. Older surveys only specified bearings down to the nearest half-minute and distances to the tenth of a foot. &hellip; ",
            "title": "Resampling to highest or lowest resolution when dealing with rasters of varying resolutions"
        },
        {
            "tags": [
                "google-maps",
                "spatial-database",
                "openstreetmap"
            ],
            "question_score": 14,
            "is_accepted": true,
            "answer_id": 6074,
            "is_answered": false,
            "question_id": 6062,
            "item_type": "answer",
            "score": 20,
            "last_activity_date": 1528674437,
            "creation_date": 1297449352,
            "body": "See this paper (draft version):\n\n\n  Haklay, M. (2010), How good is volunteered geographical information? A\n  comparative study of OpenStreetMap and Ordnance Survey datasets.\n  Environment and Planning B: Planning and Design 37(4) 682 – 703.\n\n\nfor more rigorous assessment (in UK context). \n\nThis one for assessment (in comparison wth Google Maps &amp; Bing Maps) in Ireland:\n\n\n  Ciepłuch , B., Jacob, R.,Mooney, P., Winstanley, A. (2010) Comparison\n  of the accuracy of OpenStreetMap for Ireland with Google Maps and Bing\n  Maps. Proceedings of the Ninth International Symposium on Spatial\n  Accuracy Assessment in Natural Resuorces and Enviromental Sciences\n  20-23rd July 2010 . p. 337.\n\n\nAnd this for assessment in France (paywall):\n\n\n  Girres, J.-F. &amp; Touya, G. (2010) Quality Assessment of the French\n  OpenStreetMap Dataset. Transactions in GIS, 14, 435-459.\n\n\nGermany is covered in this paper:\n\n\n  Zielstra, D., Zipf, A. (2010) Quantitative Studies on the Data Quality of\n  OpenStreetMap in Germany. Paper presented at GIScience 2010.\n\n\nVery thorough comparison with TomTom data (in Germany as well) is covered here:\n\n\n  Helbich, M., Amelunxen, C., Neis, P. (2012): Comparative Spatial\n  Analysis of Positional Accuracy of OpenStreetMap and Proprietary\n  Geodata. Int. GI_Forum 2012. Salzburg. Austria.\n\n\nGerman street network is also discussed in detail here:\n\n\n  Neis, P.; Zielstra, D.; Zipf, A. (2012) The Street Network Evolution of\n  Crowdsourced Maps: OpenStreetMap in Germany 2007–2011. Future Internet\n  4, 1-21.\n\n\nThere also two Master&#39;s dissertations dealing with this topic: one from UCL:\n\n\n  Kounadi, O. (2009) Assessing the quality of OpenStreetMap data.\n\n\nand one presented at GI_Forum:\n\n\n  Stark, H-J. (2010) Quality assessment of crowdsourced geocoded\n  address-data within OpenAddresses\n\n\nAlso article from Cartographica (paywall) might be of interest:\n\n\n  Mondzech, J. &amp; Sester, M., (2011) Quality Analysis of OpenStreetMap\n  Data Based on Application Needs. Cartographica: The International\n  Journal for Geographic Information and Geovisualization, 46, 115-125.\n\n",
            "excerpt": "A\n  comparative study of OpenStreetMap and Ordnance <span class=\"highlight\">Survey</span> datasets.\n  Environment and Planning B: Planning and Design 37(4) 682 – 703.\n\n\nfor more rigorous assessment (in UK context). &hellip; ",
            "title": "Quality of free geodata compared to commercial sources"
        },
        {
            "tags": [
                "career"
            ],
            "question_score": 19,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 48284,
            "item_type": "question",
            "score": 19,
            "last_activity_date": 1507244277,
            "creation_date": 1358412543,
            "body": "A bit of an open debate - I am curious for your opinions. I am considering commencing a PhD in GIS which may concern the application of surveys within the natural environments. Eventually, I wish to continue my career in professional consultancy and not to pursue academia beyond these studies.\n\nI wonder whether anybody has any experience or can just share their thoughts about how useful is to have a GIS PhD in a professional industry. My concern is that people have told me that for some professions (e.g. Law), having a PhD qualification can in fact reduce your employability.\n\nHow is it seen by industry employers to have a PhD in GIS? Also, are there any specific sites or tips anyone can suggest?\n",
            "excerpt": "A bit of an open debate - I am curious for your opinions. I am considering commencing a PhD in GIS which may concern the application of surveys within the natural environments. Eventually, I wish to c &hellip; ",
            "title": "Is PhD in GIS useful in non-educational career path?"
        },
        {
            "tags": [
                "python",
                "dem",
                "software-recommendations",
                "unmanned-aerial-vehicle"
            ],
            "question_score": 18,
            "is_accepted": true,
            "answer_id": 65427,
            "is_answered": false,
            "question_id": 65271,
            "item_type": "answer",
            "score": 19,
            "last_activity_date": 1636211670,
            "creation_date": 1373104692,
            "body": "To solve the problem one needs to transform 2D images of 3D structures from different angles/perspectives into a solid model. This was earlier a manual job, but software allows for automated processes.\nRemember that processing software could provide both digital surface models (DSM) or digital elevation models (DEM)\nProducts from such processes can include Digital Elevation Models as well as Point Clouds, Digital Surface Models, Textured Digital Surface Models, Orthorectified Imagery and Classified Point Clouds. This is known as Structure from Motion analysis.\nProcessing can be done locally, through online services or a combination of the two. The software is basically the same, although one will find that local processing allows for more specialized settings.\nLocal processing\n\npix4D is an overall good tool providing exceptional ease of use for inexperienced to more experienced users. In addition to provide a desktop tool it also integrates with a cloud based service. A youtube video introduces the software in a good way. It is a bit in the high end with re to price.\nAgisoft Metashape (formerly known as PhotoScan) is available for Windows, OSX and Linux. Agisoft is flexible on the platform side. Having tried it out it produces good terrain models and ortophotos. A feature which lacks on Pix4D is the ability to set up batch jobs. You can also script the processing using a python API.\nDrone2Map from ESRI can create orthomosaics, 3D meshes and more. This is not an integrated ArcGIS desktop tool, but effectively a stand alone 64 bit application. On their webpage they state that: &quot;Drone2Map for ArcGIS is powered by Pix4D.&quot; Opposed to Pix4D the information provided to the user while calculating is poor. From what I understand this is Pix4D under the hood under a different licensing model.\nOpenDroneMap now provides a desktop version, WebODM, which runs fine on a desktop computer. It will let you create good ortophotos, digital elevation models as well as the rest of the products mentioned in the beginning of this answer. Set up correctly the tool can process projects of more than 4.000 images. It is important the computer has enough memory to do the processing. 32 GB or more is advised for projects over 2.000 pictures. You can also find code and more on github.\nERDAS Imagine have an UAV add-in module. Combined it&#39;s more expensive than Agisoft Photoscan, but if you&#39;re already an ERDAS user it integrates really well.\n3Dsurvey in addition to imagery analysis also offers what looks like good point cloud editing tools.\nOnline services\n\nProcessing of aerial imagery is resource demanding and will require some serious hardware. Online services are therefore pay-as-you-go or tied to a license.\nDronemapper is an online service where you can upload imagery and have it processed.\nDronedeploy was initially made as a planning and processing framework for DJI drones. It now supports creating maps and 3D models for any drone imagery. One can also do analysis based on the imagery. Produces good maps. Their app is also a marketplace where you can install apps for free.\nMicaSense MicaSense Atlas is a cloud-based data platform for processing, storage, management, presentation, and analytics of multispectral data captured with professional multispectral cameras like the MicaSense RedEdge and Parrot Sequoia.\nMaps Made Easy is another provider of online processing and data management.\n3Dsurvey Is also an option.\nCombined services\npix4D also provides an online processing service for users with a desktop license.\nApps\nApps seem to be more and more popular. They usually serve several purposes.\n\nHelp the user to plan surveys\nTake pictures according to the plan\nUpload survey plans to the drone\nProvide updated information from the drone during a survey\nHelp the user to adjust plans during a survey based on earlier flights\nFacilitate for upload of data so that data can be processed using an online service.\n\nDroneDeploy has an app which has an extraordinary update rate. The app is very flexible and also has an option to use plugins to focus the survey effort. Recent (July 2017) updates fixed issues with image spacing, but at the same time put limitations on the flight speed.\nPix4D Capture provides a stable work tool for collecting aerial images. It is probably the best available. On the downside the app has some shortcomings (unclear exposure settings, accurate control of speed, manual and not flexible way of controlling flight direction, lacking upload of survey areas (only android has this) and more) which should be fixed. It is rarely updated.\nDronelink and Litchi allow programmatically controlling your drone, including flying a structured mapping mission among others. Pricing can be more affordable compared to some of the above, especially for individuals. Dronelink in particular is usable for mapping with the DJI Mini, which otherwise does not allow enough automated control using some of the other apps.\nObsolete\nVisualSFM is a software package which in combination with CSVS might be a way to go. A youtube movie on the www.flightriot.com webpage gives a practical example of potential endpoint products. The resulting products are not referenced and as such not useful for GIS work. Visual SFM seems to be a project which lacks momentum. As far as I can see there has not been any development on the software for a couple of years.\n",
            "excerpt": "Help the user to plan surveys\nTake pictures according to the plan\nUpload <span class=\"highlight\">survey</span> plans to the drone\nProvide updated information from the drone during a <span class=\"highlight\">survey</span>\nHelp the user to adjust plans during a <span class=\"highlight\">survey</span> &hellip; The app is very flexible and also has an option to use plugins to focus the <span class=\"highlight\">survey</span> effort. &hellip; ",
            "title": "Seeking software for making digital elevation models from UAV aerial imagery"
        },
        {
            "tags": [
                "gps",
                "accuracy"
            ],
            "question_score": 48,
            "is_accepted": false,
            "answer_id": 43666,
            "is_answered": false,
            "question_id": 43617,
            "item_type": "answer",
            "score": 18,
            "last_activity_date": 1552829302,
            "creation_date": 1355176233,
            "body": "Ionospheric delay effects are the largest source of error in a single-frequency GPS receiver. WAAS and CORS are able to correct for this better than a receiver&#39;s almanac, so the best you can do with uncorrected GPS is typically about 15 meters. Survey-grade GPS using RTK is able to achieve centimeter accuracy.\n\n\nImage source: http://www.spatial-ed.com/gps/gps-basics/135-differential-correction-methods.html\n",
            "excerpt": "<span class=\"highlight\">Survey</span>-grade GPS using RTK is able to achieve centimeter accuracy.\n\n\nImage source: http://www.spatial-ed.com/gps/gps-basics/135-differential-correction-methods.html &hellip; ",
            "title": "What is the maximum Theoretical accuracy of GPS?"
        },
        {
            "tags": [
                "geoserver",
                "wms",
                "google-earth",
                "map-service"
            ],
            "question_score": 7,
            "is_accepted": true,
            "answer_id": 89719,
            "is_answered": false,
            "question_id": 89714,
            "item_type": "answer",
            "score": 18,
            "last_activity_date": 1395056386,
            "creation_date": 1394802478,
            "body": "Instead of creating a KML file then using that to access Google Earth, you can instead add your GeoServer WMS directly as an overlay as below:\n\n\nFrom the menu select Add, \nselect Image Overlay, \n\n\ngive the overlay a name\n\nselect the Refresh tab\nselect WMS Parameters\nselect the Add button next to &#39;WMS Server:&#39; drop down\n\n\nAdd the URL to your service (without parameters) for example something like:\nhttp://ogc.bgs.ac.uk/cgi-bin/BGS_BGS-HPA_Radon_Potential/ows?\n(See attached image)\nClick OK \nSelect the layer you want to show on the map from the list of Transparent layers in the left hand side and add them to the list of Selected layers on the right hand side.\nClick OK\n\nNow in the &#39;New Image Overlay&#39; window you will see that the Link section has been filled out to give you something like the below string, which is the request that Google Earth will send to your GeoServer WMS server without the BoundingBox details:\n\n\nhttp://ogc.bgs.ac.uk/cgi-bin/BGS_BGS-HPA_Radon_Potential/ows?language=eng&amp;VERSION=1.1.1&amp;REQUEST=GetMap&amp;SRS=EPSG:4326&amp;WIDTH=512&amp;HEIGHT=512&amp;LAYERS=GBR_BGS-HPA_625K_RADON_POTENTIAL&amp;STYLES=default&amp;TRANSPARENT=TRUE&amp;FORMAT=image/gif\n\nTo get Google Earth to request a png instead of a gif change the FORMAT=image/gif parameter value to FORMAT=image/png\nClick OK\n\n\nThat&#39;s it\n\n\n\nThe above example use a MapServer WMS service but it&#39;s no different from a GeoServer WMS.\n\nLet&#39;s look at the GeoServer WMS service provided by the Delaware Geological Survey\n\nA GetCapabilities request has a URL like:\n\nhttp://maps.dgs.udel.edu:80/geoserver/DGS_Surficial_and_Contact_Geology/wms?SERVICE=WMS&amp;request=GetCapabilities&amp;\n\nSome example GetMap requests are:\n\nhttp://maps.dgs.udel.edu/geoserver/DGS_Surficial_and_Contact_Geology/wms?service=WMS&amp;TRANSPARENT=TRUE&amp;version=1.3.0&amp;request=GetMap&amp;EXCEPTIONS=INIMAGE&amp;FORMAT=image/png&amp;CRS=EPSG%3A4326&amp;BBOX=39.57931760121924,-75.79289049774037,39.784397224903465,-75.45691470533502&amp;WIDTH=1250&amp;HEIGHT=763&amp;LAYERS=US-DE_DGS_100k_Surficial_Geology&amp;STYLES=&amp;\n\nhttp://maps.dgs.udel.edu/geoserver/DGS_Surficial_and_Contact_Geology/wms?service=WMS&amp;TRANSPARENT=TRUE&amp;version=1.3.0&amp;request=GetMap&amp;EXCEPTIONS=INIMAGE&amp;FORMAT=image/png&amp;CRS=EPSG%3A4326&amp;BBOX=39.57931760121924,-75.79289049774037,39.784397224903465,-75.45691470533502&amp;WIDTH=1250&amp;HEIGHT=763&amp;SLD=http%3A%2F%2Fogc.bgs.ac.uk%2Fsld%2Fgeoserver-style-test-no-named-style1.sld&amp;layers=US-DE_DGS_100k_Surficial_Geology&amp;\n\nYou can click on these GetMap links and they will show you some maps in your browser. \n\nWhen we want to see the the Delaware maps in Google earth, using the above procedure, we just specify the part of the above URLS up to and including the question mark.  This part of the URL is known as the service end point.\n\nThat is, in this example:\n\nhttp://maps.dgs.udel.edu/geoserver/DGS_Surficial_and_Contact_Geology/wms?\n\nWhen we add this URL to the dialogue and then select the Geology layer we get the below map within Google Earth. \n\n\n",
            "excerpt": "Let&#39;s look at the GeoServer WMS service provided by the Delaware Geological <span class=\"highlight\">Survey</span>\n\nA GetCapabilities request has a URL like:\n\nhttp://maps.dgs.udel.edu:80/geoserver/DGS_Surficial_and_Contact_Geology/wms &hellip; ",
            "title": "Linking Geoserver WMS layer to Google Earth?"
        },
        {
            "tags": [
                "gps",
                "wgs84",
                "china"
            ],
            "question_score": 26,
            "is_accepted": false,
            "answer_id": 141770,
            "is_answered": false,
            "question_id": 141542,
            "item_type": "answer",
            "score": 18,
            "last_activity_date": 1428648651,
            "creation_date": 1428454850,
            "body": "The problem is poorly documented by authoritative sources for English speakers, despite affecting millions of people on an everyday basis. I&#39;ve spend the past two days trying to understand the situation and I&#39;ve created a Wikipedia article about the restrictions on mapping in China and about the China GPS shift problem. Below is the part of my research that answers the question.\n\nThe root of the problem is the severe restrictions that the Chinese State Council places on geographic data concerning China&#39;s air, land and waters. Mapping and surveying can only be done with authorization from the State Council, and foreigners must form a joint-venture in order to be granted authorization for surveys. There have been numerous examples of fines levied against individuals and companies breaking this (cough protectionist and isolationist cough) law.\n\nOnline map providers offering street maps of China must obtain an authorization from the State Council. These maps must use the GCJ-02 datum, instead of the WGS-84 that the most of the world uses. This causes WGS-84 coordinates, such as those coming from a regular GPS chip, to be plotted incorrectly on GCJ-02 maps. \n\n\n\nThe street maps displayed by both google.com/maps and google.cn/maps use GCJ-02 coordinates. This can be proved by getting the GPS (WGS-84) coordinates of a known landmark, such as the Monument to the People&#39;s Heroes in Shanghai, which is located at 31.24427 N, 121.48695 E:\n\n\nTerraserver satellite imagery - reference\nGoogle China street maps and satellite imagery for the same coordinates displays a location about 500 meters off to the north-west. To find the landmark, you must use the GCJ-02 location, 31.2423 N, 121.4914 E\nGoogle.com street maps in China also gets it wrong, and it also requires the GCJ-02 coordinates to zero in on the landmark correctly.\nGoogle.com Maps satellite imagery uses the WGS-84 coordinates, which causes a pretty terrible mismatch:\n\n\n\n\nI&#39;m still unclear as to whether GPS chips manufactured in China return GCJ-02 coordinates directly, or if they return WGS-84 coordinates, which approved map software can convert to GCJ-02.\n",
            "excerpt": "Mapping and <span class=\"highlight\">surveying</span> can only be done with authorization from the State Council, and foreigners must form a joint-venture in order to be granted authorization for surveys. &hellip; ",
            "title": "What causes the GPS offset/shift in China?"
        },
        {
            "tags": [
                "qgis",
                "ordnance-survey",
                "os-openspace-api"
            ],
            "question_score": 17,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 23867,
            "item_type": "question",
            "score": 17,
            "last_activity_date": 1414358158,
            "creation_date": 1334911557,
            "body": "The version of gvSIG that I have on my Android tablet will load OS OpenSpace layers and I wonder whether or not it would be possible for QGIS desktop to do the same? And if so, how? I have my own OpenSpace API key.\n\nThis appears to be the (long) line in gvSIG&#39;s &#39;layers.txt&#39; file that does the job of fetching the layers:\n\n\n  101|Ordnance Survey (UK)\n  OpenSpace;6[&gt;],http://openspace.ordnancesurvey.co.uk/osmapapi/ts?FORMAT=image/png&amp;KEY=#KEY#&amp;URL=#URL#,image/png,11,0,200,0.0,0.0,0.0,0.0,1000000.0,1000000.0,EPSG:27700,2500.0:1000.0:500.0:200.0:100.0:50.0:25.0:10.0:5.0:4.0:2.0:1.0,\n  ,1.1.1,88013ECD7A8F379FE0405F0ACA607F60:8824326E25F94E17E0405F0AC86047BC,http://www.prodevelop.es/maps/map.htm|http://www.gvsigmini.org/maps/map.htm\n\n",
            "excerpt": "This appears to be the (long) line in gvSIG&#39;s &#39;layers.txt&#39; file that does the job of fetching the layers:\n\n\n  101|Ordnance <span class=\"highlight\">Survey</span> (UK)\n  OpenSpace;6[&gt;],http://openspace.ordnancesurvey.co.uk/osmapapi/ts &hellip; ",
            "title": "How to load Ordnance Survey OpenSpace in QGIS?"
        },
        {
            "tags": [
                "shapefile",
                "r"
            ],
            "question_score": 22,
            "is_accepted": true,
            "answer_id": 40705,
            "is_answered": false,
            "question_id": 40517,
            "item_type": "answer",
            "score": 17,
            "last_activity_date": 1353731329,
            "creation_date": 1352450013,
            "body": "Spacedman&#39;s answer and hints above were useful, but do not in themselves constitute a full answer. After some detective work on my part I have got closer to an answer although I have not yet managed to get  in the way I want (see original question above). Still, I have managed to get my new polygon into the SpatialPolygonsDataFrame.\n\nUPDATE 2012-11-11: I seem to have found a workable solution (see below). The key was to wrap the polygons in a  call when using  from the  package. The output looks like this:\n\n\n\nInserting the polygon was harder than I thought because, surprisingly, there doesn&#39;t seem to be an easy-to-follow example of inserting a new shape in an existing Ordnance Survey-derived shapefile. I have reproduced my steps here in the hope that it will be useful to somebody else. The result is a map like this.\n\n\n\nIf/when I solve the intersection issue I will edit this answer and add the final steps, unless, of course, somebody beats me to it and provides a full answer. In the meantime, comments/advice on my solution so far are all welcome.\n\nCode follows.\n\n\n",
            "excerpt": "417503.7, intersect % = 22.4%&quot;\n\n\nInserting the polygon was harder than I thought because, surprisingly, there doesn&#39;t seem to be an easy-to-follow example of inserting a new shape in an existing Ordnance <span class=\"highlight\">Survey</span>-derived &hellip; objects\nrequire(mapdata) # includes good vector maps of world political boundaries.\nrequire(rgeos)\nrequire(rgdal)\nrequire(gpclib)\nrequire(ggplot2)\nrequire(scales)\ngpclibPermit()\n\n## Download the Ordnance <span class=\"highlight\">Survey</span> &hellip; ",
            "title": "Using R to calculate the area of multiple polygons on a map that intersect with another overlaid polygon"
        },
        {
            "tags": [
                "arcgis-10.0",
                "dem",
                "convert",
                "lidar",
                "esri-grid-format"
            ],
            "question_score": 16,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 9,
            "is_answered": true,
            "question_id": 2150,
            "item_type": "question",
            "score": 16,
            "last_activity_date": 1657647241,
            "creation_date": 1285268706,
            "body": "Normally consultants (LiDAR survey) provide me with data to my specifications; already in ESRI GRID or ASCII GRID format. This way LiDAR data can be easily used with ArcGIS. This time I only have xyz files (i.e., with regular spaced xy coordinates). \n\nPreviously, I would use a utility by Min-Lang Huang named GridBatch that would convert XYZ to ASCII GRID then to ESRI GRID files. Unfortunately, the utility is crashing since I upgraded my machine to W7 64bit and ArcGIS to version 10. \n\nIs there another way to batch convert LiDAR surface XYZ data to ESRI GRID files?\n\n(Convert to points -&gt; Interpolate is an option I would like to avoid considering there are 300+ tiles to convert).\n",
            "excerpt": "Normally consultants (LiDAR <span class=\"highlight\">survey</span>) provide me with data to my specifications; already in ESRI GRID or ASCII GRID format. This way LiDAR data can be easily used with ArcGIS. &hellip; ",
            "title": "Converting XYZ files (with regularly spaced xy) to ESRI GRID format?"
        },
        {
            "tags": [
                "geolocation",
                "mobile",
                "wifi"
            ],
            "question_score": 16,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 2850,
            "item_type": "question",
            "score": 16,
            "last_activity_date": 1567049217,
            "creation_date": 1287782565,
            "body": "School Pickup Use Case (update)\n\nIt might be helpful to go into a more concrete use case instead of the original backyard example below.  Local law enforcement has started cracking down on use text messaging and cell phone use in school zones.  This presents a problem for parents picking up kids after  a middle school function.  Even for those who flaunt the law, the cell tower quickly becomes overloaded when hundreds of kids call their parents at once.  The campus is large, with wifi coverage.  It seems like it should be possible to write a mobile app that would allow a cell phone user to send a text message containing a list of wifi signal strengths to a webservice.  The web service would then create a location fix and push the message to the parent&#39;s on board navigation device.  The parent would then drive to the correct location on the campus.  \n\nBackyard Use Case (original)\nWhen I take my laptop into my backyard and choose &quot;view available networks&quot; I see a list of my 4 neighbors.  As I walk around, the relative signal strengths from my neighbors changes.\n\nI&#39;d like to stand with my laptop at known locations in my back yard, click on the map and collect points with 4 different signal strengths.\n\nAfter collecting a lot (but not too many) of these calibration points, I&#39;d like to then write a program that takes 4 wifi signal strength levels and estimates a location in the form of an error ellipse. The signals might be measured using a different device than the one used to collect the original calibration points.  \n\nWhat algorithm should I use?\n\nI do not want to disturb my neighbors by asking them if I can come in and survey the exact location of their router.\n\nI can assume, however, the location of my neighbors routers does not change.\n",
            "excerpt": "I do not want to disturb my neighbors by asking them if I can come in and <span class=\"highlight\">survey</span> the exact location of their router.\n\nI can assume, however, the location of my neighbors routers does not change. &hellip; ",
            "title": "What algorithm should I use for wifi geolocation?"
        },
        {
            "tags": [
                "geolocation",
                "township-range-section"
            ],
            "question_score": 10,
            "is_accepted": true,
            "answer_id": 25306,
            "is_answered": false,
            "question_id": 25304,
            "item_type": "answer",
            "score": 16,
            "last_activity_date": 1336799157,
            "creation_date": 1336799157,
            "body": "SW 1/ 4NE1/ 4sec. 29, T. 23 N., R. 8 W is not a direction, it&#39;s a location. Specifically, it is the southwest quarter of the NE quarter section of section 29, township 23 North, range 8 West. These terms are with respect to the public lands survey system (PLSS). \nUsing the  BLM Interactive map I navigated to this location and then eyeballed the SW quarter of the NE quarter section and get a lat/lon of 40.412643, -87.347025. This is roughly where Mud Pine Creek meets CR650.\n\nHere&#39;s what the map looks like with the cursor pointing to the approximate location.\n\n",
            "excerpt": "These terms are with respect to the public lands <span class=\"highlight\">survey</span> system (PLSS). &hellip; ",
            "title": "How To Understand Geological Directions?"
        },
        {
            "tags": [
                "postgis",
                "postgresql",
                "geos"
            ],
            "question_score": 11,
            "is_accepted": true,
            "answer_id": 230345,
            "is_answered": false,
            "question_id": 229367,
            "item_type": "answer",
            "score": 15,
            "last_activity_date": 1564556783,
            "creation_date": 1488355307,
            "body": "This happens often with ST_Intersection, irrespective of whether you use ST_SnapToGrid (which is more useful for ensuring a certain precision than for fixing geometry errors) and ST_MakeValid. The problem is to do with the fact that when you intersect polygons, often they will meet at a single point or along a line, as well as producing a (Multi)Polygon intersection(s). That is, when you intersect any two polygons, they can have multiple intersections, not all of which will be polygonal. Consequently, the data type for that particular intersection will be a GeometryCollection. As you are then attempting to insert this into a MultiPolygon or Polygon field, you will see errors about non-noded intersection or self-intersections. The simplest way I have found to fix this issue is using ST_CollectionExtract which allows you to extract only Points, Linestrings or Polygon types from the GeometryCollection. In your case, using the parameter 3 (for polygons) and dropping ST_MakeValid ought to fix it:\n\n\n\nThe error you are seeing is consistent with your polygons all being valid in the first place, as you state. I generally think it is better to run ST_IsValid to check and in the case of errors,  ST_MakeValid, on geometries before doing any intersections -- as you have done. ST_MakeValid and ST_SnapToGrid have other uses, but are generally not the right tool for fixing geometry collection issues within a query.\n\nEDIT. After a lot of (unsuccessful) fiddling in an attempt to narrow down a specific subset of the polygons that cause this error, we had an insight from the comments. The input data, from the UK Ordnance Survey, originally in CRS 27700 had been reprojected to 4326. As the algorithm for this conversion is based on convergence, rather than being one step, it introduces arbitrary rounding errors into the reprojected geometries. From reading various GEOS mailing lists about the cause of the OP&#39;s error, relating to precision and rouding, we came to this realization. The OP has since re-run this job using the original 27700 data with no error. \n",
            "excerpt": "The input data, from the UK Ordnance <span class=\"highlight\">Survey</span>, originally in CRS 27700 had been reprojected to 4326. &hellip; ",
            "title": "ST_Union fails with TopologyException despite valid polygons and using ST_SnapToGrid"
        },
        {
            "tags": [
                "shapefile",
                "data"
            ],
            "question_score": 16,
            "is_accepted": false,
            "answer_id": 52775,
            "is_answered": false,
            "question_id": 52773,
            "item_type": "answer",
            "score": 15,
            "last_activity_date": 1361736107,
            "creation_date": 1361736107,
            "body": "Ordnance Survey&#39;s VectorMap District has a shapefile that contains Underground stations - it&#39;s within the &quot;RailwayStation&quot; file but you can filter on the &quot;CLASSIFICA&quot; field. The website is http://www.ordnancesurvey.co.uk/oswebsite/products/os-vectormap-district/index.html and the licence is based on the Open Government Licence http://www.ordnancesurvey.co.uk/oswebsite/opendata/licensing.html. The data is from March 2011 though so could be out of date! Unfortunately I can&#39;t see any line information in the OS open products.\n",
            "excerpt": "Ordnance Survey&#39;s VectorMap District has a shapefile that contains Underground stations - it&#39;s within the &quot;RailwayStation&quot; file but you can filter on the &quot;CLASSIFICA&quot; field. The website is http://www. &hellip; ",
            "title": "Is there a public shapefile with the London Underground stations and lines?"
        },
        {
            "tags": [
                "gps",
                "latitude-longitude",
                "land-survey",
                "metes-and-bounds",
                "township-range-section"
            ],
            "question_score": 9,
            "is_accepted": false,
            "answer_id": 153347,
            "is_answered": false,
            "question_id": 153328,
            "item_type": "answer",
            "score": 15,
            "last_activity_date": 1436138859,
            "creation_date": 1436138859,
            "body": "Disclaimer: Any method you use to do this, especially with a consumer GPS unit, is going to be an approximation at best. If you truly want to know where the boundaries are, you will need to locate property pins/corners which might require a metal detector. Your best, safest option is to hire a professional land surveyor.\n\nNo, those are not lat/longs in the description. Those are bearings and distances. What you have is a metes and bounds description which locates a point, gives bearing and distance to the next point, and so on all the way around and back to the point of beginning (known as a traverse). Such descriptions usually, and in the case of the example you give, refer to the Public Land Survey System (PLSS) in the US.\n\nTo locate a section corner you&#39;ll need to either estimate it from data or find a benchmark. For some states you can locate a GIS version of the PLSS grid - see PLSS shapefiles - alternative to geocommunicator.gov? But do note those aren&#39;t surveyed - some points are (control network) and the rest are calculated to fit. You could also check with the county to see if they make their survey control network available. This would have actual surveyed corners and locations of benchmark monuments, possibly with lat/long coordinates already provided. You&#39;d have to locate the nearest benchmark and work your way to it - the plat survey should have note on it somewhere of such a benchmark. If all you have is the description, you&#39;re on your own. And since you&#39;ll be starting at a quarter-quarter corner, you&#39;re unlikely to find a monument right there (they&#39;re usually sections or quarters at best).\n\nOnce you find that point, from your example the description starts immediately. In some cases there are commencement calls that get you to a true point of beginning, and then the shape starts. From there it&#39;s an orienteering exercise.\n\nTo get all this into GPS coordinates, you&#39;ll need to know at least one point&#39;s lat/long and work out the rest, or plot the description and unproject it to a geographic coordinate system. A related question, though for a different country, can be found at Outline a plot of land on a map. You don&#39;t mention what software you&#39;re using or have access to. If you specify something, more help could be given.\n\nHonestly, your best bet is to go to the county GIS website (per your descripton). Using their online map application, you can get a pretty good idea of where the parcel is and possibly turn imagery on to get some landmarks to use in locating it. Their section grid is on by default, zoom in far enough and you&#39;ll be able to see the labels to locate 03-25-2E per their labeling scheme. Looks like it&#39;s on the north end of the City of Bainbridge Island. Since I can&#39;t see the full description, nor do I know exactly where the quarter-quarter corners are, I&#39;m guessing it&#39;s one of the parcels in the vicinity of the one outlined in green below. The SE corner of the SW4 NW4 is somewhere around the bottom right corner of that parcel. I&#39;ve outlined the section in red, because the gray dashed line they use is kind of hard to see. If the documents you have include a parcel ID number or address, you can look that up directly in the system.\n\n\n\nYou can also use that page to identify the correct parcel, and then pull it up in Google Maps where if you right-click a point and choose What&#39;s Here? it will give you the lat/long coordinates of that point. So you could get a rough idea where the corners are and then get ballpark coordinates to use in your GPS. Which remember a consumer grade unit is only going to be accurate down to about 3m anyway.\n",
            "excerpt": "Such descriptions usually, and in the case of the example you give, refer to the Public Land <span class=\"highlight\">Survey</span> System (PLSS) in the US. &hellip; You could also check with the county to see if they make their <span class=\"highlight\">survey</span> control network available. &hellip; ",
            "title": "Locating property corners using plat map description?"
        },
        {
            "tags": [
                "shapely",
                "filter",
                "geopandas"
            ],
            "question_score": 15,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 282681,
            "item_type": "question",
            "score": 15,
            "last_activity_date": 1569416965,
            "creation_date": 1526142825,
            "body": "I have a dataframe of health survey data which is geotagged, called . I have converted the dataframe to a GeoPandas dataframe, and used the geotags as the geometry column within the dataframe, for example:\n\n\n\nI want to filter the dataframe so that only points in the UK are returned. I have the UK coordinates in a separate Geoseries, called uk_geom, which I simply took from the GeoPandas built-in world map:\n\n\n\nThis returns uk_geom as a GeoPandas GeoSeries:\n\n\n\nI simply want to filter  for all points within momdata.geometry that fall within uk_geom, returning a dataframe of only UK-based survey observations. This should be simple.\n\nI tried: \n\n\n\nbut this returns an empty dataframe, when I know that some of the survey observations for sure are in the UK. \n\nFor example:\n\n\n\nI tried this the other way round, checking which momdata points are contained within uk_geom:\n\n\n\nAlso when I test the &#39;within&#39; function on a point that I know is within , I get an error:\n\n\n\nI have assigned the correct co-ordinate reference system: \n\n\n\nI also tried a basic &#39;apply&#39; function using a predicate, but this returns an error:\n\n\n\nI also tried a spatial join, but then I get the error that one of the join columns is not a DataFrame, as of course it&#39;s trying to join on the geometry column:\n\n\n\nHow do I solve this? \n\nI can&#39;t seem to make it work.\n",
            "excerpt": "I have a dataframe of health <span class=\"highlight\">survey</span> data which is geotagged, called momdata. &hellip; I tried: \n\nuk_momdata = momdata[momdata.geometry.within(uk_geom)]\n\nbut this returns an empty dataframe, when I know that some of the <span class=\"highlight\">survey</span> observations for sure are in the UK. &hellip; ",
            "title": "Filter a GeoPandas dataframe for points within a specific country"
        },
        {
            "tags": [
                "geometry",
                "extents",
                "gis-principle",
                "terminology",
                "bbox"
            ],
            "question_score": 17,
            "is_accepted": true,
            "answer_id": 240982,
            "is_answered": false,
            "question_id": 240979,
            "item_type": "answer",
            "score": 15,
            "last_activity_date": 1564582600,
            "creation_date": 1495163369,
            "body": "I think you&#39;ll find there is a bit of overlap with these definitions. They&#39;re all very similar, in my opinion. However, ESRI has a glossary of GIS terms, so I just looked them up. The definitions are similar or identical to the wiki GIS glossary as well.\n\nBounding Box (Bounding Rectangle):\n\n\n  [map display] The rectangle, aligned with the coordinate axes and\n  placed on a map display, that encompasses a geographic feature or\n  group of features or an area of interest. It is defined by minimum and\n  maximum coordinates in the x and y directions and is used to\n  represent, in a general way, the location of a geographic area.\n\n\nExtent:\n\n\n  The minimum bounding rectangle (xmin, ymin and xmax, ymax) defined by\n  coordinate pairs of a data source. All coordinates for the data source\n  fall within this boundary.\n\n\nIt should be noted that in the arcpy documentation for extent (though you haven&#39;t said which software you&#39;re using), the definition is essentially the same:\n\n\n  An extent is a rectangle specified by providing the coordinate of the\n  lower left corner and the coordinate of the upper right corner in map\n  units.\n\n\nExtent Rectangle (you didn&#39;t ask for this one, but it was in the glossary so I threw it in):\n\n\n  [ESRI software] A rectangle that is displayed in one data frame,\n  showing the size and position of another data frame.\n\n\nThe glossary doesn&#39;t have a definition for bounds, but I think it would likely be similar or identical to extent.  It should be noted there is also a term called &quot;metes and bounds&quot;, which is not really what you&#39;re asking, but I thought I would include it anyway.\n\nMetes and Bounds:\n\n\n  A surveying method in which the limits of a parcel are identified as\n  relative distances and bearings from landmarks. Metes and bounds\n  surveying often resulted in irregularly shaped areas.\n\n\nFinally, there is a tool in ArcGIS called Minimum Bounding Geometry which:\n\n\n  Creates a feature class containing polygons which represent a\n  specified minimum bounding geometry enclosing each input feature or\n  each group of input features.\n\n\nDepending on which option you choose, the results will be different.  However, it&#39;s worth noting that the Envelope option is a polygon which appears to be to be identical to the extent.\n",
            "excerpt": "Metes and Bounds:\n\n\n  A <span class=\"highlight\">surveying</span> method in which the limits of a parcel are identified as\n  relative distances and bearings from landmarks. &hellip; Metes and bounds\n  <span class=\"highlight\">surveying</span> often resulted in irregularly shaped areas. &hellip; ",
            "title": "Difference between bounding box, envelope, extent, bounds?"
        },
        {
            "tags": [
                "geocoding",
                "algorithm",
                "references",
                "gis-principle"
            ],
            "question_score": 20,
            "is_accepted": false,
            "answer_id": 4626,
            "is_answered": false,
            "question_id": 4620,
            "item_type": "answer",
            "score": 14,
            "last_activity_date": 1293029770,
            "creation_date": 1292984981,
            "body": "From Text to Geographic Coordinates:\nThe Current State of Geocoding\n\nDaniel W. Goldberg, John P. Wilson, and Craig A. Knoblock\nAbstract: This article presents a survey of the state of the art in geocoding practices through a cross-disciplinary historical review\nof existing literature. We explore the evolving concept of geocoding and the fundamental components of the process. Frequently\nencountered sources of error and uncertainty are discussed as well as existing measures used to quantify them. An examination\nof common pitfalls and persistent challenges in the geocoding process is presented, and the traditional methods for overcoming\nthem are described.\n\n10.1.1.119.714.pdf\n\nPDF (page 34 onwards)\nhttp://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.119.714&amp;rep=rep1&amp;type=pdf\n",
            "excerpt": "Knoblock\nAbstract: This article presents a <span class=\"highlight\">survey</span> of the state of the art in geocoding practices through a cross-disciplinary historical review\nof existing literature. &hellip; ",
            "title": "Good resources on geocoding algorithms"
        },
        {
            "tags": [
                "spherical-geometry",
                "viewshed",
                "gis-principle",
                "visibility"
            ],
            "question_score": 14,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 7644,
            "item_type": "question",
            "score": 14,
            "last_activity_date": 1463069329,
            "creation_date": 1300912379,
            "body": "Can anyone explain, as simply as possible, how to calculate the visible sky percentage?\n\nI have done a satellite survey and have worked out the height of buildings and the distance between them.  \n\nHow do I use that data to calculate the visible sky percentage according to where I was standing?\n",
            "excerpt": "I have done a satellite <span class=\"highlight\">survey</span> and have worked out the height of buildings and the distance between them. &hellip; ",
            "title": "Calculating visible sky percentage?"
        },
        {
            "tags": [
                "qgis",
                "coordinate-system",
                "epsg"
            ],
            "question_score": 12,
            "is_accepted": true,
            "answer_id": 169211,
            "is_answered": false,
            "question_id": 169193,
            "item_type": "answer",
            "score": 13,
            "last_activity_date": 1446760447,
            "creation_date": 1446760447,
            "body": "Short Answer:\nQGIS handles SRS much the same as ESRI.  Dive into QGIS and you&#39;ll find all your favorite SRS waiting for you.\n\nLong Answer:\nEPSG is the European Petroleum Survey Group.  It provides &#39;official&#39; spatial reference systems and spheroids and its codes are ubiquitous.  ESRI \ntakes most of its SRS from the EPSG dataset.  So you are already using the EPSG SRS, except ESRI just doesn&#39;t tell you the catalog number in an obvious way.  ESRI has a few &#39;interesting&#39; SRS that are not available in the EPSG catalog (e.g. the Dymaxion and a cube projection) but they are not in common use.  \n\nQGIS uses the EPSG naming convention but provides common names too so you should not get lost if you are familiar with ESRI.  Coming from ESRI, the EPSG codes can seem a bit alien at first, but you quickly get used to it as you realise that you&#39;ve been using it all along.  \n\nLastly we have the user-defined SRS group.  These have no official status.  It is possible to define your own projection system (as you can in ArcGIS) but the need to do so is rare as there are so many tried and tested SRS out there and correctly defining an SRS is (IMO) a non-trivial task if you want to have something reliable and then have to convince all your co-workers that it is both credible and necessary.  Personally, I would be a bit suspicious of any of the User-defined SRS as I do not know their provenance or accuracy and would have to spend time researching their composition. I&#39;d rather use an EPSG SRS that has good documentation and is well supported.\n\nWhile we&#39;re on the subject, ESRI also borrows parts of GDAL so you are also using some of QGIS&#39; raster handling capabilities (particularly for converting between ratser data types)... you may not be aware of that either, but it should give you a bit of additional comfort moving to QGIS.\n",
            "excerpt": "Long Answer:\nEPSG is the European Petroleum <span class=\"highlight\">Survey</span> Group.  It provides &#39;official&#39; spatial reference systems and spheroids and its codes are ubiquitous. &hellip; ",
            "title": "What is the difference between spatialreference.org catalogs: EPSG, ESRI, and User-defined?"
        },
        {
            "tags": [
                "geocoding",
                "georeferencing",
                "oracle-spatial"
            ],
            "question_score": 19,
            "is_accepted": false,
            "answer_id": 28614,
            "is_answered": false,
            "question_id": 28593,
            "item_type": "answer",
            "score": 13,
            "last_activity_date": 1341106051,
            "creation_date": 1341106051,
            "body": "I see them as separate activities.\n\nGeocoding is the process of taking coded location information (such as addresses or grids) and turning it into explicit location information (X and Y coordinates, usually). Reverse geocoding is the opposite, taking XY data and locating the nearest address, grid, etc.\n\nGeoreferencing is the process of taking a raster image or vector coverage, assigning it a coordinate system and coordinates, and translating, transforming, and warping/rubbersheeting it into position relative to some other spatial data, such as survey locations, street intersections, etc.\n\nThis can be sometimes also be called rectification or georectification interchangeably, while in some contexts, georeferencing is considered to only include the assigning of a spatial reference and coordinates to the image, and rectification is the transformation and resampling of the image to remove distortion (as in orthorectification).\n\nIn ArcGIS, georeferencing is transitory (on-the-fly transformation of the source image) while rectification is permanent (creating a new resampled image given a georeferenced raster layer).\n",
            "excerpt": "raster image or vector coverage, assigning it a coordinate system and coordinates, and translating, transforming, and warping/rubbersheeting it into position relative to some other spatial data, such as <span class=\"highlight\">survey</span> &hellip; ",
            "title": "What is the difference between geocoding and georeferencing?"
        },
        {
            "tags": [
                "gps",
                "convert",
                "ogr",
                "spatialite",
                "gpx"
            ],
            "question_score": 13,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 32618,
            "item_type": "question",
            "score": 13,
            "last_activity_date": 1435049073,
            "creation_date": 1346427739,
            "body": "On our aerial wildlife surveys we typically generate dozens of GPX files, and usually convert most of them into shapefiles for display in a GIS application. GPX files are a terrific way of keeping all (or almost all) of your GPS data in one place –&#160;they are xml files that store tracklog, waypoint &amp; route information in one convenient format. They store multiple tracks, even old saved tracks from a Garmin. \n\nI&#39;d like to store all this track data in a spatialite database, in parallel with other tables that have point observational data from the same survey.\n\nogr2ogr will let me convert the track to a spatialite database:\n\n\n\nHowever, this imports each saved track as a line – losing the time / location information for each track point!\n\nAnyone know of any clever ways of building a tracklog database that will preserve that information?\n\nEDIT:\n\nTracklogs are not just a line - they are collections of sequential points, each with an elevation and time attribute. Each point belongs to a track segment, which in turn belong to a given track, and points within each track segment were taken without interruption and may be assumed to be linked. For example:\n\n\n\nThus, to save a tracklog you need to save this collection of points with their associated data.\n\nOne solution might be to load these tracks as points, with additional columns for track name, segment, elevation and time; I don&#39;t think ogr will convert the tracks as points, though.\n\nSolution\n\nThanks to @scruss who pointed out gpx2spatialite, which I installed (OS X 10.9) with . This set of tools is designed for the &#39;drawinglife&#39; project (and thus has some &#39;city&#39; information that is probably unnecessary for most of us); the main gpx2spatialite page doesn&#39;t explain much, but the drawinglife wiki is better. Still, lots of undocumented features - like removing duplicates!\n\nCreate a spatialite database for GPX files which will hold track segments, tracks, trackpoints and waypoints. It also has &#39;users&#39; set up (which seems odd, since sqlite is not a user-access system, but was meant for drawinglife) designed to label the various tracks:\n\n\n\nLoad a whole folder of GPX files, including all subfolders, checking and removing duplicates along the way:\n\n\n\nOptions:\n\n\n= don&#39;t check if the trackpoints are in the city database (speeds it up a LOT)\n = database to use;\n = add the user SL25 (just a label I used for the set of tracks collected);\n = the folder (with subfolders) that has the tracks I&#39;m interested in.\n\n\nBugs:\n\n\nIf you have saved tracks on an older Garmin that discards time stamp info, it&#39;ll crash the import (remove those saved tracks using a utility like GPSU). If you have gpsbabel, filter the file first with something like:\n\ngpsbabel -w -r -t -i gpx -f [INPUT.gpx] -x track,start=20000101 -o gpx -F [OUTPUT.gpx]\n\n",
            "excerpt": "I&#39;d like to store all this track data in a spatialite database, in parallel with other tables that have point observational data from the same <span class=\"highlight\">survey</span>. &hellip; ",
            "title": "How to build a geographic database of GPS logs?"
        },
        {
            "tags": [
                "postgis",
                "epsg",
                "srid"
            ],
            "question_score": 7,
            "is_accepted": true,
            "answer_id": 167450,
            "is_answered": false,
            "question_id": 167440,
            "item_type": "answer",
            "score": 13,
            "last_activity_date": 1445533084,
            "creation_date": 1445533084,
            "body": "There is no EPSG SRID 102743. Note that EPSG is the authority, and 102743 is the SRID. If you look up SRID 102743 on spatialreference.org, the listing is for ESRI:102743, meaning that ESRI (the publishers of ArcGIS) is the authority, not EPSG (European Petroleum Survey Group, now absorbed by the International Association of Oil &amp; Gas Producers). The PostGIS database does not by default populate  with non-EPSG reference systems, so if you are using an ESRI one you have two choices:\nAdd it manually\nThis is fairly easy. Each SRID page on spatialreference.org has a link for a PostGIS  statement to add the code to . The statement for this SRID is:\n\nUse a &quot;close enough&quot; SRID\nThe PostGIS database includes a number of suitable SRIDs. As you have found, EPSG:3566 is a close match. In fact, 3566 (NAD83), 3569 (NAD83(HARN)), and 3677 (NAD83(NSRS2007)) are all extremely close matches. The only difference between 3566 and 102743 is the false easting and false northing parameters.\n\n3566\n\n\n\n\n\n102743\n\n\n\n\n\n\nSo using the &quot;wrong&quot; one might lead to a misalignment of 3/100,000th of a foot.\n",
            "excerpt": "If you look up SRID 102743 on spatialreference.org, the listing is for ESRI:102743, meaning that ESRI (the publishers of ArcGIS) is the authority, not EPSG (European Petroleum <span class=\"highlight\">Survey</span> Group, now absorbed &hellip; ",
            "title": "What is the SRID for EPSG 102743?"
        },
        {
            "tags": [
                "coordinate-system",
                "geojson",
                "ogc",
                "specification"
            ],
            "question_score": 13,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 15953,
            "item_type": "question",
            "score": 13,
            "last_activity_date": 1454399110,
            "creation_date": 1319067434,
            "body": "I&#39;m writing a web API to our GIS data, currently revamping our geocoding service. I&#39;m creating the option for folks to specify the output type as GeoJSON so I&#39;m trying to follow the spec. Our data is stored in nad83 datum UTM zone 12 north projection. The GeoJSON spec says to add a CRS. The wkid is 26912 but what is the OGC CRS URN? \n\nI can understand that the OGC CRS URN is broken down into a few parts.\n\nurn:ogc:def:crs:OGC:1.3:CRS84\n\nurn is the identifier, ogc is the organization, def is another static deal, crs is the type (coordinate reference system), OGC is the authority, 1.3 is the version and CRS84 is the projection.\n\nWhy is the authority of utm 26912 the European Petroleum Survey Group? \n\nDo any mapping frameworks even use this CRS name? \n\nI want to follow the spec but it seems that more mapping frameworks are using the wkid.\n\nhttp://spatialreference.org/ref/epsg/26912/\n\nseems like the best place to get the info but they don&#39;t even list the urn. Is the GeoJSON spec just silly or what?\n",
            "excerpt": "Why is the authority of utm 26912 the European Petroleum <span class=\"highlight\">Survey</span> Group? \n\nDo any mapping frameworks even use this CRS name? &hellip; ",
            "title": "What&#39;s up with the GeoJSON spec and CRS as a IRM?"
        },
        {
            "tags": [
                "epsg"
            ],
            "question_score": 12,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 203355,
            "item_type": "question",
            "score": 12,
            "last_activity_date": 1469468375,
            "creation_date": 1469388309,
            "body": "A WFS server I was using offered boundaries data in the following EPSG codes:\n\n\nEPSG:6.9:27700\nEPSG:6.9:4326\n\n\n...defined in the XML  spec like this:\n\n\n\nAs I understand it, EPSG 4326 is the &quot;standard&quot; latitude and longitude ellipsoid used by GPS systems, and EPSG:27700 is the older British system behind the Ordnance Survey National Grid. \n\nBut what&#39;s the  mean?\n\nI tried inputting it into ogr2ogr and it just got confused:\n\n\n  {&quot;errors&quot;:[&quot;ERROR 6: EPSG PCS/GCS code 6 not found in EPSG support files.  Is this a valid&quot;,&quot;EPSG coordinate system?&quot;,&quot;Failed to process SRS definition: EPSG:6.9:4326&quot;,&quot;&quot;]}\n\n\n...and I can&#39;t find any reference to what the component parts of an EPSG code mean, only lists of &#39;standard&#39; EPSG codes that don&#39;t have these initial numbers.\n",
            "excerpt": "def:crs:EPSG:6.9:4326&lt;/OtherSRS&gt;\n\n\nAs I understand it, EPSG 4326 is the &quot;standard&quot; latitude and longitude ellipsoid used by GPS systems, and EPSG:27700 is the older British system behind the Ordnance <span class=\"highlight\">Survey</span> &hellip; ",
            "title": "What&#39;s the meaning of numbers before an EPSG code, e.g. the 6.9 in EPSG:6.9:4326?"
        },
        {
            "tags": [
                "qgis",
                "qfield",
                "cloud-gis"
            ],
            "question_score": 3,
            "is_accepted": true,
            "answer_id": 395168,
            "is_answered": false,
            "question_id": 394932,
            "item_type": "answer",
            "score": 12,
            "last_activity_date": 1619694202,
            "creation_date": 1619628686,
            "body": "qfield.cloud is exactly what you&#39;re looking for. It is natively supported in QField and allows you to synchronise your field survey directly to the cloud (and to your team) as soon as you have connectivity. This way you can work with no issues wherever you need to.\nOnce synchronised, you can use your data with QGIS, or any other tools you wish. Later we&#39;ll also add the possibility to directly publish your data on a web map from the QFieldCloud web panel.\nWe are currently in beta and are opening up spots every day to new preregistered users. If you preregister on qfield.cloud you&#39;ll get an information mail very soon, and if you reach out directly to us at opengis.ch you might even get an immediate invitation ;)\nyou can also checkout my [1h] talk about it on QGIS&#39;s youtube channel\nDisclaimer: I&#39;m one of the developers of QField/QFieldCloud\n",
            "excerpt": "It is natively supported in QField and allows you to synchronise your field <span class=\"highlight\">survey</span> directly to the cloud (and to your team) as soon as you have connectivity. &hellip; ",
            "title": "QField connected to Cloud"
        },
        {
            "tags": [
                "arcgis-10.0",
                "convert",
                "spherical-geometry",
                "vb",
                "borehole"
            ],
            "question_score": 12,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 13484,
            "item_type": "question",
            "score": 12,
            "last_activity_date": 1695411252,
            "creation_date": 1313089999,
            "body": "I have an excel spreadsheet with header and survey drill data. Header data contains hole ID, and location coordinates, and the survey data contains related downhole survey with Distance, Azimuth and Dip values. \n\nSince I know the hole location and surface elevation, I would like to be able to convert the survey table to XYZ coordinates as well.  Does anyone has a function / procedure / example?  (VB &amp; ArcObjects)\n\nHeader Data:\n\n\n\nSurvey Data:\n\n\n",
            "excerpt": "I have an excel spreadsheet with header and <span class=\"highlight\">survey</span> drill data. &hellip; (VB &amp; ArcObjects)\n\nHeader Data:\n\n\n\n<span class=\"highlight\">Survey</span> Data: &hellip; ",
            "title": "How to convert Distance, Azimuth, Dip to XYZ?"
        },
        {
            "tags": [
                "google-maps",
                "kml",
                "gml",
                "google-fusion-tables"
            ],
            "question_score": 12,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 13830,
            "item_type": "question",
            "score": 12,
            "last_activity_date": 1543025238,
            "creation_date": 1313953096,
            "body": "I have a client who wants to visualise cancer incidence and mortality rates by local/unitary authority across Great Britain. I&#39;ve used Ordnance Survey data to get the boundaries of the authorities in GML format and saved all of them as one large GML file. I used QGIS to convert the data to KML format. I have the data in Fusion Tables now and it all looks great except for one blatant gap in the coverage.\n\nWhen I look at the KML data for the missing local authority, it hasn&#39;t imported at all (ie the cell is empty). I&#39;ve tried re-uploading the geometry (and re-downloading and re-converting) and Fusion Tables is definitely rejecting it as KML. I&#39;ve read somewhere that Fusion Tables can mess around with your geometry somewhat, so I uploaded the KML file and pointed Google Maps directly at it and that didn&#39;t work either (I don&#39;t know how good a test that is).\n\nI don&#39;t know that I originally created a valid GML file (I don&#39;t know the standard) but they seemed to import ok to QGIS and the final result looks great apart from this one place. The area is visible in QGIS when I load the GML file, so I don&#39;t know if QGIS is producing invalid KML, or mayble Google Maps/Fusion Tables have limitations?\n\n\n\nI&#39;ve downloaded the OS Open data pointed to by @nhopton, loaded the appropriate layer into QGIS (Layer -&gt; Add vector layer), saved it as KML (Layer -&gt; Save as) and uploaded it to Fusion Tables. (Note that I didn&#39;t explicitly do anything with the CRS). Generally it&#39;s worked well (and importantly the particular area that had failed with my first method worked with this, so I have the missing geometry!). However, there&#39;s a number of missing areas again. And in this case, there&#39;s much less that I&#39;ve done to the data myself, so it&#39;s not so easy to assume I&#39;ve just messed up the data. Any ideas why my final results look like this?\n",
            "excerpt": "I&#39;ve used Ordnance <span class=\"highlight\">Survey</span> data to get the boundaries of the authorities in GML format and saved all of them as one large GML file. I used QGIS to convert the data to KML format. &hellip; ",
            "title": "Why does one part of GML -&gt; KML conversion not work on Google Maps?"
        },
        {
            "tags": [
                "qgis",
                "coordinate-system",
                "data"
            ],
            "question_score": 12,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 4160,
            "item_type": "question",
            "score": 12,
            "last_activity_date": 1291592983,
            "creation_date": 1291479183,
            "body": "I&#39;m looking for a fairly simple way to append columns with  WGS84 longitude and latitude to a table containing northings and eastings.  The source data is Ordnance Survey&#39;s CodePoint Open, which I is I think OSBGB36.  I want to use this with OpenStreetMap.  I have the CodePoint data in a csv file and loaded into an MS Access database, from which I can load it into QGIS.  From there I&#39;ve tried exporting it with a transform operation into various file formats but this doesn&#39;t seem to do the trick.  I do have access to PostGIS and SQL Server 08R2 but little experience of using sql spatial.\n",
            "excerpt": "I&#39;m looking for a fairly simple way to append columns with  WGS84 longitude and latitude to a table containing northings and eastings.  The source data is Ordnance Survey&#39;s CodePoint Open, which I is  &hellip; ",
            "title": "Derive WGS84 Longitude &amp; Latitude from British Northings &amp; Eastings"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcgis-10.1",
                "arcmap",
                "line"
            ],
            "question_score": 13,
            "is_accepted": true,
            "answer_id": 36727,
            "is_answered": false,
            "question_id": 36724,
            "item_type": "answer",
            "score": 12,
            "last_activity_date": 1413851571,
            "creation_date": 1350248833,
            "body": "The solution to the first part of your question is &quot;Splitting a line into an equal number of parts&quot;:\n\n\n  The Split command on the Editor toolbar allows you to split a line\n  into an equal number of new features. For example, you can use this\n  Split option to break a line into pieces that are the same length.\n  This functionality is similar to the Divide command available in\n  previous ArcGIS releases.\n\n\nFurther down on the same page is a section on &quot;Splitting lines proportionally&quot;.  This should help you with the second part of your question, although you will need at least a Standard (ArcEditor) license to do this.\n\n\n  The Proportion command Proportion on the COGO toolbar splits a\n  selected line feature into a number of segments, based on specified\n  distance values. If there is a difference between the feature length\n  and the entered values, this difference is proportioned between all\n  the new segments. Proportion is useful when you are working with exact\n  measurements, such as COGO or survey data.\n  \n  For example, you have line features that need to be split into\n  specific lengths. The example below shows a line feature that needs to\n  be split into four parts: 13.79 feet, 48 feet, 60 feet, and 60 feet.\n  The Proportion command is used to split this feature into the four new\n  features.\n\n\nAs stated above, in previous versions of ArcGIS, dividing lines into segments was accomplished using the Divide command.\n",
            "excerpt": "Proportion is useful when you are working with exact\n  measurements, such as COGO or <span class=\"highlight\">survey</span> data.\n  \n  For example, you have line features that need to be split into\n  specific lengths. &hellip; ",
            "title": "Partitioning Line into Segments using ArcGIS Desktop?"
        },
        {
            "tags": [
                "python",
                "open-source-gis",
                "satellite"
            ],
            "question_score": 12,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 17558,
            "item_type": "question",
            "score": 12,
            "last_activity_date": 1502619105,
            "creation_date": 1323091535,
            "body": "A while ago I did a neighbourhood roof orientation survey for solar panel deployment, by visually checking each roof and marking individually whether they were south or almost south-facing. \n\nAs this is very time-consuming, I would like to find a way to automate this, but don&#39;t know how this would be possible by merely analysing roof shadows. \n\nI can script a little but have never written any plug-ins. \n\nWhat other elements do I need to include? \n\nWe are on a very low budget, so seek any suggestions how to do this using open source tools.\n",
            "excerpt": "A while ago I did a neighbourhood roof orientation <span class=\"highlight\">survey</span> for solar panel deployment, by visually checking each roof and marking individually whether they were south or almost south-facing. &hellip; ",
            "title": "Automating roof orientation detection from satellite imagery?"
        },
        {
            "tags": [
                "coordinate-system",
                "germany"
            ],
            "question_score": 12,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 37219,
            "item_type": "question",
            "score": 12,
            "last_activity_date": 1691517362,
            "creation_date": 1350834850,
            "body": "I have WGS84 latitude and longitude for data points near Munich and I&#39;d like to use a grid-type coordinate system, like the Ordnance Survey grids in Ireland or the UK.\nWhat similar coordinate system do you recommend for Germany?\n",
            "excerpt": "I have WGS84 latitude and longitude for data points near Munich and I&#39;d like to use a grid-type coordinate system, like the Ordnance <span class=\"highlight\">Survey</span> grids in Ireland or the UK. &hellip; ",
            "title": "Recommended Coordinate Reference System (CRS) for Germany"
        },
        {
            "tags": [
                "data",
                "ordnance-survey",
                "united-kingdom",
                "grids-graticules"
            ],
            "question_score": 12,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 21,
            "item_type": "question",
            "score": 12,
            "last_activity_date": 1622560245,
            "creation_date": 1279826571,
            "body": "Does anyone know a source from which to download vector UK Ordnance Survey grids at varying resolutions? Or failing that, a tool that can create an OS grid at a specified resolution? There are plenty of ways to generate a vector grid, but I&#39;ve found no way of populating the attributes with OS grid references.\n",
            "excerpt": "Does anyone know a source from which to download vector UK Ordnance <span class=\"highlight\">Survey</span> grids at varying resolutions? Or failing that, a tool that can create an OS grid at a specified resolution? &hellip; ",
            "title": "Ordnance Survey grids - download or generate?"
        },
        {
            "tags": [
                "qgis",
                "qgis-2",
                "azimuth"
            ],
            "question_score": 12,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 264422,
            "item_type": "question",
            "score": 12,
            "last_activity_date": 1686905336,
            "creation_date": 1512576135,
            "body": "I have drawn a series of straight lines on a map joining different locations. The lines have a single vertex at each end.  I am using the Ordnance Survey of Great Britain 1936 projection.\nI now want to know the compass bearings I will have to walk to move from one location to the next.\n\nIs there any easy way to get QGIS to calculate/display the azimuth of the lines I have drawn?\n\nBetter still is there any way to get QGIS to actively display the azimuth of the lines as I am drawing them?\n\n\nI am aware there is an azimuth function but the syntax appears to need the input of the coordinates of the vertices on either end of the line which would be very time-consuming.\n",
            "excerpt": "I am using the Ordnance <span class=\"highlight\">Survey</span> of Great Britain 1936 projection.\nI now want to know the compass bearings I will have to walk to move from one location to the next. &hellip; ",
            "title": "Displaying azimuth of line in QGIS"
        },
        {
            "tags": [
                "google-maps",
                "scale",
                "zoom"
            ],
            "question_score": 119,
            "is_accepted": false,
            "answer_id": 42423,
            "is_answered": false,
            "question_id": 7430,
            "item_type": "answer",
            "score": 12,
            "last_activity_date": 1354135925,
            "creation_date": 1354070765,
            "body": "Radius @ Equator 6,378,137 meters exact (WGS-84)\n\nCircumference at Equator = 40,075,017 meters (2πr)\n\nZoom level 24 uses 2 to the 32 power (4,294,967,296) pixels at circumference.\n\nEquatorial Circumference / 2 32 =  .009330692 meters per pixel\n\nUnit at Latitude =  (Cosine of Latitude) X (Unit at Equator)\n\nZoom level doubles each increment.\n\n1 foot (International) = 0.3048 meters\n\nEdit\n\nWell its not really a legitimate question to start with.  Scale ratios are relative to printed documents not computer screens.  What you need  for these images to be used with any accuracy is to know the dimension of each pixel then scale the image according to whatever your overlaying it with.\n\nSo back 15-20 year ago someone took WGS-84 as base data.  (note in a previous post someone used a value of 40,075,160  I&#39;ve seen this in Wikipedia a few places and it&#39;s incorrect.   The correct value is 40,075,017\n\nThey then took that and divided it by a full 32 bit integer.  This is a logical choice as it yields global accuracy to about one centimeter which is plenty for aerial imagery. 32 bit integers are also efficient to store and process.\n\nWhy this is level 24 was chosen I don&#39;t know however as someone else here worked out 0 gets you down to one 256 pixel tile for the earth.\n\nNow for an example of how to use the above data.  Lets say I have an image at zoom level 20 (as zoomed as they currently let you get)  Take 0.009330692 (Zoom 24 at equator) double it for zoom 23, again for zoom 22, again for zoom 21 and one last time for zoom 20.  You should now have 0.149231071.  \n\nNow lets say our image is at latitude 45.  Take the Cosine of that (0.707106781) and multiply it by our 0.149231071 and it will give you  0.105564729 meters.  That is the length and height of one pixel from an image at latitude 45 at zoom level 20.  If you screen capture a 1000 x 1000 pixel image of that area the dimension are 105.56 meters square.  If you want feet divide that 0.3048\n\nAs for sources I essencial reversed engineer about 5 years ago from various bit of info and documentation I found on the web including Google and MS mapping support sites.\n\nI have used this hundred of time and overlaying it with actually field survey data and its always been correct.  Check it against any to the tables posted here and the numbers will match.\n",
            "excerpt": "I have used this hundred of time and overlaying it with actually field <span class=\"highlight\">survey</span> data and its always been correct.  Check it against any to the tables posted here and the numbers will match. &hellip; ",
            "title": "What ratio scales do Google Maps zoom levels correspond to?"
        },
        {
            "tags": [
                "cartography",
                "statistics"
            ],
            "question_score": 14,
            "is_accepted": true,
            "answer_id": 12918,
            "is_answered": false,
            "question_id": 12914,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1312230656,
            "creation_date": 1312214863,
            "body": "A rencent journal article I came across discusses exactly what @Aksel in another answer (Sun and Wong, 2010) (It is available here for free online, but that link is void of pictures of the maps as far as I can tell). Essentially they suggest they prefer the overlay approach as opposed to the small multiple approach (i.e. making two maps, one showing the estimate and another showing uncertainty).\n\nValue by alpha maps as have been mentioned on this forum  are an alternative way to representing uncertainty than the overlay of the dash lines (which I find more intuitive).\n\nOther works that I have read that may be of interest (although they don&#39;t directly answer the question) are;\n\n\nMapping the Results of Geographically Weighted Regression (Mennis, 2006) PDF here\nAll maps of parameter estimates are misleading (Gelman, 1999) PDF here\nThe original article I cited is Incorporating Data Quality Information in Mapping American Community Survey Data (Sun and Wong, 2010)\n\n",
            "excerpt": "Regression (Mennis, 2006) PDF here\nAll maps of parameter estimates are misleading (Gelman, 1999) PDF here\nThe original article I cited is Incorporating Data Quality Information in Mapping American Community <span class=\"highlight\">Survey</span> &hellip; ",
            "title": "How is margin of error reported on a map?"
        },
        {
            "tags": [
                "gis-professional"
            ],
            "question_score": 24,
            "is_accepted": true,
            "answer_id": 43898,
            "is_answered": false,
            "question_id": 43878,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1355403844,
            "creation_date": 1355403520,
            "body": "Im my &quot;GIS time&quot; (~ half of the working-day) I use\n\n60% day at computer scripting (70% developing software and &quot;GIS recipes&quot;, 30% leading with digital cartography); 20% at meetings (skype and presential); 20% learning/refreshing. \n\n\n\nSuggestion: review with more people here (and perhaps editing your question) the &quot;typical tasks&quot; list. The consensual list, and perhaps a survey (if here,  can you consolidate answers? else you can prepare a page like freeonlinesurveys?), can be used by many others.\n\nGIS professionals, typical day-by-day tasks\n\nPS: cartographers, geographers, programmers, etc. can be &quot;GIS professionals&quot;, since use/develop GIS as an usual task. \n\n\nCartography – creating new maps, or modifying others...\n\n\nMainly with layout (ex. editing CSS or mapfiles).\nMainly with databases (ex. building new layers with new SQL complex queries)\nMainly with raw data (ex. editing points, lines and polygons).\n\nResearch/develop - supposing  to producing new things,\n\n\non GIS software/architecture\non Geoprocessing methodologies/recipes\n\nInstalling and/or Testing GIS tools and methods - no new  thing; find, select, prepare and test.\nData editing/cleansing - editing or reviewing  already created data.\nSpatial Analysis - finding answers for spatial questions. \nMeetings\n\n\nWith &quot;GIS people&quot;\nWith &quot;non-GIS people&quot;\n\nLearning - reading books, journals, visiting GIS.stackexchange.com and another sites; using email, chat, telephone, presential talk, etc.\n\n",
            "excerpt": "The consensual list, and perhaps a <span class=\"highlight\">survey</span> (if here,  can you consolidate answers? else you can prepare a page like freeonlinesurveys?), can be used by many others. &hellip; ",
            "title": "How are you, as GIS professionals, spending most of your day at work?"
        },
        {
            "tags": [
                "census",
                "united-states"
            ],
            "question_score": 5,
            "is_accepted": false,
            "answer_id": 82760,
            "is_answered": false,
            "question_id": 82750,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1527860193,
            "creation_date": 1389592594,
            "body": "GEOID is the field used to join TIGER/Line geographic data to the demographic data in various American Community Survey products and in the Decennial Census. It is slightly confused by the fact that this field is called GEOID10 only in the TIGER/Line 2010 products (in fact, almost all of the field names in TIGER/Line 2010 end in 10), and by the fact that the actual code is different in the geographic and demographic products and has to be manipulated for the join to work.\n\nThis is discussed in several place, but most clearly in various ACS Technical Documents. See for example section 2.6 &quot;How to Join the ACS Summary File to the TIGER/Line Shapefiles&quot; of the 2006-2010 ACS 5-Year Summary File Technical Documentation.\n\nIn the ACS, GEOID begins as follows:\n\n\n3 digits for the summary level\n\n\n040 = state\n050 = county\netc...\n\n2 characters for the component\n\n\nThere are a large number of geographic components, but mostly what you need to know is 00 means the entire population, while anything else means only part of the population, e.g. the urban part, the rural part, etc.\n\nThe letters US\n\n\nAfter those 7 characters which are not present in the TIGER/Line products, the ACS GEOID and TIGER/Line GEOID[10] fields will match. The code will be a concatenation of the code of every geographic entity in the hierarchy of that record. For a tract, this may be two digits for the state FIPS, three digits for the county FIPS, and six digits for the tract code—or it may not, because another version of the census tract (summary level 080) follows the hierarchy State-County-County Subdivision-Place/Remainder-Census Tract.\n",
            "excerpt": "GEOID is the field used to join TIGER/Line geographic data to the demographic data in various American Community <span class=\"highlight\">Survey</span> products and in the Decennial Census. &hellip; ",
            "title": "Does anyone know what a geoid10 and its numbers mean?"
        },
        {
            "tags": [
                "coordinate-system",
                "united-states"
            ],
            "question_score": 1,
            "is_accepted": false,
            "answer_id": 37201,
            "is_answered": false,
            "question_id": 37200,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1350778461,
            "creation_date": 1350778461,
            "body": "This was down a bit in the comments at the link you provided:\n\n\n  SF uses State Plane, NAD 83, Zone 3, US Survey Feet. This coordinate system is used vs lat/longs as they have greater accuracy for smaller areas. We are looking at ways to convert this to lat/long to make it easier for consumers to use.\n\n",
            "excerpt": "This was down a bit in the comments at the link you provided:\n\n\n  SF uses State Plane, NAD 83, Zone 3, US <span class=\"highlight\">Survey</span> Feet. &hellip; ",
            "title": "Identifying coordinate system of San Francisco data?"
        },
        {
            "tags": [
                "qgis"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 247008,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1567063163,
            "creation_date": 1499676235,
            "body": "I&#39;m new to QGIS, and have what seems like basic requirements; however I&#39;m struggling to find a solution. I have GPS data in excel showing start and end points of a boat survey. In a row, it has start x, start y, end x, end y. \n\nI would like to plot these points on a map, and draw a line between each start and end point, but without drawing lines between points in different rows.\n\nI&#39;ve seen a few similar questions in the forums, but none of them seem to work when I try. Points to path seem to plot lines between rows, and only used one point per line, rather than the two required. I&#39;ve also seen WKT mentioned, but I don&#39;t know how this works.\n",
            "excerpt": "I have GPS data in excel showing start and end points of a boat <span class=\"highlight\">survey</span>. In a row, it has start x, start y, end x, end y. &hellip; ",
            "title": "Creating a line from two points in QGIS"
        },
        {
            "tags": [
                "postgis",
                "qgis",
                "postgresql"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 5797,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1297383267,
            "creation_date": 1296784492,
            "body": "Coming from an esri background I have always used relationship classes in a gdb to display records related to a feature. Eg. Relate 1 survey point to many documents, photos etc.\n\nDoes any one know how to do something similar in QGIS? \n\nAndo\n\nP.S I&#39;m using PostGreSQL 8.4.1 and PostGIS 1.4 and my clients are QGIS.\n",
            "excerpt": "Relate 1 <span class=\"highlight\">survey</span> point to many documents, photos etc.\n\nDoes any one know how to do something similar in QGIS? \n\nAndo\n\nP.S I&#39;m using PostGreSQL 8.4.1 and PostGIS 1.4 and my clients are QGIS. &hellip; ",
            "title": "How do you display related records in QGIS?"
        },
        {
            "tags": [
                "coordinate-system",
                "srid"
            ],
            "question_score": 11,
            "is_accepted": true,
            "answer_id": 26098,
            "is_answered": false,
            "question_id": 26094,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1337856047,
            "creation_date": 1337856047,
            "body": "Following on from the answer given by @atlefren, an SRID usually is made of two components, an &quot;authority&quot; and an identifier. The authority is just the name of the organization that catalogues the identifiers. The most common authority you&#39;ll see is , which sands for the &quot;European Petroleum Survey Group&quot;, and they have a comprehensive database of coordinate systems, datums, ellipsoids, projections, and so on, each with a code.\n\nThere are other authorities however, each with their own identifiers that may be different from, yet represent the same information, as an EPSG code. IGNF is one such authority supported by Quantum GIS for instance.\n",
            "excerpt": "The most common authority you&#39;ll see is EPSG, which sands for the &quot;European Petroleum <span class=\"highlight\">Survey</span> Group&quot;, and they have a comprehensive database of coordinate systems, datums, ellipsoids, projections, and so &hellip; ",
            "title": "Understanding concept of Spatial Reference System?"
        },
        {
            "tags": [
                "qgis",
                "point",
                "geometry",
                "visualisation",
                "point-creation"
            ],
            "question_score": 5,
            "is_accepted": false,
            "answer_id": 455248,
            "is_answered": false,
            "question_id": 455243,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1679126962,
            "creation_date": 1678868475,
            "body": "Use a Geometry Generator style for your point layer with an expression that creates a point based on x/y coordinate values for surveyed locations if it exists and else create a point based on x/y coordinate values for planned locations.\nThis expression does this based on field names of coordinate attributes called / and / respectively:\n\nScreenshot: red = surveyed, blue = planned holes (here with a slightly different expression, using  condition - it works the same):\n\nYou could also use two different symbol layers of Geometry Generator type (one for planning, one for surveyed locations) and apply a different style for each. Or use one symbol layer with the solution from above, but define a data-defined override for the color, something like:\n\n\nReferences:\n\nUse QGIS expressions to create geometries: difference between geometry generator and geometry by expression\n\n",
            "excerpt": "Use a Geometry Generator style for your point layer with an expression that creates a point based on x/y coordinate values for surveyed locations if it exists and else create a point based on x/y coor &hellip; ",
            "title": "Using multiple XY fields for geometry definition in point layer in QGIS"
        },
        {
            "tags": [
                "labeling",
                "cartography"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 36945,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1481416823,
            "creation_date": 1350468463,
            "body": "I have line features that are to be used for labels. These lines are correctly oriented(rotated) and positioned such that text placed on them should give a good cartographic output.\n\nCompare the below two images and their labels. In particular the word &quot;Waverton&quot; and its orientation in relation to &quot;Avenue&quot;.\n\n\n\n\nThe left is what all labelling engines seem to produce by default. The right is what it &quot;should&quot; look like according to the Ordnance Survey.\n\nSo my main question is - Which one is correct and why? What is the cartographic convention here?\n\nI ask this because out of the 5 labelling engines split between: QGIS (has two), MapInfo and ArcGIS (has two), only Maplex has the option to allow the user to insist the label follow the orientation of the line. The others all assume that upside down text is undesirable and automatically &quot;correct&quot; it.\n\n(Maps: &#169; Crown Copyright and database right 2012. Ordnance Survey 100019520.)\n",
            "excerpt": "The right is what it &quot;should&quot; look like according to the Ordnance <span class=\"highlight\">Survey</span>.\n\nSo my main question is - Which one is correct and why? What is the cartographic convention here? &hellip; Ordnance <span class=\"highlight\">Survey</span> 100019520.) &hellip; ",
            "title": "What&#39;s the convention for &quot;upside down&quot; labels?"
        },
        {
            "tags": [
                "shapefile",
                "r"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 37174,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1495283400,
            "creation_date": 1350733650,
            "body": "I am in the process of building a  choropleth map of population in administrative areas in Wales. I have downloaded the Boundary-Line data from the Ordnance Survey and extracted what seems to be the right shapefile (community_ward_region.shp). Using R, I have got as far as reading in the shapefile.\n\n\n\nWhich gives me this promising output:\n\n\n\nNow if I do this:\n\n\n\nI get a nice data frame called  that looks pretty much as I expected:\n\n\n\nHowever, this is a large data frame and  runs out of puff when trying to display it. In reality I only want to look at one area at a time. It looks as if the  factor in the shape object is what I want as it mostly corresponds to counties and the major conurbations.\n\n\n\nQ. How can I select only a subset of the data from the  object I extract from the shapefile? For example, only the  parts? If I can somehow include the  in the data frame that is created with  then I could easily subset the  data frame but I don&#39;t know how to do that. Or is there a way to use  to extract only parts of the object?\n",
            "excerpt": "I have downloaded the Boundary-Line data from the Ordnance <span class=\"highlight\">Survey</span> and extracted what seems to be the right shapefile (community_ward_region.shp). &hellip; ",
            "title": "How can I use fortify() to create a filtered R data frame from a shapefile?"
        },
        {
            "tags": [
                "qgis",
                "shapefile",
                "point"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 232423,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1489776328,
            "creation_date": 1489698534,
            "body": "I am using QGIS 2.18.2 on a Macbook Pro running OS X 10.10.5.\n\nI created a layer of only 8 points from a wildlife survey. A few points have become less relevant, so I want to hide them from the display. But I would rather not delete them from the shapefile.\n\nIs there a way to do this? Or do I have to create a new, separate layer of the relevant points?\n",
            "excerpt": "I created a layer of only 8 points from a wildlife <span class=\"highlight\">survey</span>. A few points have become less relevant, so I want to hide them from the display. But I would rather not delete them from the shapefile. &hellip; ",
            "title": "Hiding specific points in shapefile layer"
        },
        {
            "tags": [
                "qgis",
                "attribute-joins",
                "one-to-many"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 155871,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1603439839,
            "creation_date": 1437902864,
            "body": "I am looking for a possibility to make a one-to-many table-join in QGIS.\nI have a shapefile with postal codes and would like to join them with survey results (more than one). In other words, there is a specific postal code (shapefile) on one side and there are many survey participants on the other side.\n\nIf I do a normal join (right click on ) , I just get the first entry of the table with the postal codes.\nI found out a way to do it ArcGIS with the tool , but I&#180;m looking for a possibility to do it in QGIS.\n",
            "excerpt": "In other words, there is a specific postal code (shapefile) on one side and there are many <span class=\"highlight\">survey</span> participants on the other side.\npostal **code1** ----- <span class=\"highlight\">survey</span> participant **1**\npostal **code1** ----- &hellip; <span class=\"highlight\">survey</span> participant **2**\npostal **code1** ----- <span class=\"highlight\">survey</span> participant **3**\npostal **code2** ----- <span class=\"highlight\">survey</span> participant **1**\npostal **code2** ----- <span class=\"highlight\">survey</span> participant **2**\nand so on ... &hellip; ",
            "title": "One-to-many joins in QGIS"
        },
        {
            "tags": [
                "qgis",
                "coordinate-system",
                "parameters"
            ],
            "question_score": 12,
            "is_accepted": true,
            "answer_id": 45464,
            "is_answered": false,
            "question_id": 45456,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1357746129,
            "creation_date": 1357622359,
            "body": "You can see the proj string used by QGIS to transform from and to WGS84 when you look at \n\n, CRS tab, and search for the EPSG code or name of a CRS. All CRS are referenced by their EPSG code, or user defined CRS.\n\nUusally, all EPSG-codes are bundled with one certain transformation to WGS84 which was decided to be most appropriate. American NAD27 CRS are the only ones which use a ntv2 grid by default instead of three- or seven-parameter Helmert transformation.\n\nIf you are unhappy with the accuracy of a defined transformation, you can define a custom CRS with different +towgs84 parameters.\n\n\n\nEDIT\n\nFor your Lisbon datum example, which is a projection of EPSG:4207, the EPSG database offers several transformation parameters which can be found in http://svn.osgeo.org/gdal/trunk/gdal/data/datum_shift.csv:\n\n\n  214,1656,4207,4326,&quot;Parameter values from Lisbon to ETRS89 (1) (code\n  1655). Assumes ETRS89 and WGS 84 can be considered the same to within\n  the accuracy of the transformation. Replaced by Lisbon to WGS 84 (4)\n  (code 1988).&quot;,For applications to an accuracy of 3\n  metres.,1294,36.96,42.15,-9.55,-6.19,1,0,9606,\n  -280.9,-89.8,130.2,-1.721,0.355,-0.371,-5.92,0\n  \n  215,1944,4207,4326,&quot;Parameter values from Lisbon to ETRS89 (2) (code\n  1790). Assumes ETRS89 and WGS 84 can be considered the same to within\n  the accuracy of the transformation.&quot;,For applications to an accuracy\n  of 2 metres.,1294,36.96,42.15,-9.55,-6.19,1,1,9606,\n  -282.1,-72.2,120,-1.592,0.145,-0.89,-4.46,0\n  \n  216,1984,4207,4326,,For low resolution\n  applications.,1294,36.96,42.15,-9.55,-6.19,1,0,9603,\n  -304.046,-60.576,103.64,,,,,1\n  \n  217,1988,4207,4326,,For medium resolution\n  applications.,1294,36.96,42.15,-9.55,-6.19,1,0,9607,\n  -288.885,-91.744,126.244,1.691,-0.41,0.211,-4.598,0\n\n\nSo you see, that the low resolution transformation with three parameters is used in your example.\nIt is stored in http://svn.osgeo.org/gdal/trunk/gdal/data/gcs.csv under code 4207 and used by Qgis and other GIS software depending on proj.4.\n\nhttp://www.epsg-registry.org/ gives an accuracy of 5 metres for EPSG:1984 (note that transformations have their own code numbers). These values were first published by NIMA when WGS84 was introduced.\nBut its not what the local surveying authority recommends. You can also have a look at http://www.fc.up.pt/pessoas/jagoncal/coordenadas/index_en.htm\n\nIf you want it more accurate, try the ntv2 grid from http://www.igeo.pt/produtos/geodesia/Grelhas_NTv2.htm\n",
            "excerpt": "But its not what the local <span class=\"highlight\">surveying</span> authority recommends. &hellip; ",
            "title": "How can I see the coordinate transformation parameters in QGIS?"
        },
        {
            "tags": [
                "cartography",
                "printing",
                "maps"
            ],
            "question_score": 25,
            "is_accepted": false,
            "answer_id": 3344,
            "is_answered": false,
            "question_id": 3336,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1289327112,
            "creation_date": 1289327112,
            "body": "I remember being taught that a north arrow must be present always except in few specific cases, which actually cover 99% of maps.\n\nYou typically do not need a north arrow when:\n\n\nthere is a geographic grid present\nthe map presents a well known area to the map user, e.g. the map of the world, Europe, or your whole country on one sheet\nthe map is part of a larger map set or atlas with given standardised orientation; typically this applies to maps produced by national survey offices etc.\n\n",
            "excerpt": "the map of the world, Europe, or your whole country on one sheet\nthe map is part of a larger map set or atlas with given standardised orientation; typically this applies to maps produced by national <span class=\"highlight\">survey</span> &hellip; ",
            "title": "Are North Arrows Pointless?"
        },
        {
            "tags": [
                "qgis",
                "coordinate-system",
                "epsg",
                "ordnance-survey"
            ],
            "question_score": 3,
            "is_accepted": false,
            "answer_id": 68402,
            "is_answered": false,
            "question_id": 68399,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1684851589,
            "creation_date": 1376250942,
            "body": "KML files are always WGS 84/lon lat (http://www.opengis.net/def/crs/OGC/0/LonLat84). Save the KML file as an EPSG:27700 shapefile instead.\nAlternatively, you could download the Ordnance Survey OpenData Boundary-Line dataset, which is already in EPSG:27700. See:\nhttps://www.ordnancesurvey.co.uk/opendatadownload/products.html\n",
            "excerpt": "Alternatively, you could download the Ordnance <span class=\"highlight\">Survey</span> OpenData Boundary-Line dataset, which is already in EPSG:27700. See:\nhttps://www.ordnancesurvey.co.uk/opendatadownload/products.html &hellip; ",
            "title": "Converting .kml to different projection in QGIS"
        },
        {
            "tags": [
                "qgis",
                "point"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 49153,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1593987690,
            "creation_date": 1359236614,
            "body": "I want to map a tree survey. I am thinking that I will plot positional points of the trees and then add other data like tree type etc. to the attribute table later.\nIs there a way I can have an attribute that describes a radius or diameter, whichever is easier, of a circle round the point?\nIn fact I need two circles, one to describe the canopy radius/diameter and another to do the same for the root protection area.\nI am using QGIS 1.8.0\n",
            "excerpt": "I want to map a tree <span class=\"highlight\">survey</span>. I am thinking that I will plot positional points of the trees and then add other data like tree type etc. to the attribute table later. &hellip; ",
            "title": "Creating different diameter circles round points using QGIS"
        },
        {
            "tags": [
                "dem",
                "elevation",
                "united-kingdom",
                "data"
            ],
            "question_score": 7,
            "is_accepted": true,
            "answer_id": 75984,
            "is_answered": false,
            "question_id": 75980,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1445954113,
            "creation_date": 1383152353,
            "body": "OS Terrain 50 contours (10m contours) for Great Britain (England, Scotland and Wales)\n\n\n  It is supplied both as a set of 50m gridded digital terrain model (OS\n  Terrain 50 grid) and 10m contours and spot heights (OS Terrain 50\n  contours).\n\n\nNotice: OS Terrain 50 contours and OS Terrain 50 grid are now available as of 8th July 2013.\n\nTip: Opt for the OS Terrain 50 - ESRI SHAPE (CONTOURS) - GB\n\nhttp://www.ordnancesurvey.co.uk/business-and-government/products/terrain-50.html\n\nUpdate: 27th October 2015.\nWith a lot of processing it is possible to get even more detailed elevation data (for England currently) from Environmental Agency Opendata LiDAR example http://environment.data.gov.uk/ds/survey#/download?grid=TL45 has 1m res LiDAR which heights of features (including the ground) can be extracted.\n\nA Example of the contours created from LiDAR are here http://relief.raggedred.net/#18/53.76828/-0.36981 (Layers button &#39;contours&#39;) and zoom in.\n",
            "excerpt": "With a lot of processing it is possible to get even more detailed elevation data (for England currently) from Environmental Agency Opendata LiDAR example http://environment.data.gov.uk/ds/<span class=\"highlight\">survey</span>#/download &hellip; ",
            "title": "What is the highest obtainable resolution of FREE elevation data in the UK?"
        },
        {
            "tags": [
                "career"
            ],
            "question_score": 5,
            "is_accepted": true,
            "answer_id": 9409,
            "is_answered": false,
            "question_id": 9408,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1562213155,
            "creation_date": 1304795588,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\nCareer advice is best provided individually and, since the aim of the Main site of GIS SE is to maximize re-use of its answers, it should not be sought here.  However, once you have attained a reputation of 20 you are free to seek career advice in our GIS Chat Room.\n\n\n\nA good way to get your hands dirty is to contribute to one of the many FOSS projects out there. For instance, there are over 600 bugs in the QGIS database. It also has a good plugin architecture, so if you can think of something that hasn&#39;t been covered, then write and contribute your own plugin. I&#39;m on the developer mailing list, and they&#39;re a good bunch of people always on the lookout for people willing to contribute.\n\nHave a look at the OSGEO website which has a number of open source projects under its auspices that you could contribute to, which gives you a chance to find an area you&#39;re interested in. In fact, as you&#39;re educated to degree level, it would be a good idea to start thinking about concentrating on a few areas of expertise - do you want to deal with database programming, cartography, or like me combining my degree in archaeology with my love of all things maps and programming to advance the use of GIS in archaeology.\n\nA possibility might be to see if your national mapping agency is hiring. I worked for the Ordnance Survey in the UK as a GIS programmer with no prior GIS experience apart from a love of maps.\n\nAs for colleges, it depends on which country you&#39;re in and whether you&#39;re willing to move. In the UK, Leeds, Edinburgh, and Sheffield, to name just a few, have GIS courses, but they tend to be part of a more general geography degree.\n\n\n\n&#39;Making sure that you understand geodesy..to me..the kind of ideas underpinning GIS is paramount.  I have taken trigonometry and an assorted list of math curriculum.  Please correct me if I am wrong, I think Trigonometry is important in GIS programming for figuring out route and relationships between GIS data..for example, if the user picks a point and then wants to create the nearest point on all lines in a line dataset in relation to that point...programmatically...\n\n\n\nIn Canada, Fleming College, Centre of Geographic Sciences (COGS) and BC Institute of Technology (BCIT) are good choices. All I would recommend beyond the scope of what you&#39;ll absorb in a post-grad is that you familiarize yourself with a greater range of open-source software. Mostly you&#39;ll learn using the ESRI suite, which is licensed to colleges free I believe, but many in the industry will opt to avoid the licensing fees or they like to juggle different software. Job postings frequently mention FME, PostGIS, Geoserver, etc.\n\nOne more thing. Even with a programming focus, you would do well to create a portfolio with some stellar maps. The industry cites map-production skills frequently. \n\nThe demand for fresh, skilled GIS workers does not seem great anymore though.\n",
            "excerpt": "I worked for the Ordnance <span class=\"highlight\">Survey</span> in the UK as a GIS programmer with no prior GIS experience apart from a love of maps. &hellip; ",
            "title": "Seeking GIS career advice?"
        },
        {
            "tags": [
                "data",
                "census"
            ],
            "question_score": 6,
            "is_accepted": true,
            "answer_id": 12561,
            "is_answered": false,
            "question_id": 12559,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1311635318,
            "creation_date": 1311404053,
            "body": "You want to assemble a nationwide set in one file? For how many variables?\n\nThere are a few hoops to get over to actually connect the STFIDs in your shapefile with the data. I couldn&#39;t read if your primary problem is decoding the naming schemes of the files and figuring out what is in each, or if it was about relating the primary keys of the shape file and data files. At any rate, here is one way. I must say that I refer to the ACS 2005-2009 sample, but it seems the structure is analogous:\n\n\nGet the data file. Sounds like you downloaded the entire nationwide dataset? The one you refer to is from ACS 2009, Alaska, segment 0001 (because there are so many fields in the ACS summary file, the bureau segments them into more than 100 separate files for the estimates and 100 additional files containing margins of errors. These files have an &quot;m&quot;-prefix (for each state).\nYou will need the table headers, too. For ACS they are stored in xls files.\nSTFID is one way to uniquely refer to a block group. Another is LOGRECNO, which is the field actually found in the data files. You need to relate that using one of the geo files (also xls). For instance, the california one is here. STFID is a shorter version of column C (the last 15 or so characters; don&#39;t remember the exact number for block groups, but it identifies a two digit code for state, a three digit code for county, a six digit code for tract, and a (I think) four one digit code for block group). For example, a block group in San Francisco would be 060750101001  or so.\nIf you are only interested in a handful of variables it is a lot easier just to fetch those tables from American Factfinder. I think most ACS surveys are now on factfinder2.\nlastly, when I was dealing with this, I found this document useful, albeit for the five year sample. This one is available for the 1-year sample.\n\n",
            "excerpt": "You want to assemble a nationwide set in one file? For how many variables?\n\nThere are a few hoops to get over to actually connect the STFIDs in your shapefile with the data. I couldn&#39;t read if your pr &hellip; ",
            "title": "Help using the US American Community Survey Data"
        },
        {
            "tags": [
                "polygon",
                "circle"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 54727,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1363640157,
            "creation_date": 1363558086,
            "body": "I am trying to work out an algorithm for creating the maximum radius circle within an irregular polygon (a census tract) based on a given center of the circle.\n\nThe motivation for this is to obscure the location of an individual who has answered a survey. Their actual location is known, however it needs to be obscured in the analysis, in order to release the data to the public, for further analysis.\n\nWe want to have a donut shaped polygon for each survey respondent that has some inside radius (easy), bounded by an outside radius that is constrained by the census tract that the individual is in. Their final location will be randomly placed within the donut polygon.\n\nI have seen many answers to similar questions here, but not this specific one, which in this case starts with a SPECIFIC location.\n\nOnce we have the donut established, we can randomize the location of the individual response within the polygon. That&#39;s relatively easy... \n\nThanks for your ideas, mine so far have seemed pretty brute force, and computationally &quot;expensive&quot; or inefficient... \n",
            "excerpt": "The motivation for this is to obscure the location of an individual who has answered a <span class=\"highlight\">survey</span>. &hellip; We want to have a donut shaped polygon for each <span class=\"highlight\">survey</span> respondent that has some inside radius (easy), bounded by an outside radius that is constrained by the census tract that the individual is in. &hellip; ",
            "title": "maximum circle inside an irregular polygon from a random point"
        },
        {
            "tags": [
                "postgis",
                "data",
                "3d",
                "model"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 34197,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1358982280,
            "creation_date": 1348563529,
            "body": "We have features from survey data that contain partial 3d information. \n\nThe most common example would be a 2D LineString representing a road, that contains elevation information in certain points where it was surveyed. Other examples include roof shapes - A MultiLineString where some key points have an assigned elevation from the building plan, but not all.\n\nUsing PostGIS, which data model would you recommend to store this kind of information, to keep it as accessible as possible, without losing or generating interpolated information? \n",
            "excerpt": "We have features from <span class=\"highlight\">survey</span> data that contain partial 3d information. &hellip; ",
            "title": "How do you treat partial 3d features in PostGIS?"
        },
        {
            "tags": [
                "qgis",
                "latitude-longitude",
                "polygon-creation"
            ],
            "question_score": 7,
            "is_accepted": false,
            "answer_id": 303409,
            "is_answered": false,
            "question_id": 303378,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1543228863,
            "creation_date": 1542757940,
            "body": "To give an example according to @geom recommendation. You must use the syntax to define polygons in WKT format,  here an example in CSV:\n\n\n\nFinally use add delimited text data source:\n\n\n\nWith the following result:\n\n\n\nTo edit the question to provide an example of where I need to create a polygon via distances. \n\nI need to create a polygon to represent a survey area. The survey area required is 3.58km x 3.0km. I have used the  and the  tool. Which I select a certain point to buffer Around to create the survey area. However I cant find any input within these tools where I can enter such distances. Do you know how to fix this?\n",
            "excerpt": "I need to create a polygon to represent a <span class=\"highlight\">survey</span> area. The <span class=\"highlight\">survey</span> area required is 3.58km x 3.0km. I have used the v.buffer GRASS tool and the Buffer tool. &hellip; Which I select a certain point to buffer Around to create the <span class=\"highlight\">survey</span> area. However I cant find any input within these tools where I can enter such distances. Do you know how to fix this? &hellip; ",
            "title": "Creating polygon using coordinates"
        },
        {
            "tags": [
                "qgis",
                "clip",
                "modis"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 366822,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1661120325,
            "creation_date": 1593869502,
            "body": "I have calculated the dnbr for a fire season across a whole region, and I&#39;ve clipped it using a mask.\nThe mask is a layer of ground survey plot locations because I want to find out the dnbr for each plot. Each plot has a number under the field &#39;ID&#39;. I have clipped the dnbr to each plot location but has returned (over 100 of) these new clipped files as &#39;new_clip&#39;and a number irrelevant to the plot number. So I can&#39;t see which dnbr matches to which plot. I would like the new clipped files to look something like &#39;ID_247_clip&#39;.\nI&#39;ve done this via : input is Whole Region dNBR, overlay is plot locations. Then I&#39;ve clicked the  button. It gives me exactly what I need, just with the wrong title for the clipped layers.\nIs there a way to program the clip to name each layer according to the plot numbers in the ID field?\nI&#39;ve tried executing in batch mode but this doesn&#39;t work, as I only have one input and one overlay layer, whereas bulk seems to work for multiple input layers.\nAlso, a lot of the plot locations overlap, so I can&#39;t do anything like join by location.\n\n",
            "excerpt": "The mask is a layer of ground <span class=\"highlight\">survey</span> plot locations because I want to find out the dnbr for each plot. Each plot has a number under the field &#39;ID&#39;. &hellip; ",
            "title": "Naming clipped layer according to the attributes of the mask layer in QGIS"
        },
        {
            "tags": [
                "qgis",
                "convert",
                "gps",
                "format",
                "files"
            ],
            "question_score": 4,
            "is_accepted": true,
            "answer_id": 290285,
            "is_answered": false,
            "question_id": 290274,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1532628320,
            "creation_date": 1532309322,
            "body": "Those files are Receiver Independent Exchange Format (RINEX). Which is an open source standard for raw satellite navigation system data. For more information about the file format standards refer to this document. That document is quite thorough but a (very) brief description of the files:\n\n\n18 in the file extension refers to two digit year the data was collected in.\n*o is an observation file. The meat of the data this contains the raw observable(s) collected in the field (C/A code, P or Y code, L1 and L2 or time, phase and range).\n*n is a navigation file.\n*g is a GLONASS navigation file.\n*m is a meteorological data file.\nRINEX files are ASCII based files so you can open them with any text editor, although there is not much you can do without processing the files further.\n\n\nWithout knowing what your task is it is difficult to say how you should work with this data but one common way would be to upload your observation file (18o) to the National Geodetic Survey (NGS) Online Positioning User Service (OPUS) to solve for the solution of the observables in the file. Even though your data is from Ireland according to this article from GPS World OPUS can still process data collected outside the US if it meets certain requirements.\n",
            "excerpt": "Without knowing what your task is it is difficult to say how you should work with this data but one common way would be to upload your observation file (18o) to the National Geodetic <span class=\"highlight\">Survey</span> (NGS) Online &hellip; ",
            "title": "What file format has 18n, 18g and 18o file extensions?"
        },
        {
            "tags": [
                "qgis",
                "shapefile",
                "dissolve",
                "simplify",
                "file-size"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 222976,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1542135763,
            "creation_date": 1483307048,
            "body": "I&#39;m having real problems cleaning up and reducing the size of a Shapefile which is published by the UK&#39;s Environment Agency. \n\nIt shows the extents of the LiDAR open data they publish: each polygon is a survey flight, and there are fields for the resolution, the date of the flight and so on.\n\nEventually I&#39;d like to end up with a dissolved (merging all features) and simplified Shapefile which is much smaller in size. At the moment:\n\n\nThe .shp is 360.6MB\nThe .dbp is 26.9MB\nThere are 121,753 polygons\n\n\nI think one of the reasons the file is so large is that there are many small &#39;specks&#39; of data (which aren&#39;t important for my purposes):\n\n\n\nWhat I&#39;ve tried so far:\n\n\nDissolving with QGIS: this seemed to make no progress on such a big file so I cancelled it after a while\nDissolving with OGR (): after a few hours I would get an error like this:  – I guess this will just be the first of many errors\nCleaning the Shapefile, first with QGIS&#39;s Check Geometry Validity, then with GRASS&#39;s v.clean (I tried bpol), but the cleaned file still fails dissolve (I also tried adding a zero buffer)\nConverting the multipart polygons to singleparts, adding a geometry column and removing features smaller than a certain area. This took about 100MB off the filesize, but didn&#39;t affect the &#39;holes&#39; within polygons – to get rid of those I tried to make a difference layer, but the difference operation consistently fails (if I check ignore invalid geometry, it creates lots of features which are visible in the attribute table, but doesn&#39;t display them).\n\n\nI will simplify the file in the end, but don&#39;t want to do this before dissolving in case I introduce slivers.\n\nShould I use a different tool within v.clean? \n\nI have not yet tried to split the file into regions and dissolve those, then dissolve the regions. \n",
            "excerpt": "It shows the extents of the LiDAR open data they publish: each polygon is a <span class=\"highlight\">survey</span> flight, and there are fields for the resolution, the date of the flight and so on. &hellip; ",
            "title": "Cleaning large Shapefile using v.clean in order to dissolve features?"
        },
        {
            "tags": [
                "python",
                "arcpy",
                "education",
                "land-survey",
                "teaching"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 56822,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1484224308,
            "creation_date": 1364698642,
            "body": "Does anyone have any good examples of using Python to automate or simplify common surveying tasks? \n\nI&#39;m teaching a Python/ArcPy lab this week for a GIS class.  There are a number of surveying students in the class that think GIS is largely a waste of their time, and are only taking the course because it&#39;s required.  I want to give them something to be excited about.  \n\nA little context: Most of the students will probably be working for forestry or title companies when they graduate, and we are in Arkansas, so almost everything around here is based on PLSS.  So far, my thoughts are showing them the angular math functions and mentioning the couple of free Python-based CAD programs.  I&#39;ve also learned there is a project to write a plugin for AutoCAD that provides a Python interface.  \n\n\n\nI&#39;ve already taught the class, and as expected, the surveyors weren&#39;t too thrilled.  I&#39;d still love to hear any good examples of using Python to facilitate surveying.\n",
            "excerpt": "Does anyone have any good examples of using Python to automate or simplify common <span class=\"highlight\">surveying</span> tasks? \n\nI&#39;m teaching a Python/ArcPy lab this week for a GIS class. &hellip; I&#39;d still love to hear any good examples of using Python to facilitate <span class=\"highlight\">surveying</span>. &hellip; ",
            "title": "Teaching Python to Land Surveyors"
        },
        {
            "tags": [
                "interpolation"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 24501,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1359722281,
            "creation_date": 1335869316,
            "body": "This is my first post here.\n\nI have some points from a soil depth survey and I need to interpolate the depth for a whole area.  What is the most appropriate technique for this and is there anything I need to take into account when using the technique?  A pointer to a tutorial would be brilliant!\n\nThanks\n",
            "excerpt": "I have some points from a soil depth <span class=\"highlight\">survey</span> and I need to interpolate the depth for a whole area. &hellip; ",
            "title": "What is the best technique for interpolating soil depth from sample points"
        },
        {
            "tags": [
                "postgis",
                "raster"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 15005,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1317381078,
            "creation_date": 1317047988,
            "body": "I have a requirement to store and manage archaeological geophysics data that is collected as a rectangular array of samples -- a raster image.\n\n\nEach raster will usually 20x20 or 30x30 floating-point samples, typically sampled at 1m intervals.\nA survey will consist of one or more of these images in a given location.\nIt is possible that two different surveys may take place in different countries, or areas that use different projections, but each survey will use one and only one projection. \nThey&#39;re never likely to be viewed together, each survey will usually sit by itself.\nThe data will only be accessed by a custom front-end, so there will be no users getting direct control of it through  or similar.\nEach sample needs to be stored as it was collected, so I can&#39;t reproject it into a common CRS such as Web Mercator because one sample could end up covering more or less area than in the original projection, and analysis will need to be performed on the data.\n\n\nHow should I best store the data in a PostGIS Raster database? The options I have come up with are:\n\n\nIgnore SRID constraints and store all the data in one table, writing my front-end code to deal with manipulating the data in a consistent manner.\nStore all the data in one table, and rewrite the SRID constraint as a compound of SRID and survey ID.\nThrough table inheritance, create a new table for each new SRID.\nThrough table inheritance, create a new table for each survey.\n\n\n1 and 2 break some of the nice automated parts of PostGIS, but will be otherwise hidden in front-end code. But queries will probably take slightly longer.\n\n3 and 4 could end up with an explosion of tables that would make it harder to manage FK constraints and so on.\n\nPractically, the number of rasters per survey is anywhere from 1 to 100 or more, and the number of surveys is likely to run into the hundreds. But the number of distinct projections is likely to remain very low, which favours 3.\n",
            "excerpt": "A <span class=\"highlight\">survey</span> will consist of one or more of these images in a given location. &hellip; They&#39;re never likely to be viewed together, each <span class=\"highlight\">survey</span> will usually sit by itself. &hellip; ",
            "title": "How should I manage PostGIS Raster data with different projections?"
        },
        {
            "tags": [
                "qgis",
                "raster",
                "geotiff-tiff",
                "esri-ascii-raster"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 115024,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1580551629,
            "creation_date": 1411579449,
            "body": "I&#39;m using a special system to do geomagnetic surveys. The software let&#39;s me output the information as image files, ASCII grid or in its own proprietary file format.\n\nNow I want to get its information in my GIS (using QGIS). I can of course import the exported image files but I would love to import the raw data to play around with the visualisation a bit more, not depending on the original software.\n\nThe files look like this:\n\n\n\nand so on..... (looooong file ;) )\n\nEvery 0.05 cm movement on X and Y contains a data value, positive and negative.\n\nI want to convert this data into a raster file, a pixel for every data value.\nMy goal is to tune the visualisation comparable to a DEM TIFF file in my QGIS project, without having the problem to export this through the original software every time.\n\nWhat would be the best way to do this?\n\nI think GDAL is the program to use I need some help. Perhaps there is even a way to do this in QGIS?\n\nUpdate:\n\nSo I finally imported a fraction of my data, sorting everything to Y.\nSaving everything as TIFF wasn&#39;t a problem as well. Now my next step is to get this spatially correct data (in terms of length) into my project. The coordinates in the file are just a local project oriented coordinate system.\n\nGeoreferencing the created TIFF wasn&#39;t a big problem but it results in a little annoying problem. after georeferencing my perfect square gets rotated a bit, resulting in big nodata areas. \n\nMy data also contains positive as well as negative data and even zero is important.\n\nI couldn’t find a way to get this nodata area to disappear, QGIS  georeferencing gives it a value that is contained in the data areas as well.\nif I set this to transparency my raster files gets some annoying holes.\n",
            "excerpt": "I&#39;m using a special system to do geomagnetic surveys. The software let&#39;s me output the information as image files, ASCII grid or in its own proprietary file format.\n\nNow I want to get its information  &hellip; ",
            "title": "Create a Raster file out of a ASCII grid file?"
        },
        {
            "tags": [
                "qgis",
                "flow-map"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 160350,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1603959692,
            "creation_date": 1441062926,
            "body": "I have several records from a survey and would like to show flow map from places mentioned in the survey. I have all places mentioned georeferenced and some records mentioned no places and others mentioned up to 16 places.\nI made a graphic so I can make myself clearer.\n\n",
            "excerpt": "I have several records from a <span class=\"highlight\">survey</span> and would like to show flow map from places mentioned in the <span class=\"highlight\">survey</span>. &hellip; ",
            "title": "Creating flow maps in QGIS"
        },
        {
            "tags": [
                "gis-principle",
                "terminology",
                "m-values"
            ],
            "question_score": 17,
            "is_accepted": true,
            "answer_id": 285318,
            "is_answered": false,
            "question_id": 285316,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1623649823,
            "creation_date": 1528241618,
            "body": "It is a measured distance along a route. A mile marker along a highway that is nominally 10.1 miles from some start (such as where the route crosses into a county) may not be exactly 10.1 miles. Someone surveys where certain landmarks, mile markers, or buildings are along the route exactly. These route events get an M value representing their measured location. A route feature has both its line and its measured locations, and other events, along it. A measured distance along a line has many uses, such as route planning.\nMeasured distance points can also be used to improve linear referencing. Some points that have been located exactly can be given higher weight, so that they have more influence on where new geocoded points are placed along a line. This is very important on long lonesome stretches of highway where there is not much to geocode from.\n",
            "excerpt": "It is a measured distance along a route. A mile marker along a highway that is nominally 10.1 miles from some start (such as where the route crosses into a county) may not be exactly 10.1 miles. Someo &hellip; ",
            "title": "What does M-value represent?"
        },
        {
            "tags": [
                "viewshed",
                "visibility",
                "dem"
            ],
            "question_score": 2,
            "is_accepted": true,
            "answer_id": 170357,
            "is_answered": false,
            "question_id": 170348,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1447662917,
            "creation_date": 1447660710,
            "body": "Your choice of DSM vs DTM will depend on whether there is best-practice guidance or regulations governing the planning process for which you are performing the calculation.  \n\nFor instance, Viewshed Analysis for planning in the UK, especially for windfarms, requires that you use DTM data (and specifically Ordnance Survey data).  Analysis with DSM may be used as a supplementary presentation to demonstrate the screening effect of buildings and trees but a &#39;bald Earth&#39; calculation is the standard requirement.  The reason for this is that screening is rarely total and, in deciduous woodland areas, is also seasonal. On top of that trees can be cut down and buildings demolished.\n\nThis is why the phrases &#39;Zones of Theoretical Visibility&#39; (ZTV) or &#39;Zones of Visual Influence&#39; (ZVI) are used in many countries&#39; planning systems to describe the output of &#39;bald Earth&#39; (DTM) viewshed analysis, as it is the worst-case potential impact that is being measured.\n\nYou can only answer your question by reading the planning regulations that pertain to your country, state or province.   While we are on the subject, the relevant planning regulations will almost certainly also specify the resolution of data required.  If you are in doubt, my advice is to use a 10m resolution and present both a worst-case (DTM) and current-reality (DSM) viewsheds with a radius of 15km (for structures up to 50m).  Then describe/show the differences in a narrative or 3rd map.\n\nAs it is unlikely you are going to use a 0.5m resolution DTM over a radius of 10km plus, a further problem with trying to calculate &#39;true viewsheds&#39; is that small/thin features such as walls and hedges may well either not be represented at all in the DSM or be over-stated in some areas.  Any clever planner/lawyer can instantly nullify the validity of your entire DSM-based calculation by an argument based on this fact and suggest that you are claiming a false level of accuracy.  This is another reason why a worst-case analysis is often required because the analysis gives a definite baseline for theoretical visibility within which some screening may be achieved by small structures, eye-height differences etc.  In individual contentious locations you are well advised to preform a line of sight calculation based on site-surveyed data of tree and building heights and present that as profile drawings.\n\nGiven the resolution of your height data and common radii over which the viewshed analysis must normally be run, it therefore only really makes sense to consider large areas/structures such as entire Woodland blocks and towns or villages in a DSM-based calculation.  A common approach for the second part f your question is to perform the calculation normally with a Bald Earth DTM supplemented with DSM data or a simple addition of +15m in woodland areas and +5m for building footprints and then mask these areas in the output (clearly stating that you have done so in notes on the map). The figures of 15m and 5m are deliberately conservative to counter any arguments that your analysis is intentionally disingenuous in its suggestion of screening.  These are just commonly used values.  Whatever value you use will need to be justified.\n\nFinally, 1.5m is a common value for eye height, but then so is 2m.  You can argue the 2m represents a VERY tall person but the logic is again, worst-case scenario with some compensation for terrain inaccuracy.  Again, read your planning guidance because there may be a specific height prescribed which you MUST use.\n",
            "excerpt": "For instance, Viewshed Analysis for planning in the UK, especially for windfarms, requires that you use DTM data (and specifically Ordnance <span class=\"highlight\">Survey</span> data). &hellip; ",
            "title": "Viewshed Analysis - use DSM or DTM?"
        },
        {
            "tags": [
                "installation",
                "windows-7"
            ],
            "question_score": 5,
            "is_accepted": true,
            "answer_id": 2556,
            "is_answered": false,
            "question_id": 2549,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1415814024,
            "creation_date": 1287004157,
            "body": "From the The Surveying, Mapping &amp; GIS blog post blast from the past. (direct download link). You&#39;ll need Windows 3.1 or Windows for Workgroups, though I wouldn&#39;t be surprised if FreeDOS or Wine would work as well (or better!).\n",
            "excerpt": "From the The <span class=\"highlight\">Surveying</span>, Mapping &amp; GIS blog post blast from the past. (direct download link). &hellip; ",
            "title": "Where can I get ArcView 1.0?"
        },
        {
            "tags": [
                "education",
                "career",
                "belarus"
            ],
            "question_score": 15,
            "is_accepted": false,
            "answer_id": 83230,
            "is_answered": false,
            "question_id": 83211,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1389886815,
            "creation_date": 1389882420,
            "body": "Pursuing a MS is dependent upon your goals.  If you are interested in conducting scientific research, a MS (or PhD) is for you.  Having a MS opens doors in academia that would not normally exist with a BS.  For example, these are the education requirements for a mid-level research position in academia:  \n\n\n  Master’s degree (or higher) in remote sensing, GIS, oceanography, or\n  related degree including a strong background in statistics,\n  mathematics, computer science, and/or engineering, and 2 years of\n  experience. \n  \n  OR \n  \n  Bachelor’s degree in remote sensing, GIS, or related\n  science degree including a strong background in statistics,\n  mathematics, computer science, and/or engineering, and 5 years of\n  experience.\n\n\nLooking at the government sector, a MS is virtually required these days unless you have significant experience already.  The following are typical qualifications for a mid-level GIS job with the feds:\n\n\n  FOR THE GS-09 LEVEL, in addition to the educational requirements\n  listed above, applicants must have at least one year or twelve (12)\n  months of specialized experience equivalent to grade level GS-07 that\n  demonstrates:  work performing duties such as providing geographic\n  information systems (GIS) training and support with guidance for\n  resource conservation planning and the integration of GIS and planning\n  tools into daily operations; this would include business tools for a\n  variety of disciplines such as engineering, ecological, etc., and\n  other software applications as assigned; provide support with\n  assistance to state, field, and soil survey offices regarding ArcGIS,\n  soil data viewer, and other GIS software;  OR  applicants must have\n  two (2) years of progressively higher level graduate education leading\n  to a master&#39;s degree or master&#39;s or equivalent graduate degree\n  directly related to cartography.   Equivalent combinations of\n  education and experience are qualifying for this grade level.\n\n\nFor a mid-level private sector job (ESRI Support Analyst), the following requirements are nearly industry-wide:\n\n\n  Requirements:\n  \n  \n  Bachelor’s in GIS, a related field, or equivalent work experience    while using GIS as a primary tool\n  \n  \n  Recommended Qualifications:\n  \n  \n  Master’s in GIS, environmental science, geography, or other relevant    field\n  \n\n\nThe bottom line is a MS will jump start your career, provide increased opportunities and almost certainly yield a higher salary.\n",
            "excerpt": "include business tools for a\n  variety of disciplines such as engineering, ecological, etc., and\n  other software applications as assigned; provide support with\n  assistance to state, field, and soil <span class=\"highlight\">survey</span> &hellip; ",
            "title": "Is a master&#39;s degree needed for a GIS career?"
        },
        {
            "tags": [
                "coordinate-system",
                "parameters"
            ],
            "question_score": 7,
            "is_accepted": false,
            "answer_id": 126552,
            "is_answered": false,
            "question_id": 126546,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1475647710,
            "creation_date": 1418575650,
            "body": "You can put the WKT text into a text file, and run gdalsrsinfo on it:\n\n\n\nThe ellipsoid parameters look very much like , EPSG 4145:\n\n\n\nWhich gives you a 3-parameter transformation to WGS84. But according to the EPSG database the transformation is valid for Pakistan onshore, not India. For India, they suggest EPSG 4146:\n\n\n\nThe ellipsoid is slightly smaller, but the calculated offset is just about 4 centimeters, while the datum shift is given an accuracy of 10 to 25m.\n\nThe official NIMA TR8350.2 on the WGS84 Datum lists the following datums on page B.3-2:\n\n\n\nThe flattening is equal for all. Just to confuse, there are other Datums called &quot;Indian&quot; for Thailand, Cambodia and Vietnam, and Malaysia and Sri Lanka use the Everest ellipsoid as well.\n\nEverest 1956 is defined on page A.1-1 with , just the value you have for Everest 1962. The source notes that the 1956 datum was an adoption of a new yard to meter conversion factor.\n\nSee also this article on the conversion of the Everest 1956 datum: http://www.gisdevelopment.net/technology/ip/ma03037pf.htm\n\nThe article compares surveyed Everest 1956 coordinates with satellite-measured WGS84 coordinates of 11 major airports, and states offsets between measured and calculated WGS84 coordinates by up to 1 arc second (about 30m). The distortion is arbitrary across the country, so a 7-parameter datum shift will not give better values.\n\nThere might have been efforts to get more accurate datum conversions, but the surveying authority is keeping it secret. It might be considered as a case of national security.\n\nSee also http://lists.maptools.org/pipermail/proj/2012-November/006472.html and https://github.com/klokantech/epsg.io/issues/49\n",
            "excerpt": "There might have been efforts to get more accurate datum conversions, but the <span class=\"highlight\">surveying</span> authority is keeping it secret. It might be considered as a case of national security. &hellip; ",
            "title": "Transformation parameters for Everest datum to WGS84"
        },
        {
            "tags": [
                "floating-point"
            ],
            "question_score": 3,
            "is_accepted": false,
            "answer_id": 25184,
            "is_answered": false,
            "question_id": 25169,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1336647677,
            "creation_date": 1336647677,
            "body": "The difference between float4 (32-bit float) and float8 (64-bit float, or double precision) depends on the context of what it is storing and how it is to be used. For many applications, float4 is sufficient, but GIS has particular demands on extra storage precision.\n\nConsider storing UTM coordinates to millimeter precision. You might have a Northing of  measured using fancy survey equipment. Stored as float4, the number truncates to , loosing the millimetres. Stored as float8, the extra digits are preserved (down to the picometre scale). The reason why storing UTM coordinates is challenging, requiring double precision storage, is that they are typically on the order of hundreds of thousands to millions in scale.\n",
            "excerpt": "You might have a Northing of 4833438.204 measured using fancy <span class=\"highlight\">survey</span> equipment. Stored as float4, the number truncates to 4833438, loosing the millimetres. &hellip; ",
            "title": "Floating point: understanding their inaccuracy"
        },
        {
            "tags": [
                "google-maps",
                "web-mapping",
                "google-earth"
            ],
            "question_score": 6,
            "is_accepted": false,
            "answer_id": 41909,
            "is_answered": false,
            "question_id": 41870,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1353657070,
            "creation_date": 1353657070,
            "body": "There are 3 possible reasons what could have happened:\n\n\nThere was actually an island at that location, and is not longer present. The possibility of this is remote.\nThis could have been a Copyright Easter egg. This is mis-information that is put in a map, so that when someone copies it, you can use it as a red flag to indicate that copying took place. See this page for more examples. http://wiki.openstreetmap.org/wiki/Copyright_Easter_Eggs\nIt was an error. This could have been due to various reasons, as sinister as an unscrupulous survey company, who didn&#39;t actually survey the area, to something as simple, as it was copied from an old map that had a printing error.\n\n\nThis situation is an illustrative example of just how important metadata is, and how it should be maintained and saved when merging data from various sources.\n",
            "excerpt": "This could have been due to various reasons, as sinister as an unscrupulous <span class=\"highlight\">survey</span> company, who didn&#39;t actually <span class=\"highlight\">survey</span> the area, to something as simple, as it was copied from an old map that had a printing &hellip; ",
            "title": "Why do some maps show Sandy Island?"
        },
        {
            "tags": [
                "data",
                "lidar",
                "canada",
                "business",
                "land-survey"
            ],
            "question_score": 9,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 115543,
            "item_type": "question",
            "score": 9,
            "last_activity_date": 1488372828,
            "creation_date": 1412007953,
            "body": "My organization is considering hiring a company to capture new LiDAR data to help with current stormwater issues that we are currently experiencing. I am a GIS analyst that has been assigned with this task.\n\nOur current quote is for roughly 70 square km and the project deliverables will include:\n\n\n1m resolution orthophoto TIFF imagery. \n50cm resolution orthophoto TIFF imagery. \nTiled 11cm resolution orthophoto TIFF imagery - each image\ndelivered in ATS sections.\nLiDAR data collected with approximate 7 points per sq meter.\nRaster bare earth DEM produced from the LiDAR data. Two files will be delivered:\n\n\n1 - 50cm grid spacing. \n1 - 1m grid spacing.\n\n6 new survey checkpoints.\n\n\nWe have been quoted roughly $30000 CAD (canadian dollars). \n\n\nIs cost of new LiDAR data reasonable for deliverables provided?\nWhat else should be considered when hiring aerial LiDAR survey?\n\n\nAny feedback would be great. I have never had the luxury of being included in data purchases so this is all new to me.\n",
            "excerpt": "Two files will be delivered:\n\n\n1 - 50cm grid spacing. \n1 - 1m grid spacing.\n\n6 new <span class=\"highlight\">survey</span> checkpoints.\n\n\nWe have been quoted roughly $30000 CAD (canadian dollars). &hellip; What else should be considered when hiring aerial LiDAR <span class=\"highlight\">survey</span>?\n\n\nAny feedback would be great. I have never had the luxury of being included in data purchases so this is all new to me. &hellip; ",
            "title": "What to consider when hiring aerial LiDAR survey?"
        },
        {
            "tags": [
                "gps",
                "android",
                "mobile",
                "ios"
            ],
            "question_score": 9,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 91437,
            "item_type": "question",
            "score": 9,
            "last_activity_date": 1571143967,
            "creation_date": 1396258730,
            "body": "I&#39;m  currently working in Vietnam as a climbing guide, but am putting my GIS skills to use by doing a side project for the company involving the mapping of climbing routes. Along with another employee who is an app developer, our goal is produce a digital guidebook for the area.\n\nFor this project to work for me, I need to be able to take fairly accurate GPS points, as there are features just a few meters apart from each other that need to be distinguishable, but obviously survey grade equipment is not and option for me here. I&#39;ve been using the app GPS Averaging to take several hundred points for each location.\n\nDespite taking these averages, I&#39;m having very little luck achieving accuracy in my output points, and I suspect my precision is low as well because the in app reported error gets very low (0.8m) after about 20 collected points, then goes up to about 3m after 200-300 collected points. However when I import these points, the actual errors appear to be well beyond 3 meters.\n\nWhat can I do to improve GPS point accuracy from a mobile device?\n\nI&#39;ve currently only worked on this with android devices, but have access to ios devices too if they provide superior GPS chips.\n",
            "excerpt": "For this project to work for me, I need to be able to take fairly accurate GPS points, as there are features just a few meters apart from each other that need to be distinguishable, but obviously <span class=\"highlight\">survey</span> &hellip; ",
            "title": "Capturing accurate GPS points using mobile devices"
        },
        {
            "tags": [
                "qgis",
                "labeling"
            ],
            "question_score": 9,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 129507,
            "item_type": "question",
            "score": 9,
            "last_activity_date": 1423584736,
            "creation_date": 1420708514,
            "body": "I&#39;m a newbie to GIS and QGIS (please be nice to me).  I&#39;m working on a map for a garden/arboretum catalogue using QGIS 2.6.1.  The arboretum has been surveyed using GPS, and the specimen trees and plants become a point layer labelled with a reference number, which points to a description in the main catalogue.\n\nBecause of the site layout and orientation, the map needs to be rotated to fit comfortably on a rectangular canvas (paper, screen).  Fine, I can do that in print composer.  But that rotates the labels too, and for maximum legibility I want them to stay horizontal.\n\nI&#39;ve been experimenting with label placement. &quot;Around point&quot; gives significantly better results than &quot;Offset from point&quot;.  Using this method, the only way I&#39;ve found to apply a compensating rotation to the labels (so that when the map is rotated they end up back horizontal) is to add a &quot;rotation&quot; column to the attribute table and use data defined rotation.  But this to some extent messes up the label placement.  So my first question is:  is it possible to get the placement engine to run (again?) after the labels have been rotated?\n\nIf not, I would like to be able to reposition a few of the labels manually, but leave most of them automatically placed.  But if I add coordinate x and y columns to the attribute table and try to use data defined coordinates, then label rotation stops working if there is a NULL value in either or both of the x and y coordinate columns.  I can&#39;t leave most of the points to be automatically placed and just fix a few - effectively I have to do manual placement for all of them if I want to do it for any of them.  Since there are approx. 200 of the things, that&#39;s a major chore.  Have I missed something?\n\nSome of this might be easier if the &quot;Move label&quot; button would work.  But however I&#39;ve fiddled - with editing on/off, data defined placement on/off and so on - I&#39;ve never seen the thing not greyed out.  What do I need to do to get this working?\n\nThe best I&#39;ve been able to do is have a data defined distance override for some points.  This is rather hit and miss, because there&#39;s not much control over where the label will actually go, and it has unpredictable knock-on, domino effects on other labels some of which may end up worse than they were before.  But it doesn&#39;t affect label rotation.\n",
            "excerpt": "I&#39;m a newbie to GIS and QGIS (please be nice to me).  I&#39;m working on a map for a garden/arboretum catalogue using QGIS 2.6.1.  The arboretum has been surveyed using GPS, and the specimen trees and pla &hellip; ",
            "title": "Label placement on rotated map in QGIS"
        },
        {
            "tags": [
                "qgis",
                "coordinate-system"
            ],
            "question_score": 5,
            "is_accepted": false,
            "answer_id": 40533,
            "is_answered": false,
            "question_id": 40461,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1689030499,
            "creation_date": 1352293651,
            "body": "There was a lot of discussion on that lately:\nOSGB36 to WGS84 reprojection &#39;error&#39;\nhttp://osgeo-org.1560.n6.nabble.com/OSGB-coordinates-to-WGS84-lat-lon-problem-td4965339.html\nhttps://stackoverflow.com/questions/1426941/proj-4-library-and-osgb36\nIf you want it very exact, use the +nadgrids and .gsb file mentioned. Here I gave some command line examples: How to reproject a raster file in QGIS with datum transformation?\nIf you want your data to fit to each other, always use the same +towgs84 instead of +datum.\nIn your case, update the GDAL to 1.9.2.\nFor clarification: the ellipsoids airy and WGS84 do not match exactly. Therefore the +towgs84  parameters were invented. But these even change across the country. The +nadgrids takes this into account.\n\nJust to explain a bit deeper:\nEPSG:27700 is originally only a definition for the projection and ellipsoid used. Datum shift transformations from one ellipsoid to another are listed seperately by EPSG, with their own EPSG codes. There are several transformations available from OSB1936 to WGS84, depending on the region or wanted accuracy. These are:\n\nthe official grid datum can be obtained here: http://www.ordnancesurvey.co.uk/business-and-government/help-and-support/navigation-technology/os-net/ostn02-ntv2-format.html\nThe three-parameter-transformations were published by NIMA in the last century calculated from measuring of a handfull of satellite stations, while the seven parameters are published by Ordnance Survey more recently.\nSo depending on the GDAL version a raster is georeferenced with, you might get an offset, or might not.\n\nrelief is on the way:\nhttp://trac.osgeo.org/gdal/changeset/25589\nSo there is a good chance that the seven-parameter transformation will be back in the next QGIS version.\n",
            "excerpt": "format.html\nThe three-parameter-transformations were published by NIMA in the last century calculated from measuring of a handfull of satellite stations, while the seven parameters are published by Ordnance <span class=\"highlight\">Survey</span> &hellip; ",
            "title": "Raster incorrectly reprojected to OSGB(27700) using QGIS"
        },
        {
            "tags": [
                "qgis",
                "coordinates",
                "vector-grid",
                "grids-graticules"
            ],
            "question_score": 9,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 388067,
            "item_type": "question",
            "score": 9,
            "last_activity_date": 1614028601,
            "creation_date": 1614027026,
            "body": "I need to create grids using QGIS with specific intervals &#39;anchored&#39; to, or beginning at, a specific UTM coordinate. This is for a survey sampling procedure. For example: a point was determined - UTM 0561111, 6111111, as the starting point and I must create a grid with 92m spacing extending north and east for the extent of the polygon. The intersection of those gridlines will be unbiased sample points.\nI can&#39;t seem to &#39;anchor&#39; the grid to the starting point using &quot;Create Grid&quot; or MMQGIS &quot;Create Grid Layer&quot;. I&#39;d like to be able to do this with QGIS 3.4. Here&#39;s a sketch of what is needed.\n",
            "excerpt": "This is for a <span class=\"highlight\">survey</span> sampling procedure. &hellip; ",
            "title": "Creating grid in QGIS &#39;anchored&#39; to specific point"
        }
    ],
    "has_more": true,
    "quota_max": 300,
    "quota_remaining": 299
}