{
    "items": [
        {
            "tags": [
                "qgis",
                "grass-gis"
            ],
            "question_score": 52,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 59964,
            "item_type": "question",
            "score": 52,
            "last_activity_date": 1584642030,
            "creation_date": 1367827806,
            "body": "I was working with GIS and remote sensing in a university and professional environment some ten years ago (ArcInfo etc), so I have some experience even though somewhat outdated. \n\nNow I am looking for an GIS application for a small farming project and I found GRASS and QGIS projects which both sound very interesting.\nHowever, I do not really get the difference between the two programs. \n\nWhich one do I use best for simple thematic maps with different layers?\n",
            "excerpt": "I was working with GIS and <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> in a university and professional environment some ten years ago (ArcInfo etc), so I have some experience even though somewhat outdated. &hellip; ",
            "title": "Choosing between QGIS and GRASS for simple thematic maps with different layers"
        },
        {
            "tags": [
                "references",
                "education"
            ],
            "question_score": 47,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 17227,
            "item_type": "question",
            "score": 47,
            "last_activity_date": 1511762659,
            "creation_date": 1322139500,
            "body": "This Q&amp;A lists free as in $0 workshops in GIS and related fields that have their material available to view or download online. The list is not limited to FOSS GIS, as GISers usually use a combination of open and closed source tools to accomplish their tasks. Some of these tools are easier than others and some are better documented. This list will be a great benefit to the community especially for new comers to the field.\nGeneral GIS\n\nGIS Project Video Tutorial on Acquiring, Analyzing, and Mapping US Census Data in QGIS from @A.S\nGIS Tutor: Beginner / Intermediate Level GIS from @radek\nBostonGIS from @simo\nLectures on GIS for the Social Sciences from @ubernatural\n\nOpen-source GIS\n\nOpenGEO Education Center from @radek\nQGIS Videos (faunitalia) from @simo\nGIS SE Question: Geoserver Tutorials from @com\nGIS SE Question: Open Source Training Materials from @MarkIreland\nQGIS for Newbies from @IanAllan\n\nESRI Products\n\nGIS SE Question: Best place for (structured) ArcGIS tutorials from @robintw\nArcGIS Automation and Programming from @Bethany\n\nTransportation\nThese links include either theoretical or applied transportation knowledge in transportation planning\n\nGIS primer for Transportation\nTransit Capacity and Quality of Service Manual\nUrbanSim: FOSS Urban development, socio economic, and land use planning package\nMOVES(Motor Vehicle Emission Simulator) Workshop and technical background\nTransit GIS tutorials\nRemote sensing in transportation workshop\nFlorida&#39;s CBT planning model explained\n\nDisaster Management\n\nGeo-information Technology for Crisis Management \n\nDatabases\n\nSpatial Database Course Material from @radek\n\nGeo Statistics\n\nLearn R Lectures and Classes\nGeodatabase Mining Course from @radek\nA Practical Guide to Geostatistical Mapping\n\n",
            "excerpt": "Quality of Service Manual\nUrbanSim: FOSS Urban development, socio economic, and land use planning package\nMOVES(Motor Vehicle Emission Simulator) Workshop and technical background\nTransit GIS tutorials\n<span class=\"highlight\">Remote</span> &hellip; <span class=\"highlight\">sensing</span> in transportation workshop\nFlorida&#39;s CBT planning model explained\n\nDisaster Management\n\nGeo-information Technology for Crisis Management \n\nDatabases\n\nSpatial Database Course Material from @radek &hellip; ",
            "title": "Free GIS workshops, tutorials, and applied learning material"
        },
        {
            "tags": [
                "terminology",
                "dem"
            ],
            "question_score": 114,
            "is_accepted": false,
            "answer_id": 5703,
            "is_answered": false,
            "question_id": 5701,
            "item_type": "answer",
            "score": 40,
            "last_activity_date": 1296596760,
            "creation_date": 1296594779,
            "body": "Digital elevation models (DEM) are a superset of both digital terrain models (DTM) and digital surface models (DSM). Remote sensing generally captures the surface height, so the top of the tree canopy or buildings is returned, not the bare ground elevation. If this data is corrected to remove elements which extrude above the terrain height, you&#39;re left with a DTM.\n\nIn general, most people use DEM interchangeably with the other two terms, but it can matter: I once built a hydrology model using SRTM data in South America in very flat arid terrain, but because of the canopy height along the river itself, the true river location became the highest point on the terrain, causing a ruckus.\n\nThe Wikipedia article on digital terrain models also includes some useful background and examples you may find helpful.\n",
            "excerpt": "<span class=\"highlight\">Remote</span> <span class=\"highlight\">sensing</span> generally captures the surface height, so the top of the tree canopy or buildings is returned, not the bare ground elevation. &hellip; ",
            "title": "Differences between DEM, DSM and DTM?"
        },
        {
            "tags": [
                "r",
                "land-classification",
                "random-forest",
                "machine-learning"
            ],
            "question_score": 33,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 39021,
            "item_type": "question",
            "score": 33,
            "last_activity_date": 1571843320,
            "creation_date": 1351738371,
            "body": "This is a follow-up to a previous post: Machine Learning Algorithms for Land Cover Classification.  \n\nIt seems that the Random Forest (RF) classification method is gaining much momentum in the remote sensing world.  I am particularly interested in RF due to many of its strengths:\n\n\nA nonparametric approach suited to remote sensing data\nHigh reported classification accuracy\nVariable importance is reported\n\n\nGiven these strengths, I would like to perform Random Forest land classification using high resolution 4 band imagery.  There is a lot of material and research touting the advantages of Random Forest, yet very little information exists on how to actually perform the classification analysis.  I am familiar with RF regression using R and would prefer to use this environment to run the RF classification algorithm.  \n\nHow do I collect, process and input training data (i.e. based on high resolution CIR aerial imagery) into the Random Forest algorithm using R?  Any step-wise advice on how to produce a classified land cover raster would be greatly appreciated. \n",
            "excerpt": "It seems that the Random Forest (RF) classification method is gaining much momentum in the <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> world. &hellip; I am particularly interested in RF due to many of its strengths:\n\n\nA nonparametric approach suited to <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> data\nHigh reported classification accuracy\nVariable importance is reported\n\n\nGiven these &hellip; ",
            "title": "How to perform Random Forest land cover classification?"
        },
        {
            "tags": [
                "google-earth-engine",
                "layers",
                "google-earth-engine-javascript-api"
            ],
            "question_score": 12,
            "is_accepted": true,
            "answer_id": 304532,
            "is_answered": false,
            "question_id": 304180,
            "item_type": "answer",
            "score": 31,
            "last_activity_date": 1543762810,
            "creation_date": 1543586491,
            "body": "Let&#39;s start from the beginning. \n\nHow satellite remote sensing work\n\nSatellites carry out sensors that can measure radiance at different wavelengths (it depends on the sensor)\n\n\n\nFor example,\n\n\n  Landsat 8 carries a two-sensor payload: the Operational Land Imager\n  (OLI), built by the Ball Aerospace &amp; Technologies Corporation; and the\n  Thermal Infrared Sensor (TIRS), built by the NASA Goddard Space Flight\n  Center (GSFC)\n  (https://landsat.usgs.gov/landsat-8-l8-data-users-handbook-section-2)\n\n\nOLI sensor measures radiance at 9 different wavelengths and TIRS at 2 different wavelengths:\n\n\n\nThe first measurement of the sensor (raw data) is taken in Digital Numbers and converted to radiance based on the rescaling factors provided in the metadata file. \n\nDepending on the sensor, the resulting data type can differ. Landsat 1 to 7 raw data is a 8-bits data (each band), so values can go from 0 to 255 (256 options). Landsat 8 raw is a 16-bit data, so values can go from 0 to 65535 (65536 options).\n\nIf you look the description for  (raw) in Google Earth Engine you&#39;ll see\n\n\n  Landsat 8 Collection 1 Tier 1 DN values, representing scaled,\n  calibrated at-sensor radiance.\n  (https://developers.google.com/earth-engine/datasets/catalog/LANDSAT_LC08_C01_T1)\n\n\nAnd you can check the data types in the code editor: \n\n\n\nRadiometric corrections\n\n\n  The energy that sensors onboard aircrafts or satellites record can\n  differ from the actual energy emitted or reflected from a surface on\n  the ground. This is due to the sun&#39;s azimuth and elevation and\n  atmospheric conditions that can influence the observed energy.\n  Therefore, in order to obtain the real ground irradiance or\n  reflectance, radiometric errors must be corrected for.\n  (http://gsp.humboldt.edu/olm_2015/courses/gsp_216_online/lesson4-1/radiometric.html)\n\n\n\n\nAfter the data has been corrected, the output depends on the process made and may be in a different data type, such as , , etc. (I couldn&#39;t find a good reference source for this).\n\nYou can check it in Google Earth Engine\n\n\n\nAs you can see in the results, Landsat 8 TOA has a  data type, which means that the data goes from 0 to 1, and SR has a  data type, which means that data goes from -32768 to 32767. Though, the latter has a particularity, real values go from 0 to 10000 (there isn&#39;t values lower than 0 neither greater than 10000).\n\nFinally,\n\nHow a monitor works\n\n\n  To create a single colored pixel, an LCD display uses three subpixels\n  with red, green and blue filters. Through the careful control and\n  variation of the voltage applied, the intensity of each subpixel can\n  range over 256 shades. Combining the subpixels produces a possible\n  palette of 16.8 million colors (256 shades of red x 256 shades of\n  green x 256 shades of blue).\n  (https://computer.howstuffworks.com/monitor4.htm)\n\n\nSo, if a pixel has a values Red: 0, Blue: 0, Green: 0, the pixel color will be black, and if values are Red: 255, Blue: 255, Green: 255, the pixel color will be white.\n\nThere are plenty of sites to play around with this, like this one: https://www.w3schools.com/colors/colors_picker.asp\n\nPutting all together\n\nYour monitor can show only three colors: Red, Green and Blue (RGB). So, to visualize a raster you first have to choose which bands will represent those colors. That is the parameter  of . Then, you have to tell the monitor which value (out of the range) will represent the 0 (min) and which the 255 (max). This are the parameters  and  of . You can also specify different  and  for each band using a list of three values instead of just one value.\n\nLet&#39;s say you want to visualize a Landsat 8 TOA image as you were sitting on top of the satellite (real color). So, you have to tell the monitor to use the Red band (band 4) of the raster for the Red subpixel of the monitor, the Green band (band 3) for the Green subpixel and the Blue band (band 2) for the Blue subpixel. Then, you have to tell the monitor how to stretch the values from the raster, that as we&#39;ve seen for Landsat 8 TOA can go from 0 to 1 (because it&#39;s a ), to the values of the subpixels (that go from 0 to 255). So,\n\n\n\nBut you&#39;ll find out that the image looks &quot;too dark&quot; for that stretching (it depends on the reflectance of the objects you are seeing), so make the  smaller to see it &quot;brighter&quot;, for example, \n\nI leave you a simple app I made to show this:\nhttps://fitoprincipe.users.earthengine.app/view/stretch\n\nsource: https://code.earthengine.google.com/cdf508ac8ae98a35364758d4c585bba2\n\nIf you want to see the same Landsat scene from other collections you have to know how the data is presented in each collection.\n\nFinally, there are some methods to stretch the values automatically using the raster histogram, such as Standard Deviations, Minimum-Maximum, Percent Clip, Sigmoid, etc. (http://desktop.arcgis.com/en/arcmap/latest/manage-data/raster-and-images/stretch-function.htm).\nEarth Engine let&#39;s you use some\n\n\n",
            "excerpt": "How satellite <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> work\n\nSatellites carry out sensors that can measure radiance at different wavelengths (it depends on the sensor)\n\n\n\nFor example,\n\n\n  Landsat 8 carries a two-sensor payload: &hellip; ",
            "title": "What are the min and max values of Map.addLayer on Google Earth Engine?"
        },
        {
            "tags": [
                "python",
                "remote-sensing",
                "satellite",
                "envi"
            ],
            "question_score": 30,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 21378,
            "item_type": "question",
            "score": 30,
            "last_activity_date": 1340888127,
            "creation_date": 1331126549,
            "body": "with envi image processing and classification tools, you can get roofs from images with some spectral value and then you can convert it some vector data for your app.\n\nin python with OpenCV which have devoloped by Intel (has lots of Object Detection Algorithms) you can detect faces from images.  \n\nOpenCV Example:\n\n\n\nmy question is that can we detect roof or anything from coordinated or not-coordinated satellite images with opensource tools as python?\n\nSatellite Image Example:\n\n\n",
            "excerpt": "with envi image processing and classification tools, you can get roofs from images with some spectral value and then you can convert it some vector data for your app.\n\nin python with OpenCV which have &hellip; ",
            "title": "OpenSource Remote Sensing Tools for Classifying Roofs"
        },
        {
            "tags": [
                "python",
                "remote-sensing",
                "software-recommendations",
                "idl"
            ],
            "question_score": 14,
            "is_accepted": true,
            "answer_id": 85404,
            "is_answered": false,
            "question_id": 85386,
            "item_type": "answer",
            "score": 28,
            "last_activity_date": 1391555012,
            "creation_date": 1391555012,
            "body": "IDL is a fantastic stand-alone programming language (you do not need ENVI). I particularity like it for very fast matrix processing on large arrays. @Aaron makes IDL sound much less flexible then it really is. The majority of IDL development came out of the Physics and Astronomy communities. There is robust support for mathematical and statistical programming. If bundled with ENVI, you have all the library calls (functions) available in ENVI including support for spatial vector objects. There are also a large number of functions and models developed by the user community. One advantage to learning IDL is that it will make you marketable in &quot;analytic&quot; remote sensing shops. \n\nAlso, do not forget that ERDAS has a scripting language (EML) that is quite good and easy to learn. EML is the backbone of the graphic modeler and gmd&#39;s are just packaged EML scripts that sit under the graphic modeler interface. The advantage of using EML directly is that you can use for/while loops and have access to more ERDAS functionality in a scripting language.         \n\nMATLAB is also very good for matrix processing and there are open source versions (e.g., Octave) that have exactly the same syntax with similar benchmarks. This is a highly flexible language with considerable power. It is one of the preferred language for applied mathematics and engineering.      \n\nThe Python alternatives NumPy and SciPy are flexible but not as optimized as IDL and MATLAB. As such, you need to deal with addressing space and speed when working with large arrays. One huge advantage of Python are the additional libraries for performing a variety of analytical tasks. There are packages for remote sensing,  nonparametric statistics, bindings to spatial classes (e.g. GDAL, LibLAS) to name just some of the added functionality available through packages. \n\nThis brings us to R. I am primarily a spatial statistician so, this is my everyday language. The number of available packages is staggering which, in turn, provides access to cutting edge cross-discipline statistical methodologies. However, I have to say that it is very cumbersome when dealing with large data problems. The spatial classes are getting much better and because of the raster package providing the ability to hold large data out of memory I am now able to implement some fairly complex statistical models utilizing large raster arrays. But still, R is slow when dealing with large memory problems. The BigMatrix package allows for writing and processing huge arrays from disk but the coding overhead is not insignificant There are also bindings to GDAL and GIS software (e.g., GRASS, SAGA) that allow spatial object processing to occur outside of R in a GIS specific software, which is how I interact with GIS software these days. This allows me to leverage functionality across multiple software without leaving R.                \n\nSo, now that the software cheerleading is out of the way, my recommendation is &quot;yes to all of the above options&quot;. Programming is a skill that, once learned, is easily applied to other languages. There are striking similarities between C++, R, IDL and Python. Aside from some coding idiocentricities, what one must learn are the available functions to implement a given model/task. Once this is done it is just a matter of syntax that implements common coding structures. \n\nSometimes there are things that just work better in a different software or language. I occasionally write code in FORTRAN or C++ because it is just the best choice for a given task. It is a matter of adaptability. You may want to start with Python because, as a  scripting language, it can be applied to numerous tasks it also provides availability of packages for specialized analysis, has a number of free online resources and is somewhat easy to learn.           \n",
            "excerpt": "One advantage to learning IDL is that it will make you marketable in &quot;analytic&quot; <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> shops. &hellip; There are packages for <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>,  nonparametric statistics, bindings to spatial classes (e.g. GDAL, LibLAS) to name just some of the added functionality available through packages. &hellip; ",
            "title": "Recommended programming language for remote sensing?"
        },
        {
            "tags": [
                "raster",
                "open-source-gis",
                "remote-sensing",
                "references",
                "change-detection"
            ],
            "question_score": 26,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 33402,
            "item_type": "question",
            "score": 26,
            "last_activity_date": 1603438048,
            "creation_date": 1347528400,
            "body": "From wikipedia page:\n\nChange detection for GIS (geographical information systems) is a process that measures how the attributes of a particular area have changed between two or more time periods. Change detection often involves comparing aerial photographs or satellite imagery of the area taken at different times. The process is most frequently associated with environmental monitoring, natural resource management, or measuring urban development\n\nHow is the comparison done? With what tools?\nI feel that the description is not complete. Or something is missing.\nWhere or in which books can I find more information about Change Detection?\nWhat tools should I use to perform such an analysis using the data in a shapefile? (only open-source please)\n\nSome papers on change detection (theory and techniques)\nChange detection techniques (D. LU, E. BRONDI, ZIO and E. MORAN, 2004, pdf)\nTrend change detection in NDVI time series: Effects of inter-annual variability and methodology\nForkel, M. , Carvalhais, N. , Verbesselt, J. , Mahecha, M.D. , Neigh, C. , Reichstein, M. (2013)\nRemote Sensing 5 (2013)5. - ISSN 2072-4292 - p. 2113 - 2144.\nShifts in global vegetation activity trends\nJong, R. de , Verbesselt, J. , Zeileis, A. , Schaepman, M.E. (2013)\nRemote Sensing 5 (2013)3. - ISSN 2072-4292 - p. 1117 - 1133.\nRelationships between declining summer sea ice, increasing temperatures and changing vegetation in the Siberian Arctic tundra from MODIS time series (2000–11)\nDutrieux, L.P. , Bartholomeus, H.M. , Herold, M. , Verbesselt, J. (2012)\nEnvironmental Research Letters 7 (2012)4. - ISSN 1748-9326 - p. 12.\nNear real-time disturbance detection using satellite image time series\nVerbesselt, J.P. , Zeileis, A. , Herold, M. (2012)\nRemote Sensing of Environment 123 (2012). - ISSN 0034-4257 - p. 98 - 108.\nTrend changes in global greening and browning: Contribution of short-term trends to longer-term change\nJong, R. de , Verbesselt, J. , Schaepman, M.E. , Bruin, S. de (2012)\nGlobal Change Biology 18 (2012)2. - ISSN 1354-1013 - p. 642 - 655.\nPhenological change detection while accounting for abrupt and gradual trends in satellite image time series\nVerbesselt, J. , Hyndman, R. , Zeileis, A. , Culvenor, D. (2010)\nRemote Sensing of Environment 114 (2010)12. - ISSN 0034-4257 - p. 2970 - 2980.\nDetecting trend and seasonal changes in satellite image time series\nVerbesselt, J. , Hyndman, R. , Newnham, G. , Culvenor, D. (2010)\nRemote Sensing of Environment 114 (2010)1. - ISSN 0034-4257 - p. 106 - 115.\n(I&#39;ll add more in the future as If I discover more notable  papers)\n",
            "excerpt": "Shifts in global vegetation activity trends\nJong, R. de , Verbesselt, J. , Zeileis, A. , Schaepman, M.E. (2013)\n<span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> 5 (2013)3. - ISSN 2072-4292 - p. 1117 - 1133. &hellip; Near real-time disturbance detection using satellite image time series\nVerbesselt, J.P. , Zeileis, A. , Herold, M. (2012)\n<span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> of Environment 123 (2012). - ISSN 0034-4257 - p. 98 - 108. &hellip; ",
            "title": "What is Change Detection and performing such analysis with open source tools?"
        },
        {
            "tags": [
                "remote-sensing",
                "open-source-gis",
                "software-recommendations"
            ],
            "question_score": 25,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 12,
            "is_answered": true,
            "question_id": 36736,
            "item_type": "question",
            "score": 25,
            "last_activity_date": 1474972843,
            "creation_date": 1350266099,
            "body": "Here are many questions with great answers about open source GIS software.\n\nI am wondering, what is the best open source software package for Remote Sensing? I would like to learn it and to use in my work.\n\nI used to work with IDRISI, and I&#39;ve heard about Erdas and ENVI, but they all are not free. I am looking for a free and powerful leader, like Qgis for GIS or R for statistics. With powerful classification, segmentation, Fourier, filters, PCA, etc.\n\nCan anyone please advise me a good free RS software? What are the capabilities, user friendly or with command line? Do any comparison matrices exist?\n",
            "excerpt": "I am wondering, what is the best open source software package for <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>? I would like to learn it and to use in my work. &hellip; ",
            "title": "Seeking open source software package for Remote Sensing?"
        },
        {
            "tags": [
                "research"
            ],
            "question_score": 44,
            "is_accepted": true,
            "answer_id": 65083,
            "is_answered": false,
            "question_id": 64791,
            "item_type": "answer",
            "score": 25,
            "last_activity_date": 1373308376,
            "creation_date": 1372794572,
            "body": "These three conferences are influential in my academic GIScience circles. \n\n(stalwarts)\n(1) Conference on Spatial Information Theory; http://www.cosit.info/\n(2) International Conference on Geographic Information Science (GIScience); http://www.giscience.org/\n\n(rising in importance)\n(3) ACM SIGSPATIAL International Conference on Advances in Geographic Information Systems; http://www.sigspatial.org/sigspatial-conferences\n\nAn accepted paper for COSIT or GIScience might be somewhat equivalent to publication in International Journal of Geographic Information Science or Transactions in GIS (IJGIS Impact Factor in 2012:  1.613 &amp; TGIS Impact Factor in 2012: 0.906).\n\nOf course, the interdisciplinary spatial journals have the highest impact:\nhttp://www.aboutgis.com/gis-and-remote-sensing-journal-list-with-impact-factors/\n\nDue to the specialized nature of GIScience, I expect the most-influential papers on geospatial information research will begin to be published in journals with a wider reach. That same gravity also will pull the work to higher impact conferences, such as one of the Association of Computing Machinery specialty meetings -- or perhaps to large conferences, like the American Geophysical Union Fall Meeting.\n\nSimultaneously, the Internet minimizes the need for singular important conferences and journals. In the longer term, I expect closed, expensive, or proprietary channels to be diminished in importance.\n",
            "excerpt": "Of course, the interdisciplinary spatial journals have the highest impact:\nhttp://www.aboutgis.com/gis-and-<span class=\"highlight\">remote</span>-<span class=\"highlight\">sensing</span>-journal-list-with-impact-factors/\n\nDue to the specialized nature of GIScience, &hellip; ",
            "title": "Seeking top tier conference in GIScience?"
        },
        {
            "tags": [
                "python",
                "arcgis-platform",
                "industry",
                "gis-principle",
                "academic"
            ],
            "question_score": 24,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 17303,
            "item_type": "question",
            "score": 24,
            "last_activity_date": 1398390578,
            "creation_date": 1322490267,
            "body": "I will be instructing a course at the local university titled Computer Science for Geospatial Technologies. This is an introductory course meant to introduce computer science concepts to geospatial technologies students (GIS &amp; Remote Sensing). In the past I have introduced programming concepts, but I found this went over many of the students&#39; heads.\n\nCurrently, I am planning to discuss computer hardware, spatial data types (i.e. shapefiles vs geodatabases), ESRI Geodatabase Model (the university works on an ESRI platform), basic database theory with ArcSDE Personal.\n\nCould anyone recommend some other computer science related topics that practitioners of GIS and Remote Sensing should know before entering the workforce?\n\nUPDATE:  Last years curriculum included:\n\n\nGoogle Maps Javascript API/HTML/Google Earth/KML - 5 weeks\nPython Scripting - 6 weeks\nDatabase Theory/MS Access - 2 weeks\nVBA - 2 weeks\n\n\nThe response I received from students was that not enough time was spent on each topic.  I am speaking to the university to offer a next level course in GIS Programming using Python.\n",
            "excerpt": "This is an introductory course meant to introduce computer science concepts to geospatial technologies students (GIS &amp; <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>). &hellip; Could anyone recommend some other computer science related topics that practitioners of GIS and <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> should know before entering the workforce? &hellip; ",
            "title": "Recommend topics to be included in a Computer Science for Geospatial Technologies course"
        },
        {
            "tags": [
                "references"
            ],
            "question_score": 16,
            "is_accepted": true,
            "answer_id": 11489,
            "is_answered": false,
            "question_id": 11485,
            "item_type": "answer",
            "score": 23,
            "last_activity_date": 1501540293,
            "creation_date": 1309075907,
            "body": "To be able to answer questions asked in a GIS interview not related to any particular software you should have the ability to explain the following topics:\n\n\nWhat is GIS?\nWhat is remote sensing?\nA bit about Image processing.\nWhat is georeferencing?\nThe role of GPS in GIS.\nWhat are projections?\nWhat is cartography? (Questions on map elements like scales, legends etc:)\nData structures that can hold spatial data. (Raster, Vector, ...)\nExamples of what can be achieved by GIS? (Geocoding or Network or Spatial Analysis giving real life examples)\nOpen Standards related to GIS. (OGC or otherwise)\n\n\nIf you have a development background, questions pertaining to which development language you know are bound to rise up. It will benefit the organization hiring to have someone who can develop custom GIS solutions. These questions could be either GIS related or not depending on your previous experience. As far as development is concerned, people with no GIS background are also hired to develop GIS solutions.\n\nFinally, if you&#39;re the interviewer, then confirm which GIS software the interviewee is already accustomed to working with. It would help to hire someone who already knows how to tinker with the solutions that are implemented in your organization.\n\nIf you&#39;re the interviewee, well, know that for a large part you&#39;ll be judged by what is in your CV/resume. The list of the above questions might give you an approximate direction on what you need to start looking at. \n",
            "excerpt": "What is <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>?\nA bit about Image processing.\nWhat is georeferencing?\nThe role of GPS in GIS.\nWhat are projections?\nWhat is cartography? &hellip; ",
            "title": "Seeking General GIS Questions for Job interviews?"
        },
        {
            "tags": [
                "remote-sensing",
                "lidar",
                "terminology"
            ],
            "question_score": 17,
            "is_accepted": false,
            "answer_id": 142446,
            "is_answered": false,
            "question_id": 142443,
            "item_type": "answer",
            "score": 21,
            "last_activity_date": 1428948834,
            "creation_date": 1428948834,
            "body": "ESRI has a pretty good help section on LiDAR (below).  For more formal details on LiDAR, I would recommend the following books:\n\n\nTopographic Laser Ranging and Scanning: Principles and\nProcessing\nAirborne and Terrestrial Laser Scanning\nRemote Sensing and Image Interpretation\n\n\n\n  LiDAR Laser Returns\n  \n  Laser pulses emitted from a lidar system reflect from objects both on\n  and above the ground surface: vegetation, buildings, bridges, and so\n  on. One emitted laser pulse can return to the lidar sensor as one or\n  many returns. Any emitted laser pulse that encounters multiple\n  reflection surfaces as it travels toward the ground is split into as\n  many returns as there are reflective surfaces.\n  \n  The first returned laser pulse is the most significant return and will\n  be associated with the highest feature in the landscape like a treetop\n  or the top of a building. The first return can also represent the\n  ground, in which case only one return will be detected by the lidar\n  system.\n  \n  Multiple returns are capable of detecting the elevations of several\n  objects within the laser footprint of an outgoing laser pulse. The\n  intermediate returns, in general, are used for vegetation structure,\n  and the last return for bare-earth terrain models.\n  \n  The last return will not always be from a ground return. For example,\n  consider a case where a pulse hits a thick branch on its way to the\n  ground and the pulse does not actually reach the ground. In this case,\n  the last return is not from the ground but from the branch that\n  reflected the entire laser pulse.\n\n",
            "excerpt": "For more formal details on LiDAR, I would recommend the following books:\n\n\nTopographic Laser Ranging and Scanning: Principles and\nProcessing\nAirborne and Terrestrial Laser Scanning\n<span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> and Image &hellip; ",
            "title": "What are LiDAR returns?"
        },
        {
            "tags": [
                "references"
            ],
            "question_score": 21,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 37480,
            "item_type": "question",
            "score": 21,
            "last_activity_date": 1487751586,
            "creation_date": 1351097001,
            "body": "There was a related question a while back that dealt with the top GIS blogs, but I&#39;m also very interested in &quot;academic&quot; sources of GIS information. I&#39;m currently updating my repository of information and am also considering some new journal subscriptions. \n\nEvery professional field has some big names and big articles. Who are the big names and what articles should everyone be aware of in GIS/cartography/remote sensing?\n\nI&#39;m looking for 3 things in particular:\n\n1) Recommendations on the top sources for GIS articles - important/reliable journals.\n\n2) Major articles from the past - those that paved the way towards the current state of our field.\n\n3) Recent articles showcasing major findings/methodologies.\n\nBonus: I&#39;ve recently been searching for a good source of information on cartographic design - any articles related to this would be a great help.\n",
            "excerpt": "Who are the big names and what articles should everyone be aware of in GIS/cartography/<span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>? &hellip; ",
            "title": "What are the &quot;must read&quot; academic articles every GIS professional should read?"
        },
        {
            "tags": [
                "data",
                "weather"
            ],
            "question_score": 21,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 9,
            "is_answered": true,
            "question_id": 29810,
            "item_type": "question",
            "score": 21,
            "last_activity_date": 1685060544,
            "creation_date": 1342627698,
            "body": "I am wondering if anyone has any suggestions on sources of near real-time lightning strike data available for download?  For example, Intellicast.com has a map of strikes, but makes no mention of the source of the data they used.   \n\nKey attributes would be date/time and lat/long (any additional is just bonus), and strikes that occurred as much as 24 hours previously are logged and available.  It could be in a text/table form (which can be converted to a spatial table), but if it is in a GIS ready format, that would be great too.\n\nI know of a couple of paid sources:\n\n\nVaisala\nWeatherBank\nUSPLN, NAPLN, and GLN. (Update: Apparently Intellicast gets its data from WSI Corp, which runs the USPLN).\n\n\nOther sources I have stumbled across:\n\n\nblitzortung.org- I haven&#39;t figured out how to get the source strike data from the site\nAccording to an 2007 blog entry, GuiWeather.com used to supply weather data to Google Earth, but the site is no longer active.\n\n\nIs anyone aware of any other paid/free sources of lightning strike data?\n\nUPDATE: Someone posted &amp; deleted a good website for many resources of lightning data.  The NWA Remote Sensing Committee.  It provides a good overview of research and data providers, too.\n",
            "excerpt": "The NWA <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> Committee.  It provides a good overview of research and data providers, too. &hellip; ",
            "title": "Near real-time sources of lightning strike data"
        },
        {
            "tags": [
                "data",
                "terminology"
            ],
            "question_score": 16,
            "is_accepted": true,
            "answer_id": 34750,
            "is_answered": false,
            "question_id": 34733,
            "item_type": "answer",
            "score": 20,
            "last_activity_date": 1553774118,
            "creation_date": 1349191333,
            "body": "There is a good information about these terms on Basudeb Bhatta&#39;s Blog at this link, copied below. \n\n@Brad Nesom&#39;s definitions are good but I thought that geodata was an abbreviation of &quot;geographic data.&quot; However, Brad&#39;s definition of geodata is quite logical.\n\nBeside these in my opinion:\n\n\n\n...\n\n\n  Often my students ask about the difference(s) between spatial and\n  geospatial. These two words appear very frequently in remote sensing\n  and GIS literature.\n  \n  The word spatial originated from Latin &#39;spatium&#39;, which means space.\n  Spatial means &#39;pertaining to space&#39; or &#39;having to do with space,\n  relating to space and the position, size, shape, etc.&#39; (Oxford\n  Dictionary), which refers to features or phenomena distributed in\n  three-dimensional space (any space, not only the Earth&#39;s surface) and,\n  thus, having physical, measurable dimensions. In GIS, &#39;spatial&#39; is\n  also referred to as &#39;based on location on map&#39;.\n  \n  Geographic(al) means &#39;pertaining to geography (the study of the\n  surface of the earth)&#39; and &#39;referring to or characteristic of a\n  certain locality, especially in reference to its location in relation\n  to other places&#39; (Macquarie Dictionary). Spatial has broader meaning,\n  encompassing the term geographic. Geographic data can be defined as a\n  class of spatial data in which the frame is the surface and/or\n  near-surface of the Earth. &#39;Geographic&#39; is the right word for graphic\n  presentation (e.g., maps) of features and phenomena on or near the\n  Earth&#39;s surface. Geographic data uses different feature types (raster,\n  points, lines, or polygons) to uniquely identify the location and/or\n  the geographical boundaries of spatial (location based) entities that\n  exist on the earth surface. Geographic data are a significant subset\n  of spatial data, although the terms geographic, spatial, and\n  geospatial are often used interchangeably.\n  \n  Geospatial is another word, and might have originated in the industry\n  to make the things differentiate from geography. Though this word is\n  becoming popular, it has not been defined in any of the standard\n  dictionary yet. Since &#39;geo&#39; is from Greek &#39;gaya&#39; meaning Earth,\n  geospatial thus means earth-space. NASA says &#39;geospatial means the\n  distribution of something in a geographic sense; it refers to entities\n  that can be located by some co-ordinate system&#39;. Geospatial data is to\n  develop information about features, objects, and classes on Earth&#39;s\n  surface and/or near Earth&#39;s surface. Geospatial is that type of\n  spatial data which is related to the Earth, but the terms spatial and\n  geospatial are often used interchangeably. United States Geological\n  Survey (USGS) says &quot;the terms spatial and geospatial are equivalent&quot;.\n\n",
            "excerpt": "These two words appear very frequently in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>\n  and GIS literature.\n  \n  The word spatial originated from Latin &#39;spatium&#39;, which means space. &hellip; NASA says &#39;geospatial means the\n  distribution of something in a geographic <span class=\"highlight\">sense</span>; it refers to entities\n  that can be located by some co-ordinate system&#39;. &hellip; ",
            "title": "Spatial data? Geodata? Geographic Data? Geospatial data?"
        },
        {
            "tags": [
                "dem",
                "srtm",
                "aster",
                "france",
                "tandem-x"
            ],
            "question_score": 7,
            "is_accepted": false,
            "answer_id": 174415,
            "is_answered": false,
            "question_id": 174400,
            "item_type": "answer",
            "score": 20,
            "last_activity_date": 1452712583,
            "creation_date": 1450448374,
            "body": "The answer is not as simple as the question may imply. If we had one &quot;best one&quot; we would not need the others, we would just use the best. Horses for courses though, needs matter.\n\nSaying that.\n\nThis blog gives an excellent comparison of 90 m SRTM and 30m ASTER with some reasonable statistics. The winner is... well, actually you have no winner but 90m SRTM for me is nosing ahead. \n\n\n\nThe green line is SRTM and the red is ASTER.\n\nI can say I evaluated 30m SRTM (global 30 m SRTM is now available) and 30 m ASTER for Borneo and 30 m SRTM won my race, by a furlong. You see though, I wanted watersheds and had a hydrological algorithm in GRASS specifically built for the errors in SRTM so it was not a fair race. What you want to do with it matters greatly, as does where. GTOPO30 may work great at the continental scale, whereas I need LIDAR at 1 m resolution to calculate drainage on my agricultural fields. EU DEM is at approx. 25 m and may meet your needs and all the modeling information can be found online. Actually, this is the same for GTOPO, SRTM, and ASTER as well as in the LIDAR link given. All the construction information for the major free DEMS, and many of the minor ones, exists online.\n\nYou need to decide what DEM bests fits your application and needs. We cannot do that and you have not told us your needs or even the region you are working in. You can then search online and find the information about each DEM, usually in the metadata or on an accompanying website. This list will get you started but your region may well have improved resolution sources available, such as lidar.\n\nHere is some free literature:\n\nHirt, Christian, M. S. Filmer, and W. E. Featherstone. &quot;Comparison and validation of the recent freely available ASTER-GDEM ver1, SRTM ver4. 1 and GEODATA DEM-9S ver3 digital elevation models over Australia.&quot; Australian Journal of Earth Sciences 57.3 (2010): 337-347.\n\nChang, Hsing-Chung, Xiaojing Li, and Linlin Ge. &quot;Assessment of SRTM, ACE2 and ASTER-GDEM using RTK-GPS.&quot; 15 AUSTRALASIAN REMOTE SENSING &amp; PHOTOGRAMMETRY CONFERENCE. Sydney: University of New South Wales, 2010.\n\nHayakawa, Yuichi S., Takashi Oguchi, and Zhou Lin. &quot;Comparison of new and existing global digital elevation models: ASTER G‐DEM and SRTM‐3.&quot; Geophysical Research Letters 35.17 (2008).\n",
            "excerpt": "&quot;Assessment of SRTM, ACE2 and ASTER-GDEM using RTK-GPS.&quot; 15 AUSTRALASIAN <span class=\"highlight\">REMOTE</span> <span class=\"highlight\">SENSING</span> &amp; PHOTOGRAMMETRY CONFERENCE. Sydney: University of New South Wales, 2010. &hellip; ",
            "title": "Choosing DEM in France?"
        },
        {
            "tags": [
                "remote-sensing",
                "classification"
            ],
            "question_score": 18,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 9,
            "is_answered": true,
            "question_id": 3225,
            "item_type": "question",
            "score": 18,
            "last_activity_date": 1361310255,
            "creation_date": 1288945565,
            "body": "Which tool do you prefer to use for classification of remote sensing data, e.g. classifying land use, and why? \n\nWhich other tools have you tried, and why did you decide against them?\n",
            "excerpt": "Which tool do you prefer to use for classification of <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> data, e.g. classifying land use, and why? \n\nWhich other tools have you tried, and why did you decide against them? &hellip; ",
            "title": "Which Tools do you use for Classification of Remote Sensing Data?"
        },
        {
            "tags": [
                "python",
                "gdal",
                "geotiff-tiff",
                "landsat",
                "numpy"
            ],
            "question_score": 18,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 164853,
            "item_type": "question",
            "score": 18,
            "last_activity_date": 1620219847,
            "creation_date": 1443644793,
            "body": "I&#39;m trying the learn the ropes of Remote Sensing image processing using Python GDAL bindings and numpy. As a first attempt, I&#39;m reading a Landsat8 geotiff file, do a simple manipulation and write the result to a new file. The code below appears to work fine, except that the original raster is dumped in the output file, rather than the manipulated raster. \n\nAny comments or suggestions are welcome, but particularly notes on why the manipulated raster does not show in the result. \n\n\n\nI use Python 2.7.1 on a Windows 7 32 bit machine. \n",
            "excerpt": "I&#39;m trying the learn the ropes of <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> image processing using Python GDAL bindings and numpy. &hellip; ",
            "title": "Reading, modifying and writing a geotiff with GDAL in python"
        },
        {
            "tags": [
                "remote-sensing",
                "satellite",
                "landsat"
            ],
            "question_score": 16,
            "is_accepted": true,
            "answer_id": 25212,
            "is_answered": false,
            "question_id": 25200,
            "item_type": "answer",
            "score": 17,
            "last_activity_date": 1361166249,
            "creation_date": 1336660778,
            "body": "I agree with @vascobnunes opinion but if you want to define certain objects you have to use LANDSAT TM because more classification needs more bands as (R, G, B, NIR, MIR, TIR, FIR)... and my choice is that you should use LANDSAT TM (I gave same information in the following explanation) for vegetation.\n\nThe important thing in this case is that you should look at  of your satellite. \n\n\n  Relative spectral response (RSR) measurements are assumed to be\n  constant for all detectors covered by a common filter and are\n  normalized to unity AT peak response. There are currently no methods\n  to check spectral stability with time from either on-orbit or Ground\n  measurements.\n\n\n(Source: Dr. John Barke)\n\nIn addition to RSR,  is so important for repetitive data acquisition cycle...\n\nThis is the relative spectral response for LANDSAT TM:\n\n\n\nThere is an information here about Assessment of NDVI- differences caused by sensor-\nspecific relative spectral response functions.\n\nAbstract is here:\n\n\n  The Normalized Difference Vegetation Index (NDVI)  is the most often\n  used remote sensing-based indicator to monitor  dynamics of land\n  surfaces and environmental changes. Due to  different sensor\n  characteristics, the NDVI values vary according  to the recording\n  system. This study focuses on the factor of  spectral sensor\n  characteristics, which can complicate the  interpretation of\n  multisensoral NDVI data. Therefore,  multispectral bands of Landsat\n  5TM, QuickBird and SPOT5  were simulated from hyperspectral data.\n  These simulated data  sets show identical characteristics (except\n  spectrally) like sensor  geometry, atmospheric conditions, topography\n  and spatial  resolution. This allows a direct comparison of NDVI\n  differences  caused by the factor of different spectral\n  characteristics.\n\n\nI have made a summary for you from this document about spectral values for NIR and Red band...\n\n\n\nRelative spectral response functions of the red and near-infrared \nbands of Landsat 5TM, QuickBird and SPOT5 with 2 typical land cover \nspectra. \n\nThe Result :\n\n\n  Especially in the NIR  region the RSR functions of the sensors vary\n  from each other.  Conspicuous is that the gap between the red and NIR\n  band of  Landsat 5TM as well as of SPOT5 is wider than the gap \n  between the QuickBird bands, where even an overlap exists.\n\n\n\n\n\n\nSensor-related differences (%) of the relative spectral response \nfunctions of the red (a) and near-infrared (b) bands of the sensors. \n\nThe Result:\n\n\n  Whereas the red bands of QuickBird and SPOT5 are  very similar, the\n  NIR bands of these sensors show the widest differences up to over 80%\n  at 0.77&#181;m. Due to the wide  differences between the NIR bands, the RSR\n  functions of these  bands affect the NDVI more than those of the red\n  bands.\n\n\nI hope it helps you...\n",
            "excerpt": "Abstract is here:\n\n\n  The Normalized Difference Vegetation Index (NDVI)  is the most often\n  used <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>-based indicator to monitor  dynamics of land\n  surfaces and environmental changes. &hellip; ",
            "title": "Which remote sensing satellite is best used for vegetation extent mapping"
        },
        {
            "tags": [
                "python",
                "gdal",
                "installation",
                "windows"
            ],
            "question_score": 110,
            "is_accepted": false,
            "answer_id": 198407,
            "is_answered": false,
            "question_id": 2276,
            "item_type": "answer",
            "score": 17,
            "last_activity_date": 1675649531,
            "creation_date": 1465933199,
            "body": "Another option is to install the Anaconda Python distribution which has packages for GDAL. If you are going to be doing a lot of work using GDAL with other Python packages (scipy, pandas, scikit-learn etc.,) this might be a better option than OSGeo4W. On the other hand if you want to use Python in combination with a number of open-source remote sensing and GIS packages (GRASS, QGIS etc.,) OSGeo4W is probably the better option.\nYou can get the full Anaconda distribution from: https://www.continuum.io/downloads which contains a lot of Python packages aimed at &#39;data science&#39; or a minimal installation from http://conda.pydata.org/miniconda.html\nAs part of the installation it will prompt you to add to the main path (so it is available from any terminal).\nOnce set up GDAL can be installed into a new environment using:\n\nThen activating it as shown when the command finishes. Installing into a new environment is recommended to avoid conflicts with other packages and make sure the environmental variables required are set.\nI&#39;ve suggested installing from the conda-forge channel (https://conda-forge.github.io/) as they are very active in keeping their GDAL builds up to date and making sure they work against a lot of libraries.\nOnce installed packages can be updated from within the environment using:\n\n",
            "excerpt": "On the other hand if you want to use Python in combination with a number of open-source <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> and GIS packages (GRASS, QGIS etc.,) OSGeo4W is probably the better option. &hellip; ",
            "title": "Installing GDAL with Python on Windows"
        },
        {
            "tags": [
                "raster",
                "open-source-gis",
                "remote-sensing",
                "references",
                "change-detection"
            ],
            "question_score": 26,
            "is_accepted": true,
            "answer_id": 33405,
            "is_answered": false,
            "question_id": 33402,
            "item_type": "answer",
            "score": 16,
            "last_activity_date": 1361166588,
            "creation_date": 1347531572,
            "body": "Change detection is a common operation/module in remote sensing packages like ENVI or Orfeo toolbox. It usually involves raster data (satellite images for example).\n\n\n  How is the comparison done? With what tools? I feel that the\n  description is not complete. Or something is missing.\n\n\nChange detection is done by comparing two raster images that were taken at different times but which cover the same area. As the images cover the same area, the images overlay each other. Imagine two grids stacked on top of each other. \n\nIt is then a matter of comparing whether the value of a pixel in the new raster is the same as the value of the pixel in the old raster. Pixels that have changed are then marked. The output is usually a raster that covers the same extents as the two images with the changed areas highlighted. It&#39;s a simplification of course but you get the idea :)   \n\n\n\n\n  Where or in which books can I find more information about Change\n  Detection?\n\n\nYou can start with these documents\n\n\nReview Article Digital change detection techniques using remotely-sensed data\nTHE STATE OF CHANGE DETECTION IN GIS\nHow Change Detection Works\n\n\n\n  What tools should I use to perform such an analysis using the data in a shapefile? (only open-source please)\n\n\nYou can try out Opticks. It has a change detection plugin.\n",
            "excerpt": "Change detection is a common operation/module in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> packages like ENVI or Orfeo toolbox. It usually involves raster data (satellite images for example).\n\n\n  How is the comparison done? &hellip; ",
            "title": "What is Change Detection and performing such analysis with open source tools?"
        },
        {
            "tags": [
                "remote-sensing",
                "software-recommendations",
                "landsat"
            ],
            "question_score": 16,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 7716,
            "item_type": "question",
            "score": 16,
            "last_activity_date": 1650297579,
            "creation_date": 1301010605,
            "body": "I&#39;m currently enrolled in a remote sensing course, using LANDSAT data.\nPart of my course is about standardizing the scenes based on radiance values. I assume that because this is such a tedious task, someone has already figured out a way to automate it.\nAre there any tools, Esri or otherwise that will standardize LANDSAT scenes?\n",
            "excerpt": "I&#39;m currently enrolled in a <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> course, using LANDSAT data.\nPart of my course is about standardizing the scenes based on radiance values. &hellip; ",
            "title": "Automating preprocessing of LANDSAT data"
        },
        {
            "tags": [
                "remote-sensing",
                "satellite",
                "landsat"
            ],
            "question_score": 16,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 25200,
            "item_type": "question",
            "score": 16,
            "last_activity_date": 1607846937,
            "creation_date": 1336656459,
            "body": "I&#39;m currently writing an assignment for my remote sensing class and while I think I have correct answer was wondering what people who do this stuff for a living think.\n\nThe question is: which satellite out the Landsat TM (Thematic Mapper) and SPOT 5 would you use to map general extent of a 300km x 300km study area.\n\nMy answer was that you would use the SPOT 5 as it is higher resolution and would let you get a finer extent vs the 30m resolution of the Landsat TM.  However the SPOT 5 has a small swath area so you have to use more images.  I also thought about the 2200km VMI swath on the SPOT 5 but the resolution is 1km.\n\nThoughts?\n",
            "excerpt": "I&#39;m currently writing an assignment for my <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> class and while I think I have correct answer was wondering what people who do this stuff for a living think. &hellip; ",
            "title": "Which remote sensing satellite is best used for vegetation extent mapping"
        },
        {
            "tags": [
                "remote-sensing"
            ],
            "question_score": 16,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 173610,
            "item_type": "question",
            "score": 16,
            "last_activity_date": 1664421554,
            "creation_date": 1449938556,
            "body": "I am new in remote sensing field.\nI sometimes got confused when I read about image pre-processing.\nCan someone please elaborate to me the difference and some example methods to do radiometric correction and radiometric calibration ? \nIs converting DN values to Top Of Atmospheric (TOA) reflectance values from 2 sets of images (e.g Landsat 7) from different time counted as correcting or calibrating ?\nAre DOS (Dark Object Subtraction) and Sun-angle correction parts of radiometric correction ?\n",
            "excerpt": "I am new in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> field.\nI sometimes got confused when I read about image pre-processing. &hellip; ",
            "title": "Difference Between Radiometric calibration and radiometric correction"
        },
        {
            "tags": [
                "remote-sensing",
                "classification",
                "machine-learning"
            ],
            "question_score": 16,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 237461,
            "item_type": "question",
            "score": 16,
            "last_activity_date": 1548276640,
            "creation_date": 1492697022,
            "body": "I am struggling to clearly understand the distinction between pixel-based and object-based classification in the remote sensing domain and am hoping someone from this community can provide insight.\n\nBased on the information I have so far, my current understanding is along these lines:\n\nPixel-based classification:\nClassification is done on a per pixel level, using only the spectral information available for that individual pixel (i.e. values of pixels within the locality are ignored). In this sense each pixel would represent a training example for a classification algorithm, and this training example would be in the form of an n-dimensional vector, where n was the number of spectral bands in the image data. Accordingly the trained classification algorithm would output a class prediction for each individual pixel in an image.\n\nObject-based classification:\nClassification is done on a localized group of pixels, taking into account the spatial properties of each pixel as they relate to each other. In this sense a training example for a classification algorithm would consist of a group of pixels, and the trained classification algorithm would accordingly output a class prediction for pixels on a group basis. For a crude example, an image might be partitioned into n segments of equal size, and each segment would then be given a class (i.e. contains object / does not contain object).\n\nIs this thinking accurate regarding the meaning of these terms, or is there something that I have missed? \n",
            "excerpt": "I am struggling to clearly understand the distinction between pixel-based and object-based classification in the <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> domain and am hoping someone from this community can provide insight. &hellip; In this <span class=\"highlight\">sense</span> each pixel would represent a training example for a classification algorithm, and this training example would be in the form of an n-dimensional vector, where n was the number of spectral &hellip; ",
            "title": "Distinction between pixel-based and object based classification?"
        },
        {
            "tags": [
                "remote-sensing",
                "classification",
                "machine-learning"
            ],
            "question_score": 16,
            "is_accepted": false,
            "answer_id": 237470,
            "is_answered": false,
            "question_id": 237461,
            "item_type": "answer",
            "score": 16,
            "last_activity_date": 1492967131,
            "creation_date": 1492698887,
            "body": "As far as pixel-based classification is concerned, you are spot on. Each pixel is an n-dimensional vector and will be assigned to some class according to some metric, whether using Support Vector Machines, MLE, some kind of knn classifier, etc.\n\nAs far as region based classifiers are concerned, though, there have been huge developments in the last few years, driven by a combination of GPUs, vast amounts of data, the cloud and wide availability of algorithms thanks to the growth of open source (facilitated by github). One of the biggest developments in computer vision/classification has been in convolutional neural networks (CNNs). The convolutional layers &quot;learn&quot; features which might be based on colour, as with traditional pixel-based classifiers, but also create edge detectors and all kinds of other feature extractors that could exist in an region of pixels (hence the convolutional part) that you could never extract from a pixel-based classification. This means they are less likely to mis-classify a pixel in the middle of an area of pixels of some other type -- if you have ever run a classification and got ice in the middle of the Amazon, you will understand this problem.\n\nYou then apply a fully connected neural net to the &quot;features&quot; learnt via the convolutions to actually do the classification. One of the other great advantages of CNNs is that they are scale and rotation invariant, as there are usually intermediate layers between the convolution layers and the classification layer that generalize features, using pooling and dropout, to avoid overfitting, and help with the issues around scale and orientation.\n\nThere are numerous resources on convolutional neural networks, although the best has to be the Standord class from Andrei Karpathy, who is one of the pioneers of this field, and the entire lecture series is available on youtube.\n\nSure, there are other ways of dealing with pixel versus area based classification, but this is currently the state of the art approach, and has many applications beyond remote sensing classification, such as machine translation and self-driving cars.\n\nHere is another example of region-based classification, using Open Street Map for tagged training data, including instructions for setting up TensorFlow and running on AWS.\n\nHere is an example using Google Earth Engine of a classifier based on edge detection, in this case for pivot irrigation -- using nothing more than a Gaussian kernel and convolutions, but again, showing the power of region/edge based approaches.\n\n\n\nWhile the superiority of object over pixel-based classfication is fairly widely accepted, here is an interesting article in Remote Sensing Letters assessing the performance of object-based classification.\n\nFinally, an amusing example, just to show that even with regional/convolutional based classifiers, computer vision is still really hard -- fortunately, the smartest people at Google, Facebook, etc, are working on algorithms to be able to determine the difference between dogs, cats, and different breeds of dogs and cats. So, those of use interested in remote sensing can sleep easy at night :D\n\n\n",
            "excerpt": "Sure, there are other ways of dealing with pixel versus area based classification, but this is currently the state of the art approach, and has many applications beyond <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> classification, such &hellip; So, those of use interested in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> can sleep easy at night :D &hellip; ",
            "title": "Distinction between pixel-based and object based classification?"
        },
        {
            "tags": [
                "dem",
                "lidar",
                "classification",
                "las",
                "unmanned-aerial-vehicle"
            ],
            "question_score": 11,
            "is_accepted": false,
            "answer_id": 108342,
            "is_answered": false,
            "question_id": 101786,
            "item_type": "answer",
            "score": 16,
            "last_activity_date": 1481025613,
            "creation_date": 1406230039,
            "body": "Generating LiDAR DEMs from unclassified point clouds with:\n\n\nMCC-LIDAR - Multiscale Curvature Classification (MCC) algorithm.\n(supports LAS versions 1.1 to 1.3)  \n\n\n\n  MCC-LIDAR is a command-line tool for processing discrete-return LIDAR data in forested environments (Evans &amp; Hudak, 2007).\n\n\nWorkflow: \n\n\na) unclassified point cloud.\nb) ground returns classified.\nc) bare-earth DEM (raster).\n\n\n\n\n\n\nLet&#39;s create a hypothetical situation to further provide an example with code.\n\nMCC-LIDAR is installed in:  \n\n\n\nThe unclassified LiDAR point cloud (.las file) is in:  \n\n\n\nThe output which are going to be the bare-earth DEM is in:\n\n\n\nThe example below classifies ground returns with the MCC algorithm and create a bare-earth DEM with 1 meter resolution.\n\n\n\nTo understand better how the scale (s) and the curvature threshold (t) parameters work, read: How to Run MCC-LiDAR and; Evans and Hudak (2007).\n\nThe parameters need to be calibrated to avoid commission/labeling errors (when a point is classified as belonging to the ground but actually it belongs to vegetation or buildings). For example:  \n\n\n\nThe MCC-LIDAR uses Thin Plate Spline (TPS) interpolation method to classify ground points and generate the bare-earth DEM. \n\n\n\nReferences:\n\n\nEvans, Jeffrey S.; Hudak, Andrew T.  2007.  A multiscale curvature algorithm for classifying discrete return LiDAR in forested environments.   IEEE Transactions on Geoscience and Remote Sensing. 45(4): 1029-1038.  \n\n\nFor more options about ground point classification algorithms, see Meng et al. (2010): \n\n\nMeng, X.; Currit, N.; Zhao, K. (2010). Ground Filtering Algorithms for Airborne LiDAR Data: A Review of Critical Issues. Remote Sensing, 2(3), 833–860. doi:10.3390/rs2030833\n\n",
            "excerpt": "IEEE Transactions on Geoscience and <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>. 45(4): 1029-1038. &hellip; <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>, 2(3), 833–860. doi:10.3390/rs2030833 &hellip; ",
            "title": "Determining bare earth DEM from unclassified LAS file?"
        },
        {
            "tags": [
                "qgis",
                "education",
                "training",
                "certification",
                "gis-professional"
            ],
            "question_score": 26,
            "is_accepted": true,
            "answer_id": 219731,
            "is_answered": false,
            "question_id": 219706,
            "item_type": "answer",
            "score": 15,
            "last_activity_date": 1591217353,
            "creation_date": 1480539914,
            "body": "Update Edit 06/03/2020. Yes - the QGIS open source project now offers a Certification program which one can apply to.\n\nThe QGIS Certificate Program is designed to promote both community involvement in the QGIS project and quality education for QGIS software. As such the application process requires applicants to both detail their contributions to the QGIS project and make their training materials available for review. Contributions to the QGIS project include activities such as:\nDevelopment/commits to QGIS\nContributions to the QGIS documentation and training materials\nTranslation of QGIS materials\nAuthoring plugins\nFiling bug reports\nFinancially supporting new feature development\nFinancial contributions to and sponsorship of QGIS\nInvolvement in your local QGIS User Group\nPublication of open QGIS course ware\nAuthoring QGIS books\n\n![QGIS Workflow Certification Diagram\n\nYou are required to provide the training material for each of your courses. This includes exercises, lectures and data. This material will be reviewed for currentness, accurate representation of the QGIS project and overall quality. If the material is not of adequate quality, this can be cause for refusal.\nFollowing an initial review, the application will be sent to local QGIS groups for their opinion. This portion of the review should take place in less than one month. If there is not a local QGIS user group the QGIS Project Steering Committee (PSC) will make a determination based on material provided and your reputation in the community. In this latter case you are encouraged to establish a local QGIS User Group. If you are not deemed to be a member of the QGIS community in good standing this can be cause for refusal.\nThe PSC will make the final determination. If accepted as a QGIS Certified Organization your contributions to the project will be published for transparency.\nIf approved you are required to make a €20 donation to the QGIS project for each certificate. This creates a mechanism for financial support of the project. Payments for certificates are made using online credit card transactions.\nYou can apply through this form (make sure to first create a login). You can find more details about the certification programme here (we advise you to read this before registering).\n\nHere are several other options, from March 2019 this is information I&#39;ve come across via this\n\nblog post from NRGS - &quot;NRGS and QGIS Certification&quot; where the author highlights\n\nAnother option for a QGIS &#39;certificate&#39; I found was a 5-sequence course offered by a College in the US - Del Mar College. That offer a certificate in &#39;Open Source Geospatial Technology&#39;. It was also covered by a GIS content Magazine here\nThe five courses include:\n\n\nGST 101—Introduction to Geospatial Technology Using QGIS\n\nGST 102—Spatial Analysis Using QGIS\n\nGST 103—Data Management and Acquisition Using QGIS\n\nGST 104—Cartography Using QGIS and Inkscape\n\nGST 105—Remote Sensing Using QGIS and GRASS The courses are designed to be self-contained complete with all the theory, software instruction, and sample data required to learn at home or office, at your own pace.\n\n\n\nAlso, in elsewhere I found these programs available:\nIn British Columbia, Canada there is a program offered by Langara providing a certificate\n\nthe curriculum of this program is based on sound principles common to the entire field of GIS, and the classes will be conducted using QGIS\n\nIn India, there is a Certificate course in Public Health using QGIS here\n",
            "excerpt": "GST 101—Introduction to Geospatial Technology Using QGIS\n\nGST 102—Spatial Analysis Using QGIS\n\nGST 103—Data Management and Acquisition Using QGIS\n\nGST 104—Cartography Using QGIS and Inkscape\n\nGST 105—<span class=\"highlight\">Remote</span> &hellip; <span class=\"highlight\">Sensing</span> Using QGIS and GRASS The courses are designed to be self-contained complete with all the theory, software instruction, and sample data required to learn at home or office, at your own pace. &hellip; ",
            "title": "Is there a professional certification available for QGIS users?"
        },
        {
            "tags": [
                "raster"
            ],
            "question_score": 15,
            "is_accepted": true,
            "answer_id": 71142,
            "is_answered": false,
            "question_id": 71140,
            "item_type": "answer",
            "score": 15,
            "last_activity_date": 1378871307,
            "creation_date": 1378870674,
            "body": "No, the two terms aren&#39;t equivalent: 1) Not all raster data is gridded -- not even all Earth observation imagery raster data. 2) And while gridded data is usually stored in a raster file format, not all gridded data represents a straightforward rectangular raster data structure.\n\nTo illustrate this:\n\n\n&quot;Gridded&quot; presumes that data in question represents values taken at some set of grid points. These points are presumed to be regular in some fashion, for example, the next row of values in the data structure corresponds the next row of the grid, geographically speaking, in some direction, such as the next row to the south. However, if you look at basic satellite remote sensing imagery, the &quot;raw&quot; (that is, sensor-calibrated, but not gridded) raster data usually called Level 1 corresponds to rows of imagery data as seen by the sensor. For example, a sensor might image 10 rows at an east-west swipe, with the next swipe taking in the next 10 rows, and each data pixel has a lat/long pair (on the ground) associated with it. But as the field of view of a satellite-borne sensor widens at the swath edges, the first row of the next swipe might well, at least partially, overlap and intertwine with the last row of the previous swipe. This makes gridding raster data from a satellite-borne sensor non-trivial in practice.\nConversely, &quot;raster&quot; primarily refers to a characteristic of a data structure, that is, a 2D array. If the gridded data is on a non-rectangular grid (such as triangular, hexagonal), it may be stored in a non-raster data structure such as a tree of some sort.\n\n\nIn your case, the main question is not whether you are dealing with &quot;gridded&quot; or &quot;raster&quot; data. Chances are, the data is either gridded or available on a raster with lat/long attributes in each cell and without overlaps and weird artefacts: processed data is usually corrected for this. The main question for you is whether your tools are compatible with the data format you have. \n",
            "excerpt": "However, if you look at basic satellite <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> imagery, the &quot;raw&quot; (that is, sensor-calibrated, but not gridded) raster data usually called Level 1 corresponds to rows of imagery data as seen by &hellip; ",
            "title": "Are &quot;gridded data&quot; and &quot;raster data&quot; the same thing?"
        },
        {
            "tags": [
                "python",
                "remote-sensing",
                "software-recommendations",
                "idl"
            ],
            "question_score": 14,
            "is_accepted": false,
            "answer_id": 85388,
            "is_answered": false,
            "question_id": 85386,
            "item_type": "answer",
            "score": 15,
            "last_activity_date": 1391551520,
            "creation_date": 1391549616,
            "body": "From a remote sensing perspective, the main benefit of IDL is that it extends the capability of ENVI similar to how the Python arcpy site-package extends the functionality of ArcGIS. If you will not have access to the ENVI platform, consider learning a different programming language. Additionally IDL is a commercial product whereas Python is open-source and has a huge support base.\n\nFrom a practical perspective, Python, R (open-source) and MATLAB (commercial) are the most important languages for my day-to-day remote sensing based work.  I use MATLAB for much of the digital image processing, Python for more GIS related tasks and R for graphics/analytical purposes.\n\nFinally, if I had to focus all of my efforts on one language, I would choose to learn Python mainly because Python functionality is much more suited to GIS-related processing in addition to RS based functionality.  In other words, Python is a jack-of-all-trades whereas IDL is not.  Besides, NASA uses Python!    \n",
            "excerpt": "From a <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> perspective, the main benefit of IDL is that it extends the capability of ENVI similar to how the Python arcpy site-package extends the functionality of ArcGIS. &hellip; From a practical perspective, Python, R (open-source) and MATLAB (commercial) are the most important languages for my day-to-day <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> based work. &hellip; ",
            "title": "Recommended programming language for remote sensing?"
        },
        {
            "tags": [
                "remote-sensing"
            ],
            "question_score": 16,
            "is_accepted": true,
            "answer_id": 173631,
            "is_answered": false,
            "question_id": 173610,
            "item_type": "answer",
            "score": 15,
            "last_activity_date": 1499419776,
            "creation_date": 1449956266,
            "body": "It is sometimes difficult to distinguish calibration and correction in remote sensing, because we are not in a laboratory with full control on the measurement. Therefore the two are often mixed.\n\nSensu stricto, radiometric calibration is the conversion from the sensor measurement to a physical quantity. In remote sensing, the sensor is measuring a radiance from the top of the atmosphere. Therefore the image provider also provide calibration coefficients to convert from digit number (DN) to radiance. Because we can trust the amount of light energy that comes from the sun, the radiance is often normalized into a reflectance values (easier to work with because bounded by 0 and one), so this step can also be part of the calibration. So the calibration gives you a reflectance value, but it is the reflectance on top of the atmosphere (TOA).\n\nIndeed, the proportion of the incident light that is really reflected by the observed object is effected by different factors (mainly topography and atmospheric thickness). The reflectances measured TOA therefore need to be corrected if you need absolute values. This does not depend on the sensor itself, so I would not talk about calibration in this case: you need to correct the values measured TOA in order to estimate the values top of canopy. \n\nTo answer your question, I would thus say that DOS is a correction method and DN to TOA reflectance is a calibration. DOS require a stable dark object where you can assume that variability is due to atmospheric noise, which is difficult to find. \n\nEDIT: for more info on Landsat atmospheric correction, I recommend LEDAPS (Masek et al, 2013)\nFor Sentinel-2, different algorithms have been proposed and I cannot give a definitive answer yet. SEN2COR is used a lot, and MAJA is great if you work with time series (also for Landsat, by the way). \n",
            "excerpt": "It is sometimes difficult to distinguish calibration and correction in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>, because we are not in a laboratory with full control on the measurement. Therefore the two are often mixed. &hellip; In <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>, the sensor is measuring a radiance from the top of the atmosphere. Therefore the image provider also provide calibration coefficients to convert from digit number (DN) to radiance. &hellip; ",
            "title": "Difference Between Radiometric calibration and radiometric correction"
        },
        {
            "tags": [
                "open-source-gis"
            ],
            "question_score": 15,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 8,
            "is_answered": true,
            "question_id": 61397,
            "item_type": "question",
            "score": 15,
            "last_activity_date": 1541401750,
            "creation_date": 1369150960,
            "body": "If you judge by the amount of the questions regarding FOSS software that are being asked in GIS SE many users seems to prefer FOSS over proprietary software. \n\nI&#39;ve read some articles - more precisely some personal blogs - supporting this choice. Furthermore corporate giants like Esri seem to acknowledge the open source development movement. \n\nSo, I am asking your position in this matter. \n\nWhy do you use open source tools? \n\nWhat are the advantages or disadvantages of your choice, if any? \n",
            "excerpt": "If you judge by the amount of the questions regarding FOSS software that are being asked in GIS SE many users seems to prefer FOSS over proprietary software. \n\nI&#39;ve read some articles - more precisely &hellip; ",
            "title": "Why choose open source software for remote sensing research?"
        },
        {
            "tags": [
                "remote-sensing",
                "lidar",
                "classification",
                "land-cover",
                "image-segmentation"
            ],
            "question_score": 15,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 124224,
            "item_type": "question",
            "score": 15,
            "last_activity_date": 1458309618,
            "creation_date": 1417557564,
            "body": "I am looking for a method to process a remote sensing image and extract the crown areas of the individual trees from the image. \n\nI have both visual wavelength areal imagery, and lidar data from the area. The location in question is a desert area, so the tree cover isn&#39;t as dense as a forest area. The resolution of the aerial imagery is 0.5 feet by 0.5 feet. The lidar resolution is approximately 1 x 1 feet. Both the visual data and the lidar come from a Pima County, Arizona dataset. A sample of the type of aerial imagery I have is at the end of this post. \n\nThis question Single Tree detection in ArcMap? seems to be the same issue, but there does not seem to be a good answer there.\n\nI can obtain a reasonable classification of the vegetation types (and information about the overall percent cover) in the area by using the Iso Cluster classification in Arcmap, but this provides little information on individual trees. The closest I have to what I want is the results of passing the output of the isocluster classification through the Raster to Polygon feature in Arcmap. The problem is that this method merges near by trees into a single polygon. \n\nEdit: I probably should have included some more detail about what I have. The raw datasets I have are: \n\n\nFull las data, and a tiff raster generated from it.\nVisual imagery (like the sample image shown, but covering a much wider area) \nManual direct measurements of a subset of the trees in the area. \n\n\nFrom these I have generated: \n\n\nThe ground/vegetation classifications.\nThe DEM/DSM rasters.\n\n\n\n",
            "excerpt": "I am looking for a method to process a <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> image and extract the crown areas of the individual trees from the image. &hellip; ",
            "title": "Extracting tree crown areas from remote sensing data (visual images and LiDAR)"
        },
        {
            "tags": [
                "image",
                "landsat",
                "landsat-8",
                "toa-calibration",
                "reflectance"
            ],
            "question_score": 4,
            "is_accepted": true,
            "answer_id": 171458,
            "is_answered": false,
            "question_id": 171453,
            "item_type": "answer",
            "score": 14,
            "last_activity_date": 1448402116,
            "creation_date": 1448402116,
            "body": "NDVI is defined for any two bands with near-infrared and infrared data (it is an empirical remote sensing index). As such, you can calculate it straight from the DNs. This is mostly OK if you are only classifying or analyzing vegetation on a single image without significant atmospheric effects (cirrus clouds...)\n\nHowever, if you are performing change detection (and therefore analysing two or more images), you will need to cope with two steps:\n\n\nRadiometric calibration converts the DNs to radiance using sensor-specific calibration equations. For Landsat, these can be found on the project website or built in most of the good software packages.\nAtmospheric correction tries to convert the radiance to reflectance (a dimensionless number describing the ratio of reflected radiation on the incoming radiation in the specific part of the spectrum). For this, atmosphere models are used such as QUAC or FLAASH.\n\n\nThis answer may provide some suggestions which software to use.\n",
            "excerpt": "NDVI is defined for any two bands with near-infrared and infrared data (it is an empirical <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> index). As such, you can calculate it straight from the DNs. &hellip; ",
            "title": "Is the reflectance required to get the NDVI, for Landsat 8 images?"
        },
        {
            "tags": [
                "qgis",
                "vector",
                "point",
                "line"
            ],
            "question_score": 14,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 45123,
            "item_type": "question",
            "score": 14,
            "last_activity_date": 1539759776,
            "creation_date": 1357231018,
            "body": "I do have two vector layer, of which\none is a point layer based on &quot;events&quot; by remote sensing\nand the second one is a line layer from local research. \n\nIn my case these are earthquakes and tectonic faults, but\nI guess one could simply choose &quot;car-accidents and roads&quot;\nas a general example.\n\nSo what I&#39;d like to do is move/copy the points onto\nthe closest point of the lines, as long as its within a\ntolerance distance (say 1-2km or 0.0xx&#176;), with the new\npoint layer (+attr moved y/n).\n\nAny ideas ?\n\nLinux, QGIS 1.8\n",
            "excerpt": "I do have two vector layer, of which\none is a point layer based on &quot;events&quot; by <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>\nand the second one is a line layer from local research. &hellip; ",
            "title": "Moving points onto lines (~neighborhood)"
        },
        {
            "tags": [
                "python",
                "remote-sensing",
                "software-recommendations",
                "idl"
            ],
            "question_score": 14,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 5,
            "is_answered": true,
            "question_id": 85386,
            "item_type": "question",
            "score": 14,
            "last_activity_date": 1456191272,
            "creation_date": 1391547945,
            "body": "I am beginning studies that hopefully will lead to a long career as a remote sensing specialist.  I am currently working with ArcGIS for some applications and learning ENVI for others.  I have realized that it is imperative that I learn a programming language, and am stuck facing a choice between IDL and Python.  I would love to hear which programming language the community recommends for the remote sensing of land surface processes.\n",
            "excerpt": "I am beginning studies that hopefully will lead to a long career as a <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> specialist.  I am currently working with ArcGIS for some applications and learning ENVI for others. &hellip; I would love to hear which programming language the community recommends for the <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> of land surface processes. &hellip; ",
            "title": "Recommended programming language for remote sensing?"
        },
        {
            "tags": [
                "python",
                "remote-sensing"
            ],
            "question_score": 13,
            "is_accepted": true,
            "answer_id": 93507,
            "is_answered": false,
            "question_id": 93506,
            "item_type": "answer",
            "score": 14,
            "last_activity_date": 1636499013,
            "creation_date": 1397832604,
            "body": "Form the (i)python basis to the more complex manipulation:\nDr M. Disney - Introduction to image data handling \nThese two blog have many examples:\nLuca Congedo  - From GIS to Remote Sensing\nREMOTESENSING.IO web.archive.org:RemoteSensing.io\nThings became more interesting with more spectral bands:\nhttp://www.spectralpython.net/\nAnother book about this topic:\nImage Analysis, Classification and Change Detection in Remote Sensing: With Algorithms for Envi/Idl and Python  by\nMorton J. Canty\n",
            "excerpt": "Disney - Introduction to image data handling \nThese two blog have many examples:\nLuca Congedo  - From GIS to <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>\nREMOTESENSING.IO web.archive.org:RemoteSensing.io\nThings became more interesting &hellip; with more spectral bands:\nhttp://www.spectralpython.net/\nAnother book about this topic:\nImage Analysis, Classification and Change Detection in <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>: With Algorithms for Envi/Idl and Python &hellip; ",
            "title": "Python resource for remote sensing?"
        },
        {
            "tags": [
                "remote-sensing"
            ],
            "question_score": 14,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 9661,
            "item_type": "question",
            "score": 14,
            "last_activity_date": 1359762873,
            "creation_date": 1305332772,
            "body": "What considerations should be taken into account when trying to derive a NDVI from an urban environment? \n\nI pulled a tree canopy layer from LAR-IAC data and used an NDVI of 0.38. However, this FAQ on Vegetation in Remote Sensing recommends using &gt;0.8, while I&#39;ve read &gt;0.6 as a good NDVI for dense vegetation. Is 0.38 too low, and is it possibly lower because of an urban environment (Pasadena, CA)? Should I be using an alternative index, like SAVI (Soil Adjusted Vegetation Index), but maybe for urban areas? \n",
            "excerpt": "However, this FAQ on Vegetation in <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> recommends using &gt;0.8, while I&#39;ve read &gt;0.6 as a good NDVI for dense vegetation. &hellip; ",
            "title": "NDVI in urban environment"
        },
        {
            "tags": [
                "gps",
                "remote-sensing",
                "aerial-photography"
            ],
            "question_score": 9,
            "is_accepted": true,
            "answer_id": 229855,
            "is_answered": false,
            "question_id": 229854,
            "item_type": "answer",
            "score": 13,
            "last_activity_date": 1488036777,
            "creation_date": 1487960154,
            "body": "\n  This question has been converted to Community Wiki and wiki locked\n  because it is an example of a question that seeks a list of answers\n  and appears to be popular enough to protect it from closure.  It\n  should be treated as a special case and should not be viewed as the\n  type of question that is encouraged on this, or any Stack Exchange\n  site, but if you wish to contribute more content to it then feel free\n  to do so by editing this answer.\n\n\n\n\n\nIn What we Do in The Shadows, Stu, a human who hangs out with the vampire main characters, works with GIS. Here is great clip of him explaining what he does. It&#39;s what the actor does for a living in real life, as well.\nEnemy of the State (movie), has many scenes of tracking Will Smith&#39;s character movements via high resolution satellites.\nPatriot Games (1992) has a scene where Jack Ryan (Harrison Ford) is using satellite imagery to locate an IRA training camp in north Africa. Ryan gets the imagery analyst to &quot;zoom in and enhance&quot; and identifies the camp because the enhanced image reveals a womans cleavage.\nIn Man of Steel movie, they used CityEngine, which is a three-dimensional (3D) modeling software application developed by Esri, they transforms 2D Geographic Information System (GIS) data into 3D city models.\nLe Samoura&#239; (1967) (rated 8.1 on IMDB)\n\n\n\n  &quot;a network of undercover police officers track a hitman through the Paris\n  Metro, signaling their locations electronically to one big central map&quot;\n\n\n\nEsri had an embedded expert working on the TV show, The District. \n\n\nMost of the police procedural shows do the zoom-in-on-grainy-security-footage and miraculous clean it up to read a license plate or the reflection of logo on a ball cap. NCIS used to do that all the time. This season at least, the analyst has occasionally said, nope, can&#39;t improve the quality. \n\n\nCriminal Minds has also done simple mapping of crime locations to try to figure out the suspect&#39;s &#39;home range&#39; or the area that he&#39;s comfortable in.\nBones has done analysis of bugs and plants to identify where they came from.\nOf course, there&#39;s Sherlock Holmes who can identify the location of particular type of soil\nTV series Westworld also has many scenes where data is overlayed on a map.  They query the map about people&#39;s locations, paths, zone overlaps, timestamps, etc.  They also have a 3D map with elevation.\nMichael Crichton&#39;s novel &quot;Congo&quot; featured liberal use of Remote Sensing techniques for locating Solomon&#39;s fabled mines and the &quot;lost city of Zinj.&quot;  If you&#39;re teaching a class on film, though, you might not want to show the movie... \nAlso, some of those early episodes of Hawaii Five-O (1960s) feature McGarrett and team doing spatial analysis on a glass whiteboard with a map.  They hand-draw buffers and whatnot.  It&#39;s actually pretty clever.\nNot a movie, but in the TV series The Last Ship episode Eutopia (Season 3, episode 9) they used a system based on What 3 Words to identify the location of a target.  Details and promo video on the W3W website here\nThe Bourne Ultimatum featured scenes where maps are used to track assets and targets. Not sure if the previous movies in the series or the last release The Bourne Legacy had such scenes.\n\n",
            "excerpt": "Michael Crichton&#39;s novel &quot;Congo&quot; featured liberal use of <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> techniques for locating Solomon&#39;s fabled mines and the &quot;lost city of Zinj.&quot; &hellip; ",
            "title": "Examples of GIS or Remote Sensing in movies"
        },
        {
            "tags": [
                "python",
                "remote-sensing"
            ],
            "question_score": 13,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 93506,
            "item_type": "question",
            "score": 13,
            "last_activity_date": 1636499013,
            "creation_date": 1397831937,
            "body": "I am looking for a good resource (MOOC, book, etc..) to teach Python for remote sensing applications.  I am already familiar with http://www.rsgislib.org/ - are there any other resource out there for a beginning Python programmer?\n",
            "excerpt": "I am looking for a good resource (MOOC, book, etc..) to teach Python for <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> applications. &hellip; ",
            "title": "Python resource for remote sensing?"
        },
        {
            "tags": [
                "qgis",
                "raster",
                "vector",
                "clip"
            ],
            "question_score": 68,
            "is_accepted": false,
            "answer_id": 37324,
            "is_answered": false,
            "question_id": 10117,
            "item_type": "answer",
            "score": 13,
            "last_activity_date": 1505859076,
            "creation_date": 1350975184,
            "body": "If you are interested using Python, a good documentation is available at GeospatialPython.com, here.\n\nand clipraster.py source is here.\n\n\n\n\n  The Process:\n  \n  Clipping a raster is a series of simple button clicks in high-end\n  geospatial software packages.  In terms of computing, geospatial\n  images are actually very large, multi-dimensional arrays.  Remote\n  Sensing at its simplest is performing mathematical operations on these\n  arrays to extract information from the data. Behind the scenes here is\n  what the software is doing (give or take a few steps):\n  \n  \n  Convert the vector shapefile to a matrix which can be used as mask\n  Load the geospatial image into a matrix\n  Throw out any image cells outside of the shapefile extent\n  Set all values outside the shapefile boundary to NODATA (null) values\n  OPTIONAL: Perform a histogram stretch on the image for better visualization\n  Save the resulting image as a new raster.\n  \n\n",
            "excerpt": "<span class=\"highlight\">Remote</span>\n  <span class=\"highlight\">Sensing</span> at its simplest is performing mathematical operations on these\n  arrays to extract information from the data. &hellip; ",
            "title": "Clipping raster with vector boundaries using QGIS"
        },
        {
            "tags": [
                "open-source-gis"
            ],
            "question_score": 15,
            "is_accepted": false,
            "answer_id": 61400,
            "is_answered": false,
            "question_id": 61397,
            "item_type": "answer",
            "score": 12,
            "last_activity_date": 1369152099,
            "creation_date": 1369151775,
            "body": "Reasons to use FOSS:\n\n1) It&#39;s free!\n\n2) Ease of access and capabilities - most basic remote sensing tools (e.g. filtering) are available with FOSS, so there is no need to pay for it\n\n3) It&#39;s open - the algorithms you are using aren&#39;t &#39;black-boxed&#39;\n\n4) The ability to add/modify your own tools\n\nalso;\n\n5) Telling people you use FOSS makes you feel cool\n\n6) You enjoy encountering an assortment of interesting bugs and crashes while testing new beta releases\n\n7) You like the elitism of being one of five others using the softwares&#39; user forum\n\n8) Unexpected results are novel\n",
            "excerpt": "2) Ease of access and capabilities - most basic <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> tools (e.g. filtering) are available with FOSS, so there is no need to pay for it\n\n3) It&#39;s open - the algorithms you are using aren&#39;t &#39;black-boxed &hellip; ",
            "title": "Why choose open source software for remote sensing research?"
        },
        {
            "tags": [
                "arcgis-platform",
                "career"
            ],
            "question_score": 5,
            "is_accepted": true,
            "answer_id": 88375,
            "is_answered": false,
            "question_id": 88371,
            "item_type": "answer",
            "score": 12,
            "last_activity_date": 1393887057,
            "creation_date": 1393884756,
            "body": "You&#39;ve really kind of answered your own question here, but I&#39;ll elaborate for the purposes of canonism. I&#39;ll provide you with some ideas based off of specific skills that I often see requested at the GIS jobs clearinghouse.  You can pretty much go two separate routes here (or both simultaneously) and both are pretty wide open:\n\n\n\nBuilding your analysis skills\n\n\n\n\nLearn about rasters. Zonal statistics, DEM/DSM&#39;s, viewshed analysis, local statistics, hydrologic modeling are all branches of Geostatistics, knowledge of which is important for analysis. The Geospatial Data Abstraction Library is a great repository for useful tools and information.\nLearn about remote sensing. I see plenty of job postings asking for expertise in analyzing and managing LiDAR datasets.\nBecome familiar with geocoding, pretty much any entity that keeps address data is usually interested in utilizing geocoding.\n\n\n\n\nBuilding your GIS Developer skills\n\n\n\n\nPython, Python, Python. You&#39;ll hear it over and over again here. This is the GIS scripting language. I used the free courseware from Udacity to learn Python, which I think they do a pretty good job of, but I suggest instead Learn Python the Hard Way.\nIf you want to stick to the ESRI suite, learn C#. At the very least, Microsoft is sticking with this as its go-to language for a very long time. It&#39;s future is more certain than the .NET alternative, VB.NET.\nLearn SQL. For the most part, basic SQL is standardized across all major RDBMS platforms, with all the extra bells and whistles integrated into the special SQL languages such as T-SQL and PL/SQL. Don&#39;t bother with all that yet, if you get the basic standardized language down, you&#39;ll cover 80% of the things you need to do with it and the other 20% you can pick up as you need. W3C has some great simple and straightforward samples to get you started here.\nLearn database architecture. Understand the concepts of normalization and relationships, what primary and foreign keys are, and how to build a database. There are a lot of jobs that involve structuring your GIS data. In the same vein, understanding the underlying structure of geodatabases is key if you want to become a developer in the ESRI suite of products.\nLearn web development. More importantly, learn Javascript. This is a rapidly growing field. I see tons of job postings from businesses that want web GIS applications. There are a few different API&#39;s you can familiarize yourself with. If you want to go open source, two popular ones are OpenLayers and leaflet.js. If you want to stick with ESRI, I wouldn&#39;t go with Flash or Silverlight API&#39;s, I would use Javascript and HTML only. \n\n",
            "excerpt": "Learn about <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>. I see plenty of job postings asking for expertise in analyzing and managing LiDAR datasets. &hellip; ",
            "title": "What are technical skills that a GIS graduate should develop?"
        },
        {
            "tags": [
                "data",
                "gis-principle",
                "boundaries",
                "borders"
            ],
            "question_score": 7,
            "is_accepted": true,
            "answer_id": 411476,
            "is_answered": false,
            "question_id": 411474,
            "item_type": "answer",
            "score": 12,
            "last_activity_date": 1692639807,
            "creation_date": 1631392504,
            "body": "Short answer\nI think you should reevaluate your very concept of &quot;official&quot;, high detailed source for all country borders worldwide. OpenStreetMap data comes close to a worldwide dataset with acceptable level of details for many use cases - however, in each case, this must be evaluated critically.\n&quot;Official&quot; sources for borders\nFor a really &quot;official&quot; source, you would have to check 200 +/- official sources of all +/- 200 existing countries wordlwide. Borders are defined on a bilateral base. The actual delimitation takes place between two neighboring countries. For that reason, there cannot be an &quot;official&quot; registry of all worldwide borders, but at best +/- 200 &quot;national&quot; datasets. There is no international body (like UNO) registering the official definitions of all conturies, this is strictly a matter of bilateral agreements - and in many cases still of custom and practice (customary law) - at least for a precision of less then 100 meters and in more remote areas (deserts, swamps, forests, mountains, lakes etc.).\nSo every insititution that collects these data (like OSM) is not an official source any more by definition. If you really are to get official definitions, you can get them only at the national level.\nWhy it&#39;s difficult (if not impossible) to get a high precision, official dataset of worldwide borders\nTerritorial disputes: contested borders\nIn many cases, not even that does help much. Neighboring countries often have diverging definitions of what belongs to them and what to their neighbors. Georgia and Russia will have different definitions on their borders - not to speak about Crimea or the dispute between Armenia and Azerbaijan (not just about Nagorno Karabakh, but also their &quot;regular&quot; border like in this area).\nThis article makes it clear that no map is precise enough to establish a border - borders are\n\nestablished on the basis of international agreements.\n\nUnmarked segments of (uncontested) borders\nThere are many other cases: the delimitation of the borders between Uzbekistan, Kyrgyzstan and Tajikistan in the Ferghana valley have been an issue for decades now. We not only speak about clear cases of contested territories, but also of generelly undisputed portions of the border that are not delimited: there are many unmarked segments of the border, thus no unanimously shared definition in the terrain (like boundary stone) does exist.\nOnly if both parts sign an agreement that fixes a border in all it&#39;s details (most often still based on real boundary stones put in the terrain by a bilateral commission) can we speak about an &quot;official&quot; border.\nMany borders date back decades (or even centuries), but back then have not been defined very clearly (or there are contradictory sources from different periods so that it remains unclear which one should be considered the &quot;correct&quot; one).\nIn many parts of the world, borders drawn by colonial powers are still source of contestations. See this academic paper on the unresolved delimitation of some central Asian republics, dating back to Russian and Soviet rule: Dr Mirzohid Rahimov &amp; Dr Galina Urazaeva: Central Asian Nations &amp; Border Issues. Conflict Studies Research Centre, 2005.\nSee also the following link where the distintiction between delimited and demarcated borders is explained:\n\n\ndelimited borders: properly fixed, the countries on either side have agreed to the exact physical location of the border, and the\ncoordinates of that physical line have been thoroughly and accurately\ndocumented\n\ndemarcated borders: physically marked on the landscape, with reinforced concrete pillars, anchored by underground footings.\n\n\n\nhttps://www.atlasobscura.com/articles/cameroon-nigeria-border-dispute\nOdd borders\nBorders can date back centuries: see the curious case of a small town on the border of the Netherlands and Belgium with literally dozens of enclaves and exclaves on both side which goes back to medieval times and an agreement from 1843.\nOther oddities, going back centuries, include condominiums like the Pheasant Island, which is part of Spain for the first half of each year and part of France for the second half of the year. Here as well, it&#39;s difficult to draw a 100% exactly border, as it changes over time.\nPeaceful territorial exchanges\nThere are not few cases of peaceful territorial exchanges on the local level ( a few hectares) that normally do not make headlines. These are often tiny adjustments of existing, but not clearly demarcated parts of the border or border segments that create some problems for the infrastructure, economy etc. Examples inclue a territorial exchange between Ukraine and Moldova or Uzbikistan and Kyrgyzstan or others including China. Also the hundreds of enclaves on the border between India and Bangladesh have resulted in border revisions.\nOfficial definition/documentation of borders difficult to access\nAs border zones tend to be a delicate issue for security concerns, many states ar not keen to publish official documentations about this delimitation. There are even cases when maps are deliberately wrong for such reasons - as this post explains for the example of China.\nA map in always all cases is a derivative product that documents one kind or another of border-definitions, but it is not the (legally binding) definition in itself - so to get the &quot;official&quot; source would meen going to the archives (if you have access) to access protocols on the delimitation and demarcation (like the ones of the Kyrgyz-Uzbek borders mentioned here).\nShifting borders or borders not clearly defined\nAnd even today, not even such protocols exist. Many borders are not defined in such a precise way, but are still based on older principles like &quot;in the middle of the river&quot; - riverbeds change, however. There are sections of the border between Switzerland and Italy that are defined as &quot;the ridge of a glacier&quot;. With climate change and melting glaciers, the border changes, too: Melting glacier in Alps shifts border between Switzerland and Italy.\nAs well, there is no agreed definition of the border between Switzerland and Germany in the Lake of Constance - as there is no need for it:\n\nthere is no legally binding agreement as to where the borders lie\nbetween the three countries.\nSee: https://en.wikipedia.org/wiki/Lake_Constance#International_borders\n\nSee also this statement by Swisstopo (Swiss Federal Office of Topography):\n\nOur boundaries can change: Borders are commonly regarded as fixes, but depending on the terrain\nthey are subject to climatological changes and natural phenomena and\nmay thus change their course.\n\nhttps://www.swisstopo.admin.ch/en/knowledge-facts/sovereign-border/national-boundary/moving-boundaries.html\nSo even in the middle of Europe with it&#39;s sophisticated administrative institutions, high precision cartographic technologies, need for clear definitions in a denseily populated area and centuries-long tradition of border delimitation, borders to this day sometimes are still not defined &quot;on the meter&quot;. This is even more true for many parts of the world.\nCritical evalution of the very concept of &quot;official&quot;, detailed border\nSo I&#39;m not sure if the very concept you&#39;re after does makes sense. With no dataset you&#39;ll get a guarantee that it is correct or generally accepted. The more &quot;official&quot; and detailed the data gets, the more you&#39;ll get an illusion of precision and accuracy that in fact does not exist.\n",
            "excerpt": "definitions of all conturies, this is strictly a matter of bilateral agreements - and in many cases still of custom and practice (customary law) - at least for a precision of less then 100 meters and in more <span class=\"highlight\">remote</span> &hellip; Critical evalution of the very concept of &quot;official&quot;, detailed border\nSo I&#39;m not sure if the very concept you&#39;re after does makes <span class=\"highlight\">sense</span>. &hellip; ",
            "title": "Higher resolution of country borders"
        },
        {
            "tags": [
                "open-source-gis",
                "software-recommendations",
                "free-software"
            ],
            "question_score": 142,
            "is_accepted": false,
            "answer_id": 71443,
            "is_answered": false,
            "question_id": 12105,
            "item_type": "answer",
            "score": 12,
            "last_activity_date": 1379094525,
            "creation_date": 1379094525,
            "body": "Whitebox Geospatial Analysis Tools (http://www.uoguelph.ca/~hydrogeo/Whitebox/) is an open-source GIS and remote sensing package that has extensive analytical capabilities. It runs on MS Windows, Mac OSX, and Linux. It has a user-friendly and intuitive user interface, extensive embedded help, and the ability to make cartographically pleasing maps.\n\n\n",
            "excerpt": "Whitebox Geospatial Analysis Tools (http://www.uoguelph.ca/~hydrogeo/Whitebox/) is an open-source GIS and <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> package that has extensive analytical capabilities. &hellip; ",
            "title": "What free programs should every GIS user have installed?"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcgis-10.0",
                "dem",
                "rasterization",
                "hydrography"
            ],
            "question_score": 15,
            "is_accepted": false,
            "answer_id": 18597,
            "is_answered": false,
            "question_id": 18595,
            "item_type": "answer",
            "score": 12,
            "last_activity_date": 1326073482,
            "creation_date": 1326073482,
            "body": "Whitebox GAT (open-source hydrology and remote sensing package) has a method by this name in its Hydrology utilities. Whitebox is unique in that it exposes the source code and algorithms used by the analysis via the UI (note the View Code button). Even if you intend to isolate your procedures to ArcGIS, there may be some benefits to experimenting with another flavor.\n\n\n",
            "excerpt": "Whitebox GAT (open-source hydrology and <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> package) has a method by this name in its Hydrology utilities. &hellip; ",
            "title": "Burning stream network into DEM layer using ArcGIS Desktop?"
        },
        {
            "tags": [
                "python",
                "gdal",
                "remote-sensing"
            ],
            "question_score": 12,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 142123,
            "item_type": "question",
            "score": 12,
            "last_activity_date": 1515442746,
            "creation_date": 1428658603,
            "body": "I am struggling with a processing and hopefully I will be able to solve here.\n\nI work with Remote Sensing applied to Forestry, especially working with LiDAR data. The idea is to use Scikit-image for tree top detection. Since I&#39;m new in Python, I considered a great personal triumph to do the following:\n\n\nImport a CHM (with matplotlib);\nRun a gaussian filter (with scikit-image package);\nRun a maxima filter (with scikit-image package);\nRun the peak_local_max (with scikit-image package);\nShow the CHM with the local maxima (with matplotlib);\n\n\nNow my problem. When I import with matplot, the image loses its geographic coordinates. So the coordinates I have are just basic image coordinates (i.e. 250,312). What I need is to get the value of the pixel under the local maxima dot in the image (red dots in the image). Here in the forum I saw one guy asking the same thing (Getting pixel value of GDAL raster under OGR point without NumPy?), but he already had the points in a shapefile. In my case the points were computed with scikit-image (It is an array with the coordinates of each tree top). So I do not have the shapefile.\n\nIn conclusion, what I want in the end is a txt file with the coordinates of each local maxima in geographic coordinates, for example:\n\n525412 62980123 1150\n...\n\n\n",
            "excerpt": "I work with <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> applied to Forestry, especially working with LiDAR data. The idea is to use Scikit-image for tree top detection. &hellip; ",
            "title": "Image processing using Python, GDAL and Scikit-Image"
        },
        {
            "tags": [
                "software-recommendations",
                "classification",
                "free-software"
            ],
            "question_score": 16,
            "is_accepted": true,
            "answer_id": 21747,
            "is_answered": false,
            "question_id": 11708,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1331764817,
            "creation_date": 1331764817,
            "body": "You might want to try Orfeo Toolbox.\n\n\n  OTB is based on the medical image processing library ITK and offers\n  particular functionalities for remote sensing image processing in\n  general and for high spatial resolution images in particular. Targeted\n  algorithms for high resolution optical images (SPOT, Quickbird,\n  Worldview, Landsat, Ikonos), hyperspectral sensors (Hyperion) or SAR\n  (TerraSarX, ERS, Palsar) are available.\n\n\nAmong it&#39;s documented capabilities are:\n\n\noptimized read/write access for most of remote sensing image formats, meta-data access, visualization;\nstandard remote sensing preprocessing: radiometric corrections, orthorectification;\nfiltering: blurring, denoising, enhancement;\nfeature extraction: interest points, alignments, lines;\nimage segmentation: region growing, watershed, level sets\nclassification: K-means, SVM, Markov random fields;\nchange detection;\ninformation extraction for integration in GIS and mapping systems.\n\n",
            "excerpt": "OTB is based on the medical image processing library ITK and offers\n  particular functionalities for <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> image processing in\n  general and for high spatial resolution images in particular. &hellip; Among it&#39;s documented capabilities are:\n\n\noptimized read/write access for most of <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> image formats, meta-data access, visualization;\nstandard <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> preprocessing: radiometric corrections &hellip; ",
            "title": "Freeware alternatives to eCognition?"
        },
        {
            "tags": [
                "remote-sensing",
                "erdas-imagine",
                "envi"
            ],
            "question_score": 6,
            "is_accepted": true,
            "answer_id": 34412,
            "is_answered": false,
            "question_id": 34411,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1348759346,
            "creation_date": 1348759346,
            "body": "You can&#39;t &#39;remove&#39; clouds from optical imagery, what you see is what you get; they are photographs and there is no optical data recorded from below the clouds in the same way that there is no data underneath building roofs.\n\nIf you use remote sensing data of a longer wavelength than light such as microwave, the water particles in the clouds do not absorb the energy from the sensor, but this type of platform is typically of a lower spatial resolution than optical imagery, and is consequently used for different tasks, such as soil moisture estimation and surface roughness estimation.\n\nThe only solution as such is to try to find a satellite pass without clouds and combine all the clear segments of your study area to make a full clear coverage.\n",
            "excerpt": "If you use <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> data of a longer wavelength than light such as microwave, the water particles in the clouds do not absorb the energy from the sensor, but this type of platform is typically of &hellip; ",
            "title": "How to remove clouds in High resolution Imagery(.5 mGeoeye)"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcmap",
                "topology",
                "change-detection",
                "differences"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 54220,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1603437405,
            "creation_date": 1363102792,
            "body": "I have two polygon shapefiles of the same region from two different years (1985 and 1997) and I need to analyse the differences between the two shapefiles resulting in a third polygon shapefile displaying only differences.\nThe shapefiles cover an inner-city area with buildings, parks, sealed/unsealed areas and water areas. I need to find out for example if a building was de-/constructed or if a park was moved or closed or similar things. Any differences between the shapes.\nI need the output to be in a third, new shapefile.\nIs there an automated way to achieve this?\nI am working with the proprietary file geodatabase in ArcGIS 10.1, so I&#39;d prefer solutions in ArcMap.\nI thought it might be possible to work with topology analysis in ArcGIS but I&#39;m not quite sure for example how to compare shapes by attributes: Each shape has a field &quot;type&quot; in the attribute table and I need to compare not only the shapes but the types of the polygons.\nNote, Finding differences between shapefiles using ArcGIS for Desktop? sounds similar, but I&#39;m looking for an output in a polygon shapefile format.\nThis is a change detection process on vector data (no remote sensing issue). There are some nice comments in this answer but no solutions at all.\n",
            "excerpt": "This is a change detection process on vector data (no <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> issue). There are some nice comments in this answer but no solutions at all. &hellip; ",
            "title": "Analyzing differences between two shapefiles to put results into new shapefile using ArcMap"
        },
        {
            "tags": [
                "modis"
            ],
            "question_score": 2,
            "is_accepted": false,
            "answer_id": 72537,
            "is_answered": false,
            "question_id": 72524,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1380161269,
            "creation_date": 1380161269,
            "body": "Information on how to convert the digital values (&quot;digital numbers&quot; or DN) in satellite remote sensing data that is operationally produced and distributed into physical quantities of interest is generally found in the data user guide. In this case, you need the user guide for the MODIS 11 Level 2 product. Under &quot;scientific data sets (SDS&quot; there is a table that contains the relevant information for the land surface temperature:\n\n\n\n&quot;Scale factor&quot; and &quot;add offset&quot; are used for a linear re-scaling of the DN values (which are going to be between 7500 and 65535) to temperatures in K. As the page explains:\n\n\n  The effective calibration formula for the &quot;LST&quot; SDS is \n         LST = the SDS data in uint16 * 0.02, giving a value in the range of 150-1310.7K.\n\n\nSo the person who gave you advice was almost right: Temperature in &#176;C will be:\n.\n",
            "excerpt": "Information on how to convert the digital values (&quot;digital numbers&quot; or DN) in satellite <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> data that is operationally produced and distributed into physical quantities of interest is generally &hellip; ",
            "title": "How do I convert the LST values on the MODIS LST Image to degree celsius"
        },
        {
            "tags": [
                "raster",
                "r",
                "statistics",
                "accuracy"
            ],
            "question_score": 8,
            "is_accepted": true,
            "answer_id": 110269,
            "is_answered": false,
            "question_id": 110188,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1408603966,
            "creation_date": 1407847924,
            "body": "kappa does not quantifies the level of agreement between two datasets. It represents the level of agreement of two dataset corrected by chance. \n\nThe reason why you have a large difference between kappa and overall accuracy is that one of the classes (class 1) accounts for the large majority of your map, and this class is well described. Overall accuracy is therefore an optimistic index of the classifier performance, even if it is the true &quot;agreement&quot; in your case. As a trivial example, if I give you a map that says &quot;class 1&quot; everywhere, it will be 99% correct. Similarly, if 99% of the pixels are randomly assigned to &quot;class 1&quot;, the resulting map will still have a large agreement with your map. This is what kappa penalize with its &quot;c&quot; in the expression below (note that there are different kappa&#39;s, here is the most common). \n\nkappa = (OA-c)/(1-c), where e is the overall probability of random agreement\n\nOn your confusion matrix, you can see that classes 5 and 6 are always wrong and class 2 is not very reliable. This will have a large impact on your kappa index and this explains the large difference. The classifier is not better than chance for these classes. \n\nAs a remark, standard OA and kappa DO NOT take the distance between classes into account, so the fact that classes 5 and 6 are far off does not affect your results for any of those indices. Therefore, I suggest that you take advantage of the fact that your classes refer to quantities. The correlation between the two map could therefore make a good indicator. A confusion between 1 and 6 would then have more importance than a confusion between 1 and 2. Another way is to look at each class individually (user and producer accuracies). \n\nI do not agree on the fact that Kappa is largely considered to be more robust than OA. According to Pontius (2011), kappa has not provided the useful information that it is supposed to bring. \n\nEDIT : More recently, Olofsson, Foody, Herold, Stehman, Woodcock and Wulder (2014, Remote sensing of Environment) also advocated against kappa. Considering the importance of those authors, I would follow their recommendations.\n\n\n  The problems associated with kappa include but are not limited to: 1)\n  the correction for hypothetical chance agreement produces a measure\n  that is not descriptive of the accuracy a user of the map would\n  encounter (kappa would underestimate the probability that a randomly\n  selected pixel is correctly classified); 2) the correction for chance\n  agreement used in the common formulation of kappa is based on an\n  assumption of random chance that is not reasonable because it uses the\n  map marginal proportions of area in the definition of chance agreement\n  and these proportions are clearly not simply random; and 3) kappa is\n  highly correlatedwith overall accuracy so reporting kappa is redundant\n  with overall accuracy.” (Foody, 1992; Liu et al., 2007; Pontius\n  &amp;Millones, 2011; Stehman, 1997). Consistentwith the recommendation in\n  Strahler et al. (2006) the use of kappa is strongly discouraged as,\n  despite its widespread use, it actually does not serve a useful role\n  in accuracy assessment or area estimation.\n\n",
            "excerpt": "EDIT : More recently, Olofsson, Foody, Herold, Stehman, Woodcock and Wulder (2014, <span class=\"highlight\">Remote</span> <span class=\"highlight\">sensing</span> of Environment) also advocated against kappa. &hellip; ",
            "title": "How are kappa and overall accuracy related with respect to thematic raster data?"
        },
        {
            "tags": [
                "remote-sensing",
                "modis"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 73838,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1506340107,
            "creation_date": 1381310773,
            "body": "To define relative spectral response, I referred to EFFECT OF RELATIVE SPECTRAL\nRESPONSE ON MULTI-SPECTRAL MEASUREMENTS AND NDVI FROM DIFFERENT REMOTE SENSING SYSTEMS by David James Fleming, 2006.\n\n\n  One factor that is often overlooked is the effect of a sensor’s\n  relative spectral response (RSR), or spectral response function (SRF),\n  on broadband spectral measurements. The RSR describes the quantum\n  efficiency of a sensor at specific wavelengths over the range of a\n  spectral band. Currently, general descriptors, such as bandwidth and\n  average bandpass, are often the only spectral characteristics\n  considered in analysis of sensor spectral measurements. However,\n  cross-sensor wavelength variations in RSR can lead to measurement\n  discrepancies between sensor measurements that make them not directly\n  comparable (Teillet et al., 1997). In order to provide consistent\n  quantitative spectral measurements of vegetation land cover and\n  derived metrics, such as spectral vegetation indices, the effect of a\n  sensor’s SRF must be considered and understood.\n  \n  [...]\n  \n  Spectral bands are often generalized (Pagnutti et al., 2003) in terms\n  of full width at half maximum bandwidth and central wavelength\n  corresponding to the maximum value of the response function (Liang,\n  2004) as shown in Figure 11.\n\n\n\n\nIn view of this, I was a bit surprised that, for example, the bandwidth of MODIS band 7 (dotted line) as defined here, seems to not match with the relative spectral response in the way defined above. \n\n\nIs my understanding of these concepts incorrect?\n",
            "excerpt": "To define relative spectral response, I referred to EFFECT OF RELATIVE SPECTRAL\nRESPONSE ON MULTI-SPECTRAL MEASUREMENTS AND NDVI FROM DIFFERENT <span class=\"highlight\">REMOTE</span> <span class=\"highlight\">SENSING</span> SYSTEMS by David James Fleming, 2006. &hellip; ",
            "title": "How do you explain that band width and relative spectral response of MODIS band do not match?"
        },
        {
            "tags": [
                "open-source-gis",
                "lidar",
                "software-recommendations"
            ],
            "question_score": 27,
            "is_accepted": false,
            "answer_id": 112615,
            "is_answered": false,
            "question_id": 31472,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1410194186,
            "creation_date": 1409752726,
            "body": "I develop an open-source GIS called Whitebox Geospatial Analysis Tools that can be used to perform a range of tasks geared towards processing LiDAR data. It works with the popular LAS file format as well as shapefiles. The software can be used to interpolate raster grids, including bare-Earth DEMs and vegetation canopy models. Many of the interpolators are specifically developed to handle LiDAR data. It can also be used to examine LAS metadata, convert LAS files into ASCII or shapefile formats, tile LiDAR data, and assess point density. There are many tools available in Whitebox for analyzing LiDAR interpolated DEM files as well. This includes everything from typical digital terrain analysis operations (slope, aspect, measures of relative landscape position, etc.), hydrological analysis (e.g. extract watersheds and map streams), removal of off-terrain objects, filling in missing data holes, etc. For more information, I have a blog that describes the use of Whitebox for processing LiDAR data here. I teach GIS and remote sensing courses and have used Whitebox in LiDAR labs before. Here is an example (though dated now) lab assignment that you may find useful as well. I&#39;m fairly responsive to requests, so if there are some LiDAR related analysis functions that aren&#39;t currently in there, send me a request and I&#39;ll add it to my To-Do list. One current limitation is that Whitebox doesn&#39;t contain a 3D point cloud viewer. I&#39;m working on this, but if point cloud visualization is your main interest, then at the moment, you&#39;d be better looking at something like plas.io.\n\n\n\nLAS files can now be natively displayed within Whitebox&#39;s map area:\n\n\n\n\n",
            "excerpt": "I teach GIS and <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> courses and have used Whitebox in LiDAR labs before. Here is an example (though dated now) lab assignment that you may find useful as well. &hellip; ",
            "title": "Working with LiDAR data using other than Esri software?"
        },
        {
            "tags": [
                "qgis",
                "remote-sensing",
                "fme-form",
                "feature-extraction"
            ],
            "question_score": 11,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 126994,
            "item_type": "question",
            "score": 11,
            "last_activity_date": 1421069264,
            "creation_date": 1418854762,
            "body": "Given an area with depressions in open area from; say all terrain vehicles driving on soft surface. The vehicles will cause parallel depressions (paths) of about 10-20 centimeters in depth and around 15-30 cms in width, with lengths varying with the robustness of the surface.\n\n\nWhich remote sensing platforms would be relevant for later analysis? Quickbird, smaller drones, lidar, aerial photography?\nAre there any available procedures in tools (FME/QGIS/ESRI/other)\nwhich can be used to document the paths?\n\n\nLet us for the sake of simplifying this question assume that we positively know that there are no other paths in the area, or that they have been filtered out of the imagery.\n\nFull automation is not necessary, and probably not even possible.\n\nThis is an example of what tracks would look like.\n\n",
            "excerpt": "Which <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> platforms would be relevant for later analysis? Quickbird, smaller drones, lidar, aerial photography? &hellip; ",
            "title": "Automated detection of tracks"
        },
        {
            "tags": [
                "remote-sensing",
                "lidar",
                "classification",
                "land-cover",
                "image-segmentation"
            ],
            "question_score": 15,
            "is_accepted": true,
            "answer_id": 124370,
            "is_answered": false,
            "question_id": 124224,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1417646374,
            "creation_date": 1417641013,
            "body": "There is a considerable body of literature on individual crown detection in spectral and lidar data. Methods wise, perhaps start with: \n\nFalkowski, M.J., A.M.S. Smith, P.E. Gessler, A.T. Hudak, L.A. Vierling and J.S. Evans. (2008). The influence of conifer forest canopy cover on the accuracy of two individual tree measurement algorithms using lidar data. Canadian Journal of Remote Sensing 34(2):338-350.  \n\nSmith A.M.S., E.K. Strand, C.M. Steele, D.B. Hann, S.R. Garrity, M.J. Falkowski, J.S. Evans (2008) Production of vegetation spatial-structure maps by per-object analysis of juniper encroachment in multi-temporal aerial photographs. Canadian Journal Remote Sensing 34(2):268-285\n\nIf you are interested in the Wavelet method (Smith et al., 2008), I have it coded in Python but, it is very slow. If you have Matlab experience, this is where it is implemented in production mode. We have two papers where we identified ~6 million acres of juniper encroachment in eastern Oregon using the wavelet method with NAIP RGB-NIR imagery so, it is well proven. \n\nBaruch-Mordo, S., J.S. Evans, J. Severson, J. D. Naugle, J. Kiesecker, J. Maestas, and M.J. Falkowski (2013) Saving sage-grouse from the trees: A proactive solution to reducing a key threat to a candidate species Biological Conservation 167:233-241 \n\nPoznanovic, A.J., M.J. Falkowski, A.L. Maclean, and J.S. Evans (2014) An Accuracy Assessment of Tree Detection Algorithms in Juniper Woodlands. Photogrammetric Engineering &amp; Remote Sensing 80(5):627–637  \n\nThere are some interesting approaches, in general object decomposition, from the applied mathematics state space literature using multiresolution Gaussian processes to decompose object characteristics across scale. I use these types of models to describe multi-scale process in ecological models but it could be adapted to decompose image object characteristics. Fun, but a bit esoteric.    \n\nGramacy, R.B., and H.K.H. Lee (2008) Bayesian treed Gaussian process models with an application to computer modeling. Journal of the American Statistical Association, 103(483):1119–1130\n\nKim, H.M., B.K. Mallick, and C.C. Holmes (2005) Analyzing nonstationary spatial data using piecewise Gaussian processes. Journal of the American Statistical Association, 100(470):653–668\n",
            "excerpt": "Canadian Journal of <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> 34(2):338-350.  \n\nSmith A.M.S., E.K. Strand, C.M. Steele, D.B. Hann, S.R. Garrity, M.J. Falkowski, J.S. &hellip; Canadian Journal <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> 34(2):268-285\n\nIf you are interested in the Wavelet method (Smith et al., 2008), I have it coded in Python but, it is very slow. &hellip; ",
            "title": "Extracting tree crown areas from remote sensing data (visual images and LiDAR)"
        },
        {
            "tags": [
                "remote-sensing",
                "aerial-photography",
                "reflectance",
                "waterways",
                "hyperspectral-sensor"
            ],
            "question_score": 10,
            "is_accepted": false,
            "answer_id": 222557,
            "is_answered": false,
            "question_id": 222554,
            "item_type": "answer",
            "score": 11,
            "last_activity_date": 1484320564,
            "creation_date": 1482710451,
            "body": "I&#39;ve found two sources that appear to provide easy to read explanation between Radiance vs. Irradiance and remote sensing reflectance and water leaving radiance.\nStarting with Radiance vs. Irradiance:\n\nIrradiance is simple: exchange of energy (in the form of photons) across a given area of flat surface per time. Radiance is more complicated: exchange of energy (in the form of photons) across a given area of flat surface per time and then divided by the amount of steradians from which the &quot;given area&quot; is collecting light.\n\nThe author uses two figures to discuss Radiance and Irradiance with respect to Illuminance.\n\n\nAlso, a good reference may be The Light Handbook provides additional information.\nIn terms of remote sensing reflectance and water leaving radiance\nThis comment here\n\nRemote sensing reflectance (Rrs) contains the spectral colour information of the water body (below the sea surface). Rrs is the ratio between water-leaving radiance (Lw, above the sea surface) and downwelling irradiance (Ed, above the sea surface). Lw can be estimated from above-water radiometric measurements, in this case reflected skylight must be removed using a &quot;surface reflectance factor&quot; (rho).\nFurther comment: In ocean colour, often the term &quot;water-leaving reflectance&quot; (rho_w) is used instead of Rrs. The difference is:  rho_w = pi*Rrs (with related change in units)\n\nIllustration of light rays contributing to the irradiance reflectance\n\nIllustration of light rays contributing to the remote-sensing reflectance\n\n",
            "excerpt": "Irradiance and <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> reflectance and water leaving radiance.\nStarting with Radiance vs. &hellip; In terms of <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> reflectance and water leaving radiance\nThis comment here\n\n<span class=\"highlight\">Remote</span> <span class=\"highlight\">sensing</span> reflectance (Rrs) contains the spectral colour information of the water body (below the sea surface). &hellip; ",
            "title": "Difference between irradiance and radiance, remote sensing reflectance and water leaving radiance"
        },
        {
            "tags": [
                "research"
            ],
            "question_score": 44,
            "is_accepted": false,
            "answer_id": 65080,
            "is_answered": false,
            "question_id": 64791,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1465717573,
            "creation_date": 1372793054,
            "body": "My perspective is skewed toward the U.S., but both the AAG and AGU conferences heavily feature the bread and butter of GIS: spatial analysis, remote sensing, spatial statistics, cartographic methods, geographic demography and others. at AAG in particular it is a minority of sessions that do not feature GIS (the toolkit), and there are dozens of sessions on GIS (the science/perspective).\n\nGIScience publishing for maximum cred is fairly venue-agnostic. Conference papers have a fairly equal value with journal pubs when tenure is being considered.\n",
            "excerpt": "My perspective is skewed toward the U.S., but both the AAG and AGU conferences heavily feature the bread and butter of GIS: spatial analysis, <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>, spatial statistics, cartographic methods, geographic &hellip; ",
            "title": "Seeking top tier conference in GIScience?"
        },
        {
            "tags": [
                "remote-sensing",
                "digital-image-processing",
                "landsat-8",
                "pansharpening"
            ],
            "question_score": 12,
            "is_accepted": false,
            "answer_id": 228261,
            "is_answered": false,
            "question_id": 228260,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1487022747,
            "creation_date": 1487008888,
            "body": "Fundamentally the question here is &quot;what does &#39;scientifically valid&#39; mean&quot;. If you are looking to do spectral modelling on the data, then the answer is possibly different than if you are looking at doing classification / image segmentation. Pansharpening (depending on the method) is simply going to change the range of the values a fairly small amount and shouldn&#39;t put your reflectance values outside the realm of possibility.\n\nAll in all, it depends a lot on what application you are going to be using the data for. Furthermore, the impact of pansharpening may also be worth documenting as a partial side result in whatever study you are performing. The result may be that it doesn&#39;t add anything, except four times as many pixels, meaning four times as long a processing time, which in some cases is a showstopper.\n\nEdit: My database of articles on this topic is not huge, but I have these two where pansharpend data is used (with reasonable results) for image segmentation:\n\nShackelford, A. K., &amp; Davis, C. H. (2003). A combined fuzzy pixel-based and object-based approach for classification of high-resolution multispectral data over urban areas. IEEE Transactions on Geoscience and Remote Sensing, 41(10), 2354–2364. http://doi.org/10.1109/TGRS.2003.815972\n\nFern&#225;ndez, I., Aguilar, F. J., Aguilar, M. A., &amp; &#193;lvarez, M. F. (2014). Influence of Data Source and Training Size on Impervious Surface Areas Classification Using VHR Satellite and Aerial Imagery Through an Object-Based Approach. IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing, 7(12), 4681–4691.\n",
            "excerpt": "IEEE Transactions on Geoscience and <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>, 41(10), 2354–2364. http://doi.org/10.1109/TGRS.2003.815972\n\nFern&#225;ndez, I., Aguilar, F. J., Aguilar, M. A., &amp; &#193;lvarez, M. F. (2014). &hellip; IEEE Journal of Selected Topics in Applied Earth Observations and <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>, 7(12), 4681–4691. &hellip; ",
            "title": "Is it scientifically correct to pansharpen landsat reflectance product with pan band"
        },
        {
            "tags": [
                "remote-sensing",
                "aerial-photography",
                "reflectance",
                "waterways",
                "hyperspectral-sensor"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 222554,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1561702442,
            "creation_date": 1482707082,
            "body": "I&#39;ve been trying to lay my hands on textbooks, etc, that explain the differences between the remote sensing terms in lay man language.\n\n\n\nJust wondering if anybody can point me the right direction or shed more light on those terms.\n",
            "excerpt": "I&#39;ve been trying to lay my hands on textbooks, etc, that explain the differences between the <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> terms in lay man language. &hellip; radiance and irradiance\n<span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> reflectance and water leaving radiance\n\n\nJust wondering if anybody can point me the right direction or shed more light on those terms. &hellip; ",
            "title": "Difference between irradiance and radiance, remote sensing reflectance and water leaving radiance"
        },
        {
            "tags": [
                "python",
                "remote-sensing",
                "satellite",
                "envi"
            ],
            "question_score": 30,
            "is_accepted": false,
            "answer_id": 21647,
            "is_answered": false,
            "question_id": 21378,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1331630488,
            "creation_date": 1331630488,
            "body": "I am afraid satisfying roof detection cannot be achieved with only one single satellite image. You should try to use other sources of information.\n\nThe following article describes a method using a DEM + aerial image pairs + cadastral data:\n\nM. Durupt, F. Taillandier. Automatic Building Reconstruction from a Digital Elevation Model and Cadastral Data: An Operational Approach. International Archives of Photogrammetry, Remote Sensing and Spatial Information Sciences. Vol. 36 (Part 3), Bonn, Germany, September 2006.\n\nSee also other papers in the bibliography section (like that one).\n\nI suspect such methods are not implemented in python opensource softwares.\n",
            "excerpt": "International Archives of Photogrammetry, <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> and Spatial Information Sciences. Vol. 36 (Part 3), Bonn, Germany, September 2006. &hellip; ",
            "title": "OpenSource Remote Sensing Tools for Classifying Roofs"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcgis-9.3",
                "classification"
            ],
            "question_score": 4,
            "is_accepted": true,
            "answer_id": 38854,
            "is_answered": false,
            "question_id": 37830,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1351599341,
            "creation_date": 1351580132,
            "body": "I have tried supervised classification in ArcGIS.\n\nFirstly I would say that it is not the best software for classification.\n\nAs I did it, you can create training sites as points. Just create a shapefile (or geodatabase), add Integer field, click points over your image and assign classes as numbers. (I think you can also use polygon shapefile).\n\n\n\nFor signatures, go to ArcToolbox &gt; Spatial Analyst Tools &gt; Multivariate &gt; Create Signatures. There just put your bands and training points. \n\n\n\nArcGIS doesn&#39;t show you the resulting signature file, however it is ASCII file and you can look inside, for example using Notepad++. For each band you can see something like this:\n\n\n\nIf you wish, you can plot the Means manually to see if they are separated, for example in Excel.\n\nYou can do a dendrogram for your classes Spatial Analyst Tools &gt; Multivariate &gt; Dendrogram.\n\n\n\nThen you do actually classification Multivariate &gt; Maximum Likelihood Classification. There you have only two tunable options: to say, how much uncertain pixels will remain unclassified (rejected), and probability weighting for classes; and request a confidence raster.\n\n\n\nAnd the result looks like this:\n\n\n\nFor theorical information check classification help and signature help.\n\nActually, after several attempts I switched to Remote Sensing software.\n",
            "excerpt": "Actually, after several attempts I switched to <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> software. &hellip; ",
            "title": "Training signature file for supervised classification in ArcGIS Desktop?"
        },
        {
            "tags": [
                "python",
                "analysis",
                "viewshed",
                "jupyter-notebook",
                "raster-dataset"
            ],
            "question_score": 7,
            "is_accepted": false,
            "answer_id": 409035,
            "is_answered": false,
            "question_id": 409013,
            "item_type": "answer",
            "score": 10,
            "last_activity_date": 1629796429,
            "creation_date": 1629796429,
            "body": "The easiest way to calculate a visibility raster in python is to call the ad hoc functions of a GIS from your code. This can be done in several ways (non-exhaustive list):\n\nUsing the r.viewshed module from grass\nUsing the visibility module of saga GIS\nUsing the gdal_viewshed function from gdal.\n\nDepending on the tool chosen, the method of calling will be slightly different. You should therefore look at the api documentation to know how to do this in detail. Here are some links that may help to do this:\n\nGrass and Python: https://grasswiki.osgeo.org/wiki/GRASS_and_Python\nSAGA GIS API for Python: http://www.saga-gis.org/saga_api_python/index.html\nPython bidings for gdal_viewshed: https://github.com/jonnyhuck/Viewshed\n\nAn other solution is to write directly an algorithm of visibility. The easiest way to do this is to implement the algorithms that have been used in the tools included in the GIS. For example r.viewshed use an algorithm write by Haverkort, Toma and Zhuan, presented in the documentation and in this research paper :\n\nHaverkort, H.,Toma L. and Zhuang Y. Computing Visibility on Terrains in External Memory. In the Proceedings of the 9th Workshop on Algorithm Engineering and Experiments / Workshop on Analytic Algorithms and Combinatoric. http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.76.4282&amp;rep=rep1&amp;type=pdf.\n\ngdal_viewshed use a Wang, Robinson and White algorithm, presented in this research paper :\n\nWang, Jianjun, Robinson, Gary J., and White, Kevin, Generating Viewsheds without Using Sightlines. Photogrammetric Engineering and Remote Sensing. https://www.asprs.org/wp-content/uploads/pers/2000journal/january/2000_jan_87-90.pdf\n\nYou can also use the Pixscape algorithm, prensented here:\n\nSahraoui, Y, Vuidel, G, Joly, D, Folt&#234;te, J-C. Integrated GIS software for computing landscape visibility metrics. Transactions in GIS. 2018; 22: 1309– 1323. https://doi.org/10.1111/tgis.12457\n\n",
            "excerpt": "Photogrammetric Engineering and <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>. https://www.asprs.org/wp-content/uploads/pers/2000journal/january/2000_jan_87-90.pdf\n\nYou can also use the Pixscape algorithm, prensented here:\n\nSahraoui &hellip; ",
            "title": "Raster data viewshed analysis with Python"
        },
        {
            "tags": [
                "resolution",
                "terminology"
            ],
            "question_score": 10,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 397523,
            "item_type": "question",
            "score": 10,
            "last_activity_date": 1685622223,
            "creation_date": 1621842218,
            "body": "In research papers on remote sensing, I see some authors referring to spatial resolution (expressed as pixel/distance) and others to Ground Sampling Distance (GSD) (also expressed as pixel/distance). Why would you use one over the other, and what is the actual difference between GSD and spatial resolution?\nI found this explanation by Pix4D, but as far as I can tell, GSD and spatial resolution can be used interchangeably.\n",
            "excerpt": "In research papers on <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>, I see some authors referring to spatial resolution (expressed as pixel/distance) and others to Ground Sampling Distance (GSD) (also expressed as pixel/distance). &hellip; ",
            "title": "What is the difference between Ground Sampling Distance (GSD) and spatial resolution?"
        },
        {
            "tags": [
                "education",
                "career",
                "belarus"
            ],
            "question_score": 15,
            "is_accepted": false,
            "answer_id": 83230,
            "is_answered": false,
            "question_id": 83211,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1389886815,
            "creation_date": 1389882420,
            "body": "Pursuing a MS is dependent upon your goals.  If you are interested in conducting scientific research, a MS (or PhD) is for you.  Having a MS opens doors in academia that would not normally exist with a BS.  For example, these are the education requirements for a mid-level research position in academia:  \n\n\n  Master’s degree (or higher) in remote sensing, GIS, oceanography, or\n  related degree including a strong background in statistics,\n  mathematics, computer science, and/or engineering, and 2 years of\n  experience. \n  \n  OR \n  \n  Bachelor’s degree in remote sensing, GIS, or related\n  science degree including a strong background in statistics,\n  mathematics, computer science, and/or engineering, and 5 years of\n  experience.\n\n\nLooking at the government sector, a MS is virtually required these days unless you have significant experience already.  The following are typical qualifications for a mid-level GIS job with the feds:\n\n\n  FOR THE GS-09 LEVEL, in addition to the educational requirements\n  listed above, applicants must have at least one year or twelve (12)\n  months of specialized experience equivalent to grade level GS-07 that\n  demonstrates:  work performing duties such as providing geographic\n  information systems (GIS) training and support with guidance for\n  resource conservation planning and the integration of GIS and planning\n  tools into daily operations; this would include business tools for a\n  variety of disciplines such as engineering, ecological, etc., and\n  other software applications as assigned; provide support with\n  assistance to state, field, and soil survey offices regarding ArcGIS,\n  soil data viewer, and other GIS software;  OR  applicants must have\n  two (2) years of progressively higher level graduate education leading\n  to a master&#39;s degree or master&#39;s or equivalent graduate degree\n  directly related to cartography.   Equivalent combinations of\n  education and experience are qualifying for this grade level.\n\n\nFor a mid-level private sector job (ESRI Support Analyst), the following requirements are nearly industry-wide:\n\n\n  Requirements:\n  \n  \n  Bachelor’s in GIS, a related field, or equivalent work experience    while using GIS as a primary tool\n  \n  \n  Recommended Qualifications:\n  \n  \n  Master’s in GIS, environmental science, geography, or other relevant    field\n  \n\n\nThe bottom line is a MS will jump start your career, provide increased opportunities and almost certainly yield a higher salary.\n",
            "excerpt": "For example, these are the education requirements for a mid-level research position in academia:  \n\n\n  Master’s degree (or higher) in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>, GIS, oceanography, or\n  related degree including a &hellip; OR \n  \n  Bachelor’s degree in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>, GIS, or related\n  science degree including a strong background in statistics,\n  mathematics, computer science, and/or engineering, and 5 years of\n  experience &hellip; ",
            "title": "Is a master&#39;s degree needed for a GIS career?"
        },
        {
            "tags": [
                "remote-sensing",
                "modis",
                "envi",
                "ndvi"
            ],
            "question_score": 9,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 84058,
            "item_type": "question",
            "score": 9,
            "last_activity_date": 1564073904,
            "creation_date": 1390510969,
            "body": "I&#39;m new to StackExchange and to remote sensing.  I am working with MOD13Q1 250m 16-day MVCs.  My goal is to use NDVI time-series to classify cropping pattern and crop type, then link this data to water issues and rainfall.  I am working with ENVI 5.1, which is also new to me.  I have used the Modis Reprojeciton Tool to reproject and mosaic two MODIS tiles covering Sri Lanka.  The data has been reprojected into WGS84_UTM_44N.  I output the data as a GeoTiff and have successfully loaded this into ENVI.  \n\nHere&#39;s my question:  the pixels in the reprojected/mosaicked raster for the NDVI band (which is what i will need for the time-series analysis) run from -32768 to 32767, not from -1 to 1.  Is this just some silly misinterpretation on my part, do I need to manipulate the raster somehow with ENVI, or have I distorted the data when reprojecting it?  \n",
            "excerpt": "I&#39;m new to StackExchange and to <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>.  I am working with MOD13Q1 250m 16-day MVCs. &hellip; ",
            "title": "Reprojected MODIS NDVI has range from -32768 to 32767, expected -1 to 1"
        },
        {
            "tags": [
                "lidar",
                "references",
                "file-formats",
                "compression",
                "laz"
            ],
            "question_score": 9,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 295177,
            "item_type": "question",
            "score": 9,
            "last_activity_date": 1537197278,
            "creation_date": 1536264760,
            "body": "I am talking about the Esri Optimized LAS file format for compressed LiDAR files (.zlas).\n\nWhile the uncompressed format (.las) from ASPRS was adopted by practically  the entire Remote Sensing and GIS industries (including Esri) and made interoperability among software/platforms an enormous advantage for LiDAR data users, it seems it did not go the same way for compressed LiDAR files.\n\nIs there any technical documentation (from Esri or third parties) comparing  and rapidlasso&#39;s early format .laz, which shows advantages from  over ?\n\nI am trying to understand why Esri created  instead of adopting the early format  (open source).\n",
            "excerpt": "While the uncompressed format (.las) from ASPRS was adopted by practically  the entire <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> and GIS industries (including Esri) and made interoperability among software/platforms an enormous &hellip; ",
            "title": "Why did Esri create .zlas compressed LiDAR files instead of adopting .laz?"
        },
        {
            "tags": [
                "resolution",
                "terminology"
            ],
            "question_score": 10,
            "is_accepted": true,
            "answer_id": 421659,
            "is_answered": false,
            "question_id": 397523,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1642750364,
            "creation_date": 1642710063,
            "body": "In remote sensing, ground sample distance (GSD) refers to the dimensions of a single pixel in an image as measured on the ground. The calculation of GSD uses the focal length (FL in figure below) and sensor array dimensions, which are properties of the sensor, as well as the distance between the sensor and the ground at the moment of image capture (D in figure below), normally represented by the altitude of an aircraft or orbital distance of a satellite.\nHere is a visual aid to illustrate:\n\nSo when the ground is flat, things are as you described and the distance D is similar across the entire image which means that spatial resolution and GSD are equal across the scene ((&quot;1&quot; above). However, since spatial resolution can be used to describe the dimensions of a pixel relative to any object in focus, consider two other scenarios. First, some objects can stand relatively high above the ground compared to the altitude of a low flying aircraft (&quot;2&quot; above). Second, image footprints can  cover large areas which contain variable surface relief (&quot;3&quot; above). In both of these scenarios, the spatial resolution of objects across the image would deviate from the correctly calculated GSD in such a way that objects closer to the sensor than the ground are more resolute, and those farther away are less resolute.\nSo in short, Spatial resolution refers to the size of the pixels in an image with respect to some real world object in focus, and GSD is a standardized metric used to describe the spatial resolution of remotely sensed imagery on the ground, while image resolution without georeferencing typically refers to solely to the number of pixels in the sensor array, which is the product of the height and width and usually expressed in megapixels (i.e., 8192 &#215; 5460 = ~45MP). The former two describe the size of the smallest detectable features within a particular image, while the latter describes the level of detail recorded by a particular sensor configuration.\n",
            "excerpt": "In <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>, ground sample distance (GSD) refers to the dimensions of a single pixel in an image as measured on the ground. &hellip; ",
            "title": "What is the difference between Ground Sampling Distance (GSD) and spatial resolution?"
        },
        {
            "tags": [
                "spatial-database",
                "software-recommendations"
            ],
            "question_score": 23,
            "is_accepted": false,
            "answer_id": 27547,
            "is_answered": false,
            "question_id": 27188,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1342488934,
            "creation_date": 1339760665,
            "body": "Desktop\n\nFor many users, GIS means ESRI ArcGIS.  While expensive in a commercial setting, they have rather generous educational licensing, including the provision of free copies to educators for distribution to students, one per licensed seat per year.  I would advise at least ticking this box; I don&#39;t think people who learned GIS in other ways are less capable, but they might be less employable given the keyword-filtering resumes go through these days.  The extensions to ArcGIS range from basic things that should be integrated into the main application to the amusingly archaic to essential tools for a certain niche.\n\nThe OSGeo stack is an obvious addition to this, but I don&#39;t think it&#39;s yet capable of being a full replacement in desktop GIS, at least not with the usability of Arc.  Due to constant complaining about ESRI&#39;s annoyances, I tried to replace it for an entire summer with mostly QGIS, and failed.  QGIS w/ plugins + GRASS + POSTGIS can be hacked around to achieve a lot of GIS functionality, I can believe that, but for learning GIS rapidly, I wouldn&#39;t recommend it.  There are a lot of different projects under the OSGeo heading, though - in all likelihood you&#39;ll find use for some of them even if you don&#39;t touch the desktop functionality.\n\nI&#39;m always seeing MapInfo installations mentioned, but the one I used wasn&#39;t really mature / feature-ful in the same sense ArcGIS has been.  The user interface was lacking, so perhaps it just hid the functionality from me.\n\nManifold has been highly regarded as an ArcGIS competitor that is at once commercially affordable, comprehensive, and extensively higher-performance than the sometimes antiquated ArcGIS code.  They seem to be dragging their feet on updates &amp; bug-fixes in the last few years, though.  At the least, if ArcGIS fails to operate on extreme datasets, try this.\n\nRS\n\nRemote sensing software is its own niche, with lots of features that aren&#39;t present in the ESRI stack.  I&#39;ve been exposed to ERDAS, and heard about ENVI and PCI.  Those three constitute a majority share, but I&#39;m aware that there are a decent number of options out there, some open source (I&#39;ve heard good things about Opticks).  In my own research area, 3D remote sensing is rapidly becoming a thing, as well - LIDAR and automated photogrammetry would be short topics in any RS course I&#39;d teach.  See: Meshlab, VSFM, &amp; Photoscan.\n\nCarto\n\nFor static-map cartography, you&#39;ll ideally want Adobe Illustrator, but there are several less expensive commercial choices that may suffice.  My experience with Inkscape is a lot like my experience with QGIS - almost there, but missing crucial features like an effective layer dialog.\n\nScripting\n\nIn the field of data manipulation, you&#39;ll definitely want to look at a thorough exploration of Python w/ LabPy.  It&#39;s too versatile not to teach as a general tool at this point, there&#39;s the added inducement of ArcPy, and RPy adds the capability to use basically every statistical algorithm in the world.  In addition, very big datasets are typically more amenable to a scripting environment than desktop GIS.\n\nCAD\n\nCAD &amp; CAD-like GIS software, often used for surveyors / engineers, has a broad number of options led by Autocad which I&#39;m not qualified to compare, but may not be necessary for a pure GIS program.\n\nClient - Server\n\nHosting client-server stacks, which becomes important for some classes of GIS user, is the last niche I&#39;m going to mention, but the requirements here are so varied as to make comparison difficult.  Other than ArcSDE, The software here is often free, but the server setup and sysadmin to use it is not.\n\nEDIT: I&#39;ve had the opportunity to revisit QGIS recently and it does seem to have considerably improved, going from 1.5 -&gt; 1.8, in stability &amp; features.\n",
            "excerpt": "RS\n\n<span class=\"highlight\">Remote</span> <span class=\"highlight\">sensing</span> software is its own niche, with lots of features that aren&#39;t present in the ESRI stack.  I&#39;ve been exposed to ERDAS, and heard about ENVI and PCI. &hellip; In my own research area, 3D <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> is rapidly becoming a thing, as well - LIDAR and automated photogrammetry would be short topics in any RS course I&#39;d teach. &hellip; ",
            "title": "GIS Software Choice for a small university research centre"
        },
        {
            "tags": [
                "gps",
                "remote-sensing",
                "aerial-photography"
            ],
            "question_score": 9,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 229854,
            "item_type": "question",
            "score": 9,
            "last_activity_date": 1570919212,
            "creation_date": 1487959049,
            "body": "Looking for examples where GIS or RS has been a part of a movie plot. I&#39;m trying to put together a &quot;GIS &amp; RS and the Cinema&quot; class, in which examples of GIS &amp; RS are shown. Those examples will then be used a jumping off point for discussion around either the truth or utter wrongness of the GIS technique or RS data being shown. \n\nMy best example right now is VOLCANO, where Anne Heche drives a jeep around LA (without any traffic!!!) monitoring lava flows - in 1997! Clearly there are a few issues here which would be a great start to a discussion about GIS and emergency management and other technical aspects. \n\nMy other example is any, ANY, movie where a grainy satellite image is shown, and person in charge demands that it be &quot;ENHANCED!&quot;. Magically, the satellite is capable of zooming in and staying in one spot to see some new detail or event happen. \n\nWhat other examples of movies that involve some plot around Satellite Imagery, GPS, Aerial Photos, or GIS are there?\n",
            "excerpt": "Looking for examples where GIS or RS has been a part of a movie plot. I&#39;m trying to put together a &quot;GIS &amp; RS and the Cinema&quot; class, in which examples of GIS &amp; RS are shown. Those examples will then be &hellip; ",
            "title": "Examples of GIS or Remote Sensing in movies"
        },
        {
            "tags": [
                "lidar",
                "delete",
                "point-cloud",
                "noise",
                "outlier"
            ],
            "question_score": 12,
            "is_accepted": true,
            "answer_id": 272499,
            "is_answered": false,
            "question_id": 272433,
            "item_type": "answer",
            "score": 9,
            "last_activity_date": 1524667178,
            "creation_date": 1519403207,
            "body": "You seem to have outliers: \n\n\ni) below the ground surface; \nii) above the ground surface and vertically among other above ground real features; \niii) above ground points with height greater than all objects of interest, for example the ones caused by clouds or birds (this is not shown in the picture, but I am assuming it might also be the case).\n\n\nFor &#39;i&#39;, the option is to use a ground filter algorithm that can take into account &#39;negative blunders&#39; to get a clean LiDAR ground point cloud. See the Multiscale Curvature Classification (MCC) algorithm from Evans and Hudak (2007). It is said on page 4:\n\n\n  Negative blunders are a common occurrence in LiDAR data, which may be caused by the scattering of the photons in a returned laser pulse. Scattering lengthens the time for an emitted laser pulse to return to the aircraft sensor, inflating the calculation of distance traveled, hence causing a measurement\n  error where the surface elevation is erroneously recorded as being below the surrounding measurements. It should be noted that curvature classification approaches can potentially remove valid returns surrounding negative blunders, which can expand the edge artifact around a negative blunder to create a\n  distinct “bomb crater” effect. To address negative blunders, Haugerud and Harding suggested setting the curvature tolerance parameter to four times the interpolated cell size and selecting returns exceeding this negative curvature threshold. However, it should be noted that under certain circumstances, returns that appear to be negative blunders can be in fact valid\n  returns (e.g., sinkholes). Therefore, the preceding suggestion to remove potential negative blunders can be implemented as an optional last model loop to employ at the discretion of the user if needed.\n\n\nBelow there is a post with an example about using MCC-LIDAR:\n\n\nDetermining bare earth DEM from unclassified LAS file?\n\n\nOnce you have an accurate LiDAR ground point cloud to make an accurate DEM, it is possible to normalize the point cloud, and exclude points which are beneath the DEM surface (the ones with negative values). Using the same approach, it is also possible to address point number &#39;iii&#39; removing points above some fixed threshold. See, for example:\n\n\nDeleting anomalous points in *.lasd using ArcGIS for Desktop?\n\n\nThen, it leaves us with &#39;ii&#39;, which is addressed by AlecZ&#39;s answer recommending  from LAStools. It will also handle &#39;iii&#39;, and perhaps part of &#39;i&#39; as well (LAStools requires a license though). Other tools specifically created for checking/removing outliers were cited here: PDAL&#39;s  tool in Charlie Parr&#39;s answer which has a detailed explanation about how the tool works, and with the advantage PDAL is a free software.\n\nThen, what is left from the automated process (if any outlier) can be removed manually. For example:\n\n\n(LAStools; ArcGIS Pro) Cleaning LiDAR points that classification algorithm misses?\n(QT Modeler) --&gt; auslander&#39;s answer).\n\n\n\n\nEvans, Jeffrey S.; Hudak, Andrew T.  2007.  A multiscale curvature algorithm for classifying discrete return LiDAR in forested environments.   IEEE Transactions on Geoscience and Remote Sensing. 45(4): 1029-1038.  \n",
            "excerpt": "IEEE Transactions on Geoscience and <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>. 45(4): 1029-1038. &hellip; ",
            "title": "Editing LiDAR point cloud to remove noise/outliers present below and above ground?"
        },
        {
            "tags": [
                "python",
                "remote-sensing",
                "landsat",
                "landsat-8",
                "pymodis"
            ],
            "question_score": 7,
            "is_accepted": true,
            "answer_id": 80369,
            "is_answered": false,
            "question_id": 78598,
            "item_type": "answer",
            "score": 8,
            "last_activity_date": 1386891249,
            "creation_date": 1386891249,
            "body": "I just thought I&#39;d add that there are some &#39;pure&#39; Python solutions for several nodes in this workflow, also. \n\nSome file reading and basic processing:\n\nSpectral Python: http://spectralpython.sourceforge.net/\n\nMore classification than you&#39;ll find in pure remote sensing and GIS packages:\n\nhttp://scikit-learn.org/stable/\n\nMore links I can&#39;t share:\n6S Python atmospheric correction, Shapely, gdal bindings for reading geoTIFF (relatively trivial to parse metadata from Landsat 8 and read all images into a cube). There are other processing options in SciPy general and MDP (modular data processing, too).\n",
            "excerpt": "Some file reading and basic processing:\n\nSpectral Python: http://spectralpython.sourceforge.net/\n\nMore classification than you&#39;ll find in pure <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> and GIS packages:\n\nhttp://scikit-learn.org/ &hellip; ",
            "title": "Are there Python packages for Landsat 8 processing?"
        },
        {
            "tags": [
                "career"
            ],
            "question_score": 19,
            "is_accepted": false,
            "answer_id": 48797,
            "is_answered": false,
            "question_id": 48284,
            "item_type": "answer",
            "score": 8,
            "last_activity_date": 1458693340,
            "creation_date": 1358906362,
            "body": "If you like GIS and want to go through the effort of getting an advanced degree - get a degree in something halfway definable like biology, hydrology, geology, env. engineering, epidemiology, public health, forestry, env. chemistry, transportation, economics, agriculture. Take these fields to new areas by using GIS. That said, if you just want a PhD, it&#39;s an easy way to go according to a former colleague.\n\nHope I don&#39;t offend anyone here, but in many ways GIS and geography is just a catch all for things having a spatial component. If you must study GIS, at least include a lot of stats and imagery and remote sensing where you can do some real science.\n\nWhat&#39;s really lacking in a lot of consultancy involving GIS is the &quot;IS&quot; part of GIS. Help us out and get a computer science degree. Understand databases, programming, security, networks, scalability, project management, helping integrate GIS into an organization is incredibly tech centric with a large helping of people skills.\n",
            "excerpt": "If you must study GIS, at least include a lot of stats and imagery and <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> where you can do some real science. &hellip; ",
            "title": "Is PhD in GIS useful in non-educational career path?"
        },
        {
            "tags": [
                "arcgis-10.1",
                "time",
                "envi",
                "erdas-imagine",
                "ndvi"
            ],
            "question_score": 2,
            "is_accepted": false,
            "answer_id": 93978,
            "is_answered": false,
            "question_id": 93935,
            "item_type": "answer",
            "score": 8,
            "last_activity_date": 1398299343,
            "creation_date": 1398298952,
            "body": "When remote sensing vegetation, the time of year is very important. In most climates, vegetation has significantly more biomass (i.e., leaves etc.) during the summer, which means that it is easier for the sensor to discern the health of vegetation at that time of year. Two NDVI images of the same location from different times of the year may look different because they were taken at different points of the plants&#39; growing cycles. For this reason, and because of differences in illumination, it is advisable to use images from the same time of year when developing a multi-year time series.\n\nTo answer your question, the image above seems to do this. All of the images are taken during the summer over a number of years. When developing your time series, you should pick a time of year that you have good data for (ideally near the peak of plant growth) and then create single NDVI images of that date for each year from 2002 to 2013. When developing your final product, you can put the images side by side like the image above. You do not create an NDVI for each month and then create a composite of them. For the aforementioned reasons, the images from each month of the year would look very different and a composite wouldn&#39;t be effective to achieve what you want.\n\nThe values outputted by NDVI indicate the relative health and abundance of the vegetation by comparing reflectance values in the red and near infrared bands. The maps above seems to be indicating that the health and abundance of vegetation in Mongolia increased between 1989 and 2001. The individual maps do not indicate change in plant growth over time; only collectively do they show how plant growth has changed over time.\n",
            "excerpt": "When <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> vegetation, the time of year is very important. &hellip; ",
            "title": "Creating a Time series NDVI map"
        },
        {
            "tags": [
                "arcgis-10.0",
                "arcmap",
                "polygon",
                "editing"
            ],
            "question_score": 6,
            "is_accepted": true,
            "answer_id": 21254,
            "is_answered": false,
            "question_id": 21252,
            "item_type": "answer",
            "score": 8,
            "last_activity_date": 1502510522,
            "creation_date": 1330961020,
            "body": "Instead of moving individual vertices for a feature you can use the Reshape Feature tool on the Editor toolbar.\n\nDepending on how accurate your polygons need to be you could also leverage remote sensing algorithms to automate polygon creation against aerial imagery that has 4 bands (fourth band that is NIR) or LAS lidar data sets, see:\n\nLand Cover Feature Extraction from Satellite Imagery\n",
            "excerpt": "Depending on how accurate your polygons need to be you could also leverage <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> algorithms to automate polygon creation against aerial imagery that has 4 bands (fourth band that is NIR) or LAS &hellip; ",
            "title": "Is there an easier way to edit polygons in ArcMap?"
        },
        {
            "tags": [
                "features",
                "remote-sensing",
                "classification"
            ],
            "question_score": 8,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 2,
            "is_answered": true,
            "question_id": 121096,
            "item_type": "question",
            "score": 8,
            "last_activity_date": 1415751220,
            "creation_date": 1415225419,
            "body": "I would like to understand if is there any difference or relation between spectral signature concept and features in remote sensing?\n",
            "excerpt": "I would like to understand if is there any difference or relation between spectral signature concept and features in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>? &hellip; ",
            "title": "what&#39;s the difference between spectral signature and features in remote sensing?"
        },
        {
            "tags": [
                "remote-sensing",
                "emergency-services",
                "sentinel-1",
                "natural-disaster",
                "nepal"
            ],
            "question_score": 8,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 144041,
            "item_type": "question",
            "score": 8,
            "last_activity_date": 1430037063,
            "creation_date": 1430006749,
            "body": "To any experts who can provide remote sensing data that can help assess impact and damage of nepal earthquake we really need your help to ensure aid is well targeted.\n\nExisting data so far is here\n\nIf you can supplement with for example sentinel-1 SAR data, building damage, population densities etc. This could be very useful\n\nPlease add relevant dataset in well labelled formats that are accessible and understandable to non gis experts to the humanitarian data exchange and or other networks you known.\n\nPlease explain any uncertainties and document clearly.\n",
            "excerpt": "To any experts who can provide <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> data that can help assess impact and damage of nepal earthquake we really need your help to ensure aid is well targeted. &hellip; ",
            "title": "Remote sensing for Nepal Earthquake"
        },
        {
            "tags": [
                "remote-sensing",
                "landsat"
            ],
            "question_score": 8,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 231528,
            "item_type": "question",
            "score": 8,
            "last_activity_date": 1489126965,
            "creation_date": 1489100208,
            "body": "I&#39;m pretty green when it comes to RS and I&#39;m doing this school project that I need help with. The project is to measure albedo changes for the tongue of a glacier and I&#39;m using R programming to do it. So I got my data from earth explorer and went for the surface reflectance product in order to save some steps. However, the values for these cells are higher than expected, around 2000 depending on the band. I say higher because when I use a weighted average formula for calculating albedo, which I found in some papers cited below, the outcome gives me cell values of around 1000, not the 0 to 1 I would expect for and albedo. The paper mentions its using a surface reflectance as well for this formula. \n\nMy question is, is this formula wrong? Albedo = 0.493Band2 + 0.203 Band + 0.150 Band5 + 0.154Band\n\nOr does some other processing need to be done to my Earth Explorer Surface Reflectance Product. https://landsat.usgs.gov/landsat-surface-reflectance-high-level-data-products\n\nAlso I&#39;m using Landsat 4-7 images. \n\nsources:\n\n\n  Pimentel, Rafael, et al. &quot;Comparison between Snow Albedo Obtained from\n  Landsat TM, ETM+ Imagery and the SPOT VEGETATION Albedo Product in a\n  Mediterranean Mountainous Site.&quot; Hydrology 3.1 (2016): 10.\n\n\nAlso, this is really similar but uses TOA instead of surface reflectance:\nhttp://yceo.yale.edu/how-convert-landsat-dns-albedo\n",
            "excerpt": "I&#39;m pretty green when it comes to RS and I&#39;m doing this school project that I need help with. The project is to measure albedo changes for the tongue of a glacier and I&#39;m using R programming to do it. &hellip; ",
            "title": "Remote Sensing Landsat Surface Reflectance and Albedo"
        },
        {
            "tags": [
                "qgis",
                "arcgis-desktop"
            ],
            "question_score": 5,
            "is_accepted": false,
            "answer_id": 182914,
            "is_answered": false,
            "question_id": 182905,
            "item_type": "answer",
            "score": 8,
            "last_activity_date": 1456846179,
            "creation_date": 1456846179,
            "body": "ArcGIS has certain benefits and advantages if you are running an organization, or if you&#39;re part of a local government, through its Enterprise applications (ArcCollector for iPad, for example). However, it is proprietary and costs a lot of money. If you&#39;re an individual GIS/Mapmaker, QGIS is the way to go.\n\nQGIS is free and covers most of what ArcGIS can do through various plugin contributors. Need to do something in QGIS that isn&#39;t part of the standard interface? There&#39;s probably a plugin for it. \n\nQGIS can also be finnicky at times (certain plugins not working, or not working as well as you might like), and new versions come out far more frequently than versions of ArcGIS, meaning staying up to date on your versions. I don&#39;t mind that, personally. It&#39;s enjoyable to be a part of an Open Source community, while at the same time, being able to accomplish pretty much any GIS or Remote Sensing need I have.\n\nAlso, to be more specific to your question, Land Cover Classification tools in ArcGIS are much more sophisticated than they are in QGIS. If I had to work with satellite imagery in ArcGIS or QGIS, it would definitely be the former. ArcGIS also allows Time-Series mapping, which, as far as I know, isn&#39;t available in QGIS.\n",
            "excerpt": "It&#39;s enjoyable to be a part of an Open Source community, while at the same time, being able to accomplish pretty much any GIS or <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> need I have. &hellip; ",
            "title": "What does ArcGIS have that QGIS doesn&#39;t?"
        },
        {
            "tags": [
                "arcgis-desktop",
                "geotiff-tiff",
                "srtm",
                "esri-ascii-raster"
            ],
            "question_score": 6,
            "is_accepted": false,
            "answer_id": 61940,
            "is_answered": false,
            "question_id": 61939,
            "item_type": "answer",
            "score": 8,
            "last_activity_date": 1369659803,
            "creation_date": 1369658367,
            "body": "In a nutshell, the ESRI ASCII grid format is human-readable and is text. This means you can open it in a text editor and see the actual values for yourself without needing specialized software. TIFFs are binary and are therefore not human-readable. You&#39;d need some specialized software like GIS to read it. TIFFs are supported by almost all GIS packages though. SRTM images are available for download in those two formats due to their ease of use of use and widespread support in most GIS and Remote Sensing software applications. The two files should contain the same information.\n",
            "excerpt": "SRTM images are available for download in those two formats due to their ease of use of use and widespread support in most GIS and <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> software applications. &hellip; ",
            "title": "What is difference between GeoTIFF and Esri ASCII grid file formats for SRTM data?"
        },
        {
            "tags": [
                "georeferencing",
                "modis",
                "envi",
                "hdf"
            ],
            "question_score": 8,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 124774,
            "item_type": "question",
            "score": 8,
            "last_activity_date": 1608710730,
            "creation_date": 1417954378,
            "body": "I am using ENVI 5.1 on Windows 8. I am trying to open a MOD17A3 (MODIS Net Primary Productivity standard product - L4) .hdf file which I downloaded from the USGS website. I am still a beginner at ENVI, IDL, Remote Sensing, and GIS. \n\nMy problem is when I try to use the ENVI GUI and open the file. \n\nWhen I open the .hdf file as a EOS&gt;MODIS file, it appears properly georeferenced when overlaid with other vector layer that I am using, BUT it does not show the data for each pixel. What I mean is, the shapes of the landmasses are present, but they are all in black, not showing any NPP data which should have made the pixels appear in varying shades of grey.\n\nWhen I open the .hdf file as Generic Format&gt;HDF4, ENVI asks me to select which datasets in the .hdf file I should open, and I select NPP. The values of each pixel are displayed, such that they appear in varying shades of grey, BUT they don&#39;t seem to be properly georeferenced since they don&#39;t align with other georeferenced layers. The map has shrunk, but is in the same general location as the other layers.\n\nIt might be possible to use the IDL controls to solve this problem but I wouldn&#39;t have any idea where to start.\n",
            "excerpt": "I am still a beginner at ENVI, IDL, <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>, and GIS. \n\nMy problem is when I try to use the ENVI GUI and open the file. &hellip; ",
            "title": "Opening MOD17A3 in ENVI so it is properly georeferenced?"
        },
        {
            "tags": [
                "open-source-gis",
                "remote-sensing",
                "geoprocessing"
            ],
            "question_score": 8,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 4,
            "is_answered": true,
            "question_id": 33747,
            "item_type": "question",
            "score": 8,
            "last_activity_date": 1500310090,
            "creation_date": 1348000159,
            "body": "I have been involved in remote sensing for some years now during studies.  I am wondering which combination of software and image processing modules would be most suitable for an entire process chain for professional image processing solutions and products. I am very curious about what other users think and perhaps it will even lead into an interesting discussion from experienced users.\n\nWhat I mean in detail is the combination of:\n\n\na database storing geographical data like shapefiles but especially huge amounts of satellite imagery with its corresponding metadata \nimage processing modules automatically using appropriate data from the database useful for the chosen processing step (e.g. all satellite data with at least a certain spatial resolution for a given time span and geographic area to produce change detection maps)\nthe results then should be integrated into the database and perhaps even be available for distribution via a web server\n\n\nUnfortunately I do not have any advanced knowledge on databases for geographic data. Perhaps GeoNetwork/GeoServer with PostGIS would be an option?\n\nFor the image processing modules I thought of either implementing necessary algorithms in C++/GDAL or JAVA/Geotools. Also there would need to be some kind of module connecting to the database in order to fetch the needed data for processing and the creation of metadata for the processed images/products. My thoughts were that generally open source solutions would be best as such a system would be developed for a long run and being independent of commercial companies would be desired.\n",
            "excerpt": "I have been involved in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> for some years now during studies. &hellip; ",
            "title": "Preferred programming language and software for entire remote sensing workflow?"
        },
        {
            "tags": [
                "remote-sensing",
                "classification",
                "land-classification",
                "random-forest",
                "land-use"
            ],
            "question_score": 6,
            "is_accepted": true,
            "answer_id": 121120,
            "is_answered": false,
            "question_id": 121105,
            "item_type": "answer",
            "score": 8,
            "last_activity_date": 1415242354,
            "creation_date": 1415242354,
            "body": "Classification algorithms such as Maximum Liklihood, random forests, and SVM are statistical methods for grouping data.  These data may be words, colors, sounds or anything you can imagine.  In a remote sensing context, these algorithms are used to group pixels or image objects (segments) based on statistical properties, or spectral profiles.  \n\nTo answer the first part of your question, all three of these algorithms can be used to classify image objects (e.g. segments created in Matlab or eCognition).  Since these image objects, or segments, are essentially created by drawing a line around statistically similar groups of pixels, these segments can be classified into further classes too (e.g. forest, grassland, etc) if you create a set of rules or statistical properties deciding which objects are grouped together.\n\nFor the second part of the question, all three of these algorithms can also be used as pixel-based classifiers.  The same principle holds true for classifying pixels as it does image objects or segments; the specific algorithm determines how the pixels are grouped together based on a given set of statistical rules.\n\nFrom a software point of view, you can implement these classification algorithms at the pixel level or the image object level in software such as eCognition.  You can also implement an object-based classification on image objects, or a pixel-based classification within image objects.  \n",
            "excerpt": "In a <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> context, these algorithms are used to group pixels or image objects (segments) based on statistical properties, or spectral profiles. &hellip; ",
            "title": "Pixel-based and object-based classification!"
        },
        {
            "tags": [
                "remote-sensing",
                "classification",
                "landsat",
                "land-cover",
                "forest-ecology"
            ],
            "question_score": 8,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 124567,
            "item_type": "question",
            "score": 8,
            "last_activity_date": 1675050652,
            "creation_date": 1417780418,
            "body": "I am pretty new in remote sensing and I am trying to identify/classify coniferous forest cover from single date Landsat scene. According to my preliminary web research I have these possibilities:\n\n\nconvert scene to NDVI values. Using modal values of NDVI histogram, I can separate scene pixels into forested and non-forested area \nuse modal value of band 2,3 and 5 (B2) to identify &quot;forest peak&quot; and class scene to forest/non-forest (Huang, 2008: Use of a dark object concept and support vector machines to automate forest cover change analysis). Other scenes characteristics (rocks, rivers) have to be removed using Tasseled cap brightness values\n\n\nDo you know another simple approach to classify forest cover in mountainous area? I dont really want to apply maximum likelihood classification. Maybe it is better to used unsupervised classification?\n\nI am using ERDAS, ArcGIS 10.2 and R\n",
            "excerpt": "I am pretty new in <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> and I am trying to identify/classify coniferous forest cover from single date Landsat scene. &hellip; ",
            "title": "How to easily identify/classify coniferous forest from one date Landsat image?"
        },
        {
            "tags": [
                "data",
                "elevation",
                "europe"
            ],
            "question_score": 15,
            "is_accepted": false,
            "answer_id": 206174,
            "is_answered": false,
            "question_id": 1763,
            "item_type": "answer",
            "score": 8,
            "last_activity_date": 1470657586,
            "creation_date": 1470657586,
            "body": "In 2016, the Japan Aerospace Exploration Agency (JAXA) released a new free 30 m (1 arcsec) resolution global topographic data set called ALOS Global Digital Surface Model &quot;ALOS World 3D - 30m&quot; (AW3D30) (http://www.eorc.jaxa.jp/ALOS/en/aw3d30/). It is stated as having a 5 m height accuracy and has been compiled from images taken with the Advanced Land Observing Satellite (ALOS). There are indications that the product has been derived from an even higher resolution data set; there is a 15 m resolution DEM for Japan. The coverage spans 82&#176;N to 82&#176;S. There are some voids in the current data that can be readily filled using other data sets such as SRTM. Like the SRTM data set, these data are described as a digital surface model since the heights of off-terrain objects (vegetation, buildings, etc) are included. The following is an example of an AW3D30 DEM of the Canadian Province of New Brunswick.\n\n\n\nReferences\n\nJ. Takaku, T. Tadono, K. Tsutsui : Generation of High Resolution Global DSM from ALOS PRISM, The International Archives of the Photogrammetry, Remote Sensing and Spatial Information Sciences, pp.243-248, Vol. XL-4, ISPRS TC IV Symposium, Suzhou, China, 2014. \n\nT. Tadono, H. Ishida, F. Oda, S. Naito, K. Minakawa, H. Iwamoto : Precise Global DEM Generation By ALOS PRISM, ISPRS Annals of the Photogrammetry, Remote Sensing and Spatial Information Sciences, pp.71-76, Vol.II-4, 2014. \n",
            "excerpt": "Tsutsui : Generation of High Resolution Global DSM from ALOS PRISM, The International Archives of the Photogrammetry, <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> and Spatial Information Sciences, pp.243-248, Vol. &hellip; Iwamoto : Precise Global DEM Generation By ALOS PRISM, ISPRS Annals of the Photogrammetry, <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> and Spatial Information Sciences, pp.71-76, Vol.II-4, 2014. &hellip; ",
            "title": "Seeking free elevation data for Europe?"
        },
        {
            "tags": [
                "web-mapping",
                "scale"
            ],
            "question_score": 8,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 6,
            "is_answered": true,
            "question_id": 4452,
            "item_type": "question",
            "score": 8,
            "last_activity_date": 1337873147,
            "creation_date": 1292464009,
            "body": "How do I create a static map where the scale varies based on location? \n\nExample: to drive from a specific location X in Albuquerque to a \nspecific location Y in Chicago, I want to &quot;zoom&quot; around X and Y as follows: \n\n\nNear X and Y, the scale is fairly large, so you can see minor \nstreets, buildings, etc, near X and Y. \nFar away from both X and Y, the scale is fairly small, so you might \njust see long lengths of highway, but no details. \n\n\nIn other words, it&#39;s like a regular map with a &quot;magnifying glass \neffect&quot; around X and Y. The effect should &quot;fade off&quot; smoothly, so \nthere isn&#39;t a break in the map. \n\nReasoning: when traveling between remote cities, the highway travel is \noften easy (in the sense it doesn&#39;t require details), but getting from \nX to the highway and from the highway to Y can require detailed \ninstructions, knowing minor streets, etc. \n\nEDIT: I&#39;ve attached a horrible example of what I want to do. Notes:\n\n\nThis only zooms in on one city, not two.\nThis is just plain old image zoom. What I would want is more detail in the Albuquerque area.\nNotice, however, that the roads/highways are continuous: the magnifying does not have a &quot;cutoff&quot; problem.\n\n\n\n",
            "excerpt": "Reasoning: when traveling between <span class=\"highlight\">remote</span> cities, the highway travel is \noften easy (in the <span class=\"highlight\">sense</span> it doesn&#39;t require details), but getting from \nX to the highway and from the highway to Y can require detailed &hellip; ",
            "title": "Maps zoomed around specific locations (magnifying glass effect)"
        },
        {
            "tags": [
                "remote-sensing",
                "landsat-8",
                "landsat-7"
            ],
            "question_score": 8,
            "is_accepted": false,
            "answer_id": 122628,
            "is_answered": false,
            "question_id": 122519,
            "item_type": "answer",
            "score": 7,
            "last_activity_date": 1416353983,
            "creation_date": 1416353983,
            "body": "Forgive me if this is too basic an answer: panchromatic and infrared are mutually exclusive.\n\nPanchromatic means all visible light, which is generally considered to range 0.4μm to 0.7μm in wavelength.\n\nNear (or reflected) infrared energy is generally considered to range 0.7μm to 0.9μm in wavelength, just beyond visible.\n\nSee Infrared vs. Panchromatic - Mt. Reynolds, for example.\n\nOne might ask instead why the panchromatic band on Landsat 7 included near infrared.\n\nDesigners of remote sensing scanners have specific spectral windows in mind for each band. Someone else more au fait or more au courant (much more knowledgeable than me) should provide detailed reasons.\n",
            "excerpt": "Designers of <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> scanners have specific spectral windows in mind for each band. &hellip; ",
            "title": "Why does Landsat 8 panchromatic band NOT include the infrared?"
        },
        {
            "tags": [
                "education",
                "certification"
            ],
            "question_score": 14,
            "is_accepted": true,
            "answer_id": 4682,
            "is_answered": false,
            "question_id": 4652,
            "item_type": "answer",
            "score": 7,
            "last_activity_date": 1293633351,
            "creation_date": 1293192448,
            "body": "Personally think that for development work, there&#39;s not too much a programmer can get from a GIS course, unless the course is run specifically for Computer Science students (which is rare). My learning (coming from a similar background to yours with lesser experience at the time) after enrolling in a Master&#39;s course was applied physics, spatial/locational modelling and statistical theory used in Remote Sensing amd Urban planning. It was all very interesting then, but I haven&#39;t used it since. Most of the work in GIS I have done has been standard IT work with basic GIS data model concepts involved. However, one of the biggest benifits of doing a Master&#39;s for me was learning how to write and present better and more confidently, which is a transferrable skill.\n\nQuestions you might want to ask yourself :\nDo you prefer open-source development or would you rather work with vendors such ESRI/Manifold/MapInfo etc.?\n\n\n  My personal choice for programming was\n  open source tools and I picked up GIS\n  specific Java tools such as\n  JTS/GeoTools etc on my own and more\n  recently GeoServer/gdal.\n\n\nDo you prefer Desktop or web? \n\n\n  web development jobs are harder to\n  find and the user base can be hard to\n  please as they are used to highly\n  interactive desktop apps\n\n\nWhat field would you like to work in - government, military, environment?\n\n\n  By far the biggest advantages of a GIS\n  career is opens up avenues into\n  fields you might not have considered\n  or had access to with just an IT background\n\n\nHope this helps \n\nsfk\n",
            "excerpt": "learning (coming from a similar background to yours with lesser experience at the time) after enrolling in a Master&#39;s course was applied physics, spatial/locational modelling and statistical theory used in <span class=\"highlight\">Remote</span> &hellip; <span class=\"highlight\">Sensing</span> amd Urban planning. &hellip; ",
            "title": "GIS Certification"
        },
        {
            "tags": [
                "google-maps",
                "land-survey"
            ],
            "question_score": 2,
            "is_accepted": false,
            "answer_id": 283793,
            "is_answered": false,
            "question_id": 283789,
            "item_type": "answer",
            "score": 7,
            "last_activity_date": 1527020182,
            "creation_date": 1527020182,
            "body": "I&#39;m no lawyer, but i am 99% sure the very short answer to your question is &quot;no&quot;.\n\nThe legally admissible boundaries are recorded in the cadastral record which you can obtained from city hall. That record is generated by surveyors who do the similar process to what you describe (start at an origin, draw lines at certain angles etc) but with real life measurements. \n\nAny software generated boundaries will be prone to different types of errors which will make them inadmissible. Courts like dealing in absolutes. There exists a reliable method of doing this, and its how they generate the  cadastral record.\nEven with highly accurate lidar or remote sensing images, when it comes time to plot out the property in real life, the process requires professional surveyors who will then sign off on the results.  \n\n\n  Is there some way to estimate the maximum error in real world distances of such lines as shown on the map from their actual location?\n\n\nYou would have to draw the polygon in your software, get some coordinates from the software (the corners of the lot for example), and then go to the property and measure the real boundaries with a high accuracy GPS device ($$$) and then compare the two sets of readings. Doing this for one property would give you an idea of the margin of error of the process, doing it for multiple properties will help you dial in the margin of error. That would be the process you are asking about in this above quote... but it still wont be admissible.\n\nYou could compare those results to the cadastral files to guage the margin of error, but once you have the cadastral file i&#39;m not sure i see the point of making another record/file. \n\nthe context might greatly change what is admissible. Trying to move a boundary between two houses is very different than say, trying to estimate the surface area of a very large property. \n",
            "excerpt": "Even with highly accurate lidar or <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> images, when it comes time to plot out the property in real life, the process requires professional surveyors who will then sign off on the results. &hellip; ",
            "title": "Why can&#39;t lines plotted on google maps suffice for legal determination of property boundaries?"
        },
        {
            "tags": [
                "r",
                "lidr"
            ],
            "question_score": 6,
            "is_accepted": true,
            "answer_id": 344567,
            "is_answered": false,
            "question_id": 344564,
            "item_type": "answer",
            "score": 7,
            "last_activity_date": 1624092900,
            "creation_date": 1575991462,
            "body": "Your question is closely related to this one: Apply a function to a catalog. It is the exact same issue.\nThere are several confusion in your example. You tried to use the &quot;metrics syntax&quot; in a wrong way. When defining a &quot;metric&quot; function the input should be some attributes of a LAS object and the output must be a number or a  of numbers.\n\nIs a valid statement (you can write ) but the output is not a number. The output is a  is thus it is not a metrics and it cannot be used in  functions.\n has been designed from Bouvier et al. (2015). If you read the paper the metric used was the coefficient of variation of the LAD above 2m (if I remember well).\n\nmight be a valid metric. The following works (notice the use of uppercase . This is an attribute of the  object):\n\nHowever it makes sense at the pixel level but it does not really make sense at the voxel level\n\nwon&#39;t crash because the computation is valid and works but the numbers won&#39;t really have a valid meaning in my opnion (edit: it returns NA everywhere actually).\nIn your case you wrote:\n\nThis did not failed because R is very permissive but what it actually does is the computation of the same  from the whole point cloud as many times as the number of voxel. All the  were ed.\n\nBouvier, M., Durrieu, S., Fournier, R. a, &amp; Renaud, J. (2015). Generalizing predictive models of forest inventory attributes using an area-based approach with airborne las data. Remote Sensing of Environment, 156, 322-334. http://doi.org/10.1016/j.rse.2014.10.004\n",
            "excerpt": "at the pixel level but it does not really make <span class=\"highlight\">sense</span> at the voxel level\nvoxelsLAD = voxel_metrics(las, ~as.numeric(cv(LAD(Z, dz = 1, k= 0.5)$lad)), 5)\n\nwon&#39;t crash because the computation is valid and &hellip; <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> of Environment, 156, 322-334. http://doi.org/10.1016/j.rse.2014.10.004 &hellip; ",
            "title": "Creating a 3D voxel plot with LAD values in lidR"
        },
        {
            "tags": [
                "qgis",
                "arcgis-desktop",
                "dem",
                "area",
                "slope"
            ],
            "question_score": 6,
            "is_accepted": false,
            "answer_id": 190821,
            "is_answered": false,
            "question_id": 190714,
            "item_type": "answer",
            "score": 7,
            "last_activity_date": 1461438817,
            "creation_date": 1461438817,
            "body": "Doing this kind of processing is pretty straight-forward, but there are some tricks along the way that will determine how accurate your analysis will be. Your data will be generated from a slope raster of the area, and you usually have to build it yourself. The easiest way is to use a DEM raster to calculate the slope, so you should start with that.\n\nStep 1: Acquire the DEM\n\nYou can get DEMs for free from pretty much the entire world, and from many sources, depending on the area. But said you need a 90m&#178; resolution DEM, that&#39;s about a 9.5m pixel, which is pretty high where DEMs are concerned, and not readily available for free.\n\nYou said you were using ArcGIS Online&#39;s DEMs. Looking through their documentation, it appears they did a mosaic of DEMs ranging from 2m to 900m spatial resolution, you&#39;ll have to see if the cities you&#39;re working with are below the 10m range. Geospatial companies like Airbus and DigitalGlobe can generate a custom DEM for you, though a 9m res of 50km radius of 15 cities could be pretty expensive, you&#39;ll have to check with them.\n\nBut most of all, you have to ponder if you really need this resolution. Are you doing a precision work, or just a viability study? Because there are plenty of freely available DEMs within the 30m resolution, most famously the SRTM, that could fit on a broader study.\n\nIf you really need a 90m&#178; pixel, then another problem arises. There are two types of DEMs - the Terrain DEM, which covers only ground elevation, and the Surface DEM, which also covers tree tops, buildings, etc. You generally want a terrain DEM, smaller resolutions it matters less; on a &lt; 10m resolution DEM, however, it&#39;s a must, and DTMs (as they are known) are harder to generate and to come by. It&#39;s almost a certain that any freely available DEM will be surface.\n\nStep 2: Generating the slope\n\nWith your DEM in hand, you&#39;ll create the slope raster. Both ArcGIS and QGIS can do this, as well as any other good GIS or remote sensing software. But first, you need to know what Spatial Reference System your DEM raster is in. There are two types of SRS - geographic and projected. Geographic ones have coordinates in degrees (usually latitude and longitude), whereas projected ones have planar coordinates (usually meters).\n\nSince your elevation data is likely in meters, you need to make sure your coordinates are as well. If they&#39;re not, you&#39;ll need to convert (some softwares do that automatically whilst calculating the slope, but don&#39;t count on it). To convert in QGIS, go to Raster -&gt; Projection -&gt; Warp, and choose the projection that best suits your area (can&#39;t help you with that, but you can find this info online). In ArcGIS, you&#39;ll want the Project Raster tool that&#39;s in the Data Management toolbox.\n\nNext, you&#39;ll want to isolate your area of interest. Create a point vector for each of your city centers, and generate a 50km buffer from it. Again, make sure your point vector is in a projected SRS, else you&#39;ll create a 50 degrees buffer encompassing most of Eurasia. For QGIS, that&#39;s Vector -&gt; Geoprocessing Tools -&gt; Buffer, whereas for ArcGIS it&#39;s Analysis toolbox -&gt; Proximity toolset -&gt; Buffer. Remember to put it 50000, not 50. Then you&#39;ll need to cut your DEM raster with it. In QGIS, that&#39;s Raster -&gt; Extration -&gt; Clipper, and in ArcGIS it&#39;s Data Management toolbox -&gt; Raster toolset -&gt; Raster Processing toolset -&gt; Clip.\n\nWith your isolated DEM raster in hand, go generate the slope. In QGIS, that&#39;s Raster -&gt; Analysis -&gt; DEM, and then select Slope on the Mode. In ArcGIS, it&#39;s part of the Spatial Analyst toolbox and the 3D Analyst toolbox, under Surface toolset. Now, parts of both toolboxes are only available as payed extensions, and I don&#39;t know if that&#39;s the case for Slope. Anyway, regardless of the software, slope can be calculated in degrees as well as percentage. Since you want areas with &lt; 15% slope, beware not to choose degrees during the process.\n\nStep 3: Analysing the slope\n\nNext, you&#39;ll turn your slope raster (in which currently pixels have a slope value) into a binary raster (that is, each pixel will either be 0 - non-acceptable slope - or 1 - acceptable slope). To do so, you&#39;ll need map algebra. In QGIS it&#39;s in Raster -&gt; Raster Calculator, and in ArcGIS it&#39;s Spatial Analyst toolbox -&gt; Map Algebra toolset -&gt; Raster Calculator. Your expression should be something like &quot;Raster1&quot; &lt;= 15.\n\nNow, what the sloping algorithm does is calculate the probable slope of each pixel based on the surrounding pixels. For a more in-depth view, read about it here. That may leave your area with a salt-and-pepper look after you turn it into binary, with plenty of isolated pixels of &quot;possible&quot; buildable land. If that&#39;s what you wanted, then you&#39;re done! If, however, you want a minimum contiguous area to be able to call it a building area, then you&#39;ll have to generalize your data.\n\nMany softwares do that, but, afaik, ArcGIS isn&#39;t one of them. But QGIS does, in Raster -&gt; Analysis -&gt; Sieve. Here you&#39;ll define the minimum number of pixels to be part of a set; any number smaller than that will be mixed with surrounding pixels. The number of pixels should be a reflection of the minimum area you want, based on the spatial resolution of the original DEM. Note, however, that this alters your accuracy somewhat, so use it with care.\n\nElse, this is it. You can later isolate water and wetland by overlaying a vector layer with those informations and further clipping your raster with it.\n",
            "excerpt": "Both ArcGIS and QGIS can do this, as well as any other good GIS or <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> software. But first, you need to know what Spatial Reference System your DEM raster is in. &hellip; ",
            "title": "Calculating relative share of an area of circle that has slope &gt;15% in Germany"
        },
        {
            "tags": [
                "arcgis-desktop",
                "arcgis-10.0",
                "lidar",
                "3d-analyst",
                "arcscene"
            ],
            "question_score": 7,
            "is_accepted": false,
            "has_accepted_answer": false,
            "answer_count": 3,
            "is_answered": true,
            "question_id": 5838,
            "item_type": "question",
            "score": 7,
            "last_activity_date": 1440944827,
            "creation_date": 1297020820,
            "body": "I have Lidar data, ground points and first returns. I have processed it and have ready tiles from which I am trying to build 3D building models. \n\nSo far I was able to just extrude the buildings in the ArcScene and that is it.\n\nI am a beginner in GIS/Remote Sensing and any help would be highly appreciated.\n\nAlso, I am trying to work this out in Arc10.\n",
            "excerpt": "I am a beginner in GIS/<span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> and any help would be highly appreciated.\n\nAlso, I am trying to work this out in Arc10. &hellip; ",
            "title": "How to make 3D building models from lidar data in ArcGIS?"
        },
        {
            "tags": [
                "r",
                "land-classification",
                "random-forest",
                "machine-learning"
            ],
            "question_score": 33,
            "is_accepted": false,
            "answer_id": 172618,
            "is_answered": false,
            "question_id": 39021,
            "item_type": "answer",
            "score": 7,
            "last_activity_date": 1449229223,
            "creation_date": 1449229223,
            "body": "I know that this thread is a little old, but for anyone wanting to try classification of remote sensing data in , a very promising new package has been released.\n\n\n\nIt comes with functions for both unsupervised and supervised classification (using random forests). More information can be found here - http://bleutner.github.io/RStoolbox/\n",
            "excerpt": "I know that this thread is a little old, but for anyone wanting to try classification of <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> data in R, a very promising new package has been released. &hellip; ",
            "title": "How to perform Random Forest land cover classification?"
        },
        {
            "tags": [
                "raster",
                "r",
                "imagery",
                "digital-image-processing"
            ],
            "question_score": 7,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 64441,
            "item_type": "question",
            "score": 7,
            "last_activity_date": 1638061174,
            "creation_date": 1372221995,
            "body": "I am looking for a robust way to fill in missing values in some rasters. They all have a single layer. Missing values consist of single pixels to medium sized patches. Rasters are around 1000 x 1000 pixels in size and the largest patches are like 20x20 pixels.\nI&#39;m tempted to use aregImpute in the Hmisc R package.\nHas anyone used it for this purpose?\nthis approach looks seems very cool but I think it is only meant to produce aesthetically pleasing corrections.\nDetailed explanation of this:\nAll the rasters (I have 36 in total) share the same extent, they overlap and are aligned. Each raster is a different variable, I gathered variable from various sources (remote sensing, topographic and climatological). The original rasters come in various resolutions. The smallest being 30m. From there up they get as high as 1km. I resampled everything using cubic convolution (all the variables are continuos) to 1km. I have another 1km raster where I have data of a variable of interest for some sampled points. So I trained a model using those points and the other rasters as covariates to be able to generate a full raster of that variable. Unfortunately most covariate rasters have some missing values in them, actually not much but I would want to eliminate the problem entirely.\nI would like to use R for this.\n",
            "excerpt": "Each raster is a different variable, I gathered variable from various sources (<span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span>, topographic and climatological). The original rasters come in various resolutions. &hellip; ",
            "title": "Filling in missing values in raster using R"
        },
        {
            "tags": [
                "raster",
                "data",
                "remote-sensing",
                "satellite"
            ],
            "question_score": 7,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 160279,
            "item_type": "question",
            "score": 7,
            "last_activity_date": 1454329875,
            "creation_date": 1441029313,
            "body": "I usually work with daytime satellite images to do some image classification (mostly Landsat data from the USGS EarthExplorer). Right now I&#39;d like to check at some night time images to work on city lights but I don&#39;t know which data sets or web services I should take a look at. Ideally, I&#39;d like it to be a data set with long historical data 1970s-now but everything is welcome. Any ideas please?\n",
            "excerpt": "I usually work with daytime satellite images to do some image classification (mostly Landsat data from the USGS EarthExplorer). Right now I&#39;d like to check at some night time images to work on city li &hellip; ",
            "title": "Free open satellite or other remote sensing data for night time?"
        },
        {
            "tags": [
                "remote-sensing",
                "database"
            ],
            "question_score": 7,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 4097,
            "item_type": "question",
            "score": 7,
            "last_activity_date": 1452610598,
            "creation_date": 1291323063,
            "body": "I&#39;m a Remote Sensing PhD student, and as such I have a large number of satellite images that I&#39;m working with. I&#39;m starting to fail to keep track of them all and I have a lot of metadata that I want to track for each image (sensor, resolution, processing steps, format, source etc).\n\nI have been using the SPECCHIO database for storing Spectral Libraries for a while, and was wondering whether anything similar exists for storing images. I&#39;ve had a search and can&#39;t seem to find anything, but that doesn&#39;t mean that it doesn&#39;t exist!\n\nIdeally I&#39;m looking for something which can store a database of metadata and allow you to search for images that meet certain criteria (spatial resolution &gt; 10m, or includes a certain lat/long co-ordinate).\n\nDoes anyone know if anything like this exists?\n\nIf it doesn&#39;t exist then I might have a go at writing something, which may involved SQLite, ENVI, IDL and a lot of late nights...\n",
            "excerpt": "I&#39;m a <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span> PhD student, and as such I have a large number of satellite images that I&#39;m working with. &hellip; ",
            "title": "Imagery Database/Metadata Store"
        },
        {
            "tags": [
                "raster",
                "polygon",
                "r",
                "rasterization",
                "extract"
            ],
            "question_score": 7,
            "is_accepted": false,
            "has_accepted_answer": true,
            "answer_count": 1,
            "is_answered": true,
            "question_id": 231314,
            "item_type": "question",
            "score": 7,
            "last_activity_date": 1500425410,
            "creation_date": 1489002789,
            "body": "I am trying to create a function that takes in a shapefile and a binary (1&#39;s and 0&#39;s) raster, with the same extent, and extracts the values from the raster. Once this occurs I desire to sum up those values and get a percentage of pixels within those boundaries that are 1. Then rasterize these percentages. Here is what I have so far. It is working just fine BUT IS EXTREMELY SLOW! \n\n\n\nI read elsewhere it is faster to rasterize() the polygon first and use getValues() but I do not know how to apply this to my situation.\n\nThe project is for urban build-up/density using remote sensing data, hence the names. \n",
            "excerpt": "The project is for urban build-up/density using <span class=\"highlight\">remote</span> <span class=\"highlight\">sensing</span> data, hence the names. &hellip; ",
            "title": "How to speed up extract(rstr,shp) ? - R"
        },
        {
            "tags": [
                "qgis-2",
                "remote-sensing",
                "landsat",
                "landsat-5"
            ],
            "question_score": 5,
            "is_accepted": true,
            "answer_id": 108549,
            "is_answered": false,
            "question_id": 108546,
            "item_type": "answer",
            "score": 7,
            "last_activity_date": 1406485169,
            "creation_date": 1406485169,
            "body": "This varies greatly on the characteristics of the scene.  Fire scar mapping studies using Landsat-5 TM have used the following three band combinations:\n\n\nSpain: Bands 4, 5, 7\n\n\nCHUVIECO, E., and CONGALTON, R., 1988, Mapping and inventory of forest fires from digital\nprocessing of TM data. Geocarto International, 4, 41–53.\n\n\nAmazonia: Bands 3, 4, 5\n\n\nPEREIRA, M. C., and SETZER, A. W., 1993, Spectral characteristics of fire scars in Landsat-5 TM images of Amazonia. International Journal of Remote Sensing, 14, 2061–2078.\n\n\nGreece: Bands 4, 7, 1 or Bands 4, 7, 2\n\n\nKOUTSIAS, N., and KARTERIS, M., 1998, Logistic regression modeling of multitemporal\nThematic Mapper data for burned area mapping. International Journal of Remote\nSensing, 19, 3499–3514.\n\nKOUTSIAS, N., and KARTERIS, M., 2000, Burned area mapping using logistic regression\nmodeling of a single post-fire Landsat-5 Thematic Mapper image. International\nJournal of Remote Sensing, 21, 673–687.\n",
            "excerpt": "International Journal of <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>, 14, 2061–2078. &hellip; International\nJournal of <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>, 21, 673–687. &hellip; ",
            "title": "Best Landsat-5 TM band combination for detecting fire scars"
        },
        {
            "tags": [
                "remote-sensing",
                "lidar",
                "image-segmentation",
                "forest-ecology",
                "canopy-height-model"
            ],
            "question_score": 2,
            "is_accepted": false,
            "answer_id": 185002,
            "is_answered": false,
            "question_id": 184981,
            "item_type": "answer",
            "score": 7,
            "last_activity_date": 1523076746,
            "creation_date": 1458043372,
            "body": "I would encourage you to investigate the spatial wavelet analysis (SWA) method. This is an automated object oriented approach used to identifying individual tree canopies. The method has the potential to identify both tree height and canopy diameter from LiDAR derived canopy height models. The output is usually composed of a table with tree centroid coords, tree diameter and tree height (when coded for use with CHM&#39;s). The following paper goes into detail on the SWA method:\n\nFalkowski, M. J., Smith, A. M., Hudak, A. T., Gessler, P. E., Vierling, L. A., &amp; Crookston, N. L. (2006). Automated estimation of individual conifer tree height and crown diameter via two-dimensional spatial wavelet analysis of lidar data. Canadian Journal of Remote Sensing, 32(2), 153-161.\n\n\n",
            "excerpt": "Canadian Journal of <span class=\"highlight\">Remote</span> <span class=\"highlight\">Sensing</span>, 32(2), 153-161. &hellip; ",
            "title": "Identifying individual trees and segmenting crowns from LiDAR CHM data?"
        }
    ],
    "has_more": true,
    "quota_max": 300,
    "quota_remaining": 294
}